{
  "pageProps": {
    "bounty": {
      "contentfulId": "5ZctiuVmVDYDNiAvbWUpJQ",
      "id": "aera",
      "slug": "aera",
      "project": "Aera",
      "maxBounty": 120000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/7hifnzGwAruruZmx5bipNS/60b066ddd7ba77d14fa095ccce48bd26/Aera_Logo_Black.png",
      "launchDate": "2023-11-20T14:00+02:00",
      "endDate": null,
      "updatedDate": "2024-01-10T16:59:39.790Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $2,000 to USD $120,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "nqa4U05F8k1duf00MMZr9",
          "type": "smart_contract",
          "url": "https://polygonscan.com/address/0x1ce8CAa15e154aA8909B3cC68E34f7A02AFf2B55",
          "description": "Aera Vault V2 - POMWOMI",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3triA2Mt2uAbZMaI4qBw8k",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x3D6eEf6A92b15361697698695334E98C5db91D6b",
          "description": "Aera Vault V2 - Compound",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3vAg3M8nLMvwMazICgAzxf",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x9ecf0d8dcc0076dd153749bece0762acae1c9049",
          "description": "Aera Vault V2 - Threshold",
          "isPrimacyOfImpact": null
        },
        {
          "id": "7asR01zxG9OPR7JpGcdHsR",
          "type": "smart_contract",
          "url": "https://polygonscan.com/address/0x1ce8CAa15e154aA8909B3cC68E34f7A02AFf2B55",
          "description": "Aera Vault V2 - Gauntlet",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1yW429lmT47ICoUqZCwJHa",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x744BfF6cA503955d87Fa6a90b866d8f952805C43",
          "description": "Aera Vault V2",
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "2GekBscrY4uB73erPTzTHB",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "2sxC79bJ8NfOl2Iu5BUK0k",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3V59QCufE2PmAQ8rUARW9h",
          "title": "Theft of unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "2KzrtQBOsKNL9uSELyN00C",
          "title": "Permanent freezing of unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        }
      ],
      "programOverview": "Aera is a treasury management protocol that aims to address existing shortcomings with controlling treasury funds.\n\nFor more information about Aera, please visit [https://www.aera.finance/.](https://www.aera.finance/)  \n\nAera provides rewards in USDC. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__KYC Requirement__\n\nThe provision of KYC is required to receive a reward for this bug bounty program where the following information will be required to be provided:\n- Government-Issued ID or Corporate Charter Docs; EIN/TIN/ITIN or W9 (or equivalent); \n- Proof of current address\n\nKYC information is only required on confirmation of the validity of a bug report.   \n\n__Responsible Publication__\n\nAera adheres to category 3. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nAera adheres to the Primacy of Rules, which means that the whole bug bounty program is run strictly under the terms stated in this page.\n\n__Known Issue Assurance__\n\nAera commits to providing Known Issue Assurance to bug submissions through their program. This means that Aera will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Invoicing Information__\n\nIf needed by the security researcher, Aera is able to provide the necessary information for the proper issuance of an invoice. This includes:\n- Legal Entity \n- Registered Address\n- Email where to send the invoice\n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Smart Contract bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 120,000. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of USD 2,000 is to be rewarded in order to incentivize security researchers against withholding a bug report.   \n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack is considered if the smart contracts where the vulnerability exists can be upgraded, paused, or killed. If the attack impacts a smart contract directly holding funds that cannot be upgraded or paused, the amount of funds at risk will be calculated with the first attack being at 100% of the funds that could be stolen and then a reduction of 25% from the amount of the first attack for every 300 blocks the attack needs for subsequent attacks from the first attack, rounded down. For avoidance of doubt, if a second attack would happen at 600 blocks and then a third at 900 blocks, the funds at risk would be counted at 50% and 75% of the reward from the first attack, respectively.\n\n__Restrictions on Security Researcher Eligibility__\n\nSecurity researchers who fall under any of the following are ineligible for a reward\n- Bug reports from current or prior compensated team members of Gauntlet Networks Inc. or Aera Foundation will not be eligible for a reward.\n- Employees and team members of third-party suppliers to Gauntlet Networks Inc. or Aera Foundation will also not be eligible for a reward.\n- Bug reports from OpenZeppelin team members and other third-party protocols that are used as Aera assets in the asset registry (including but not limited to Compound, Aave and others) are also not eligible for the bug bounty program (as they are considered critical infrastructure for Aera)\n- The submitter will also need to: be at least 18 years of age, be reporting in an individual capacity, or if employed by a company, reporting with the company’s written approval to submit a disclosure to Gauntlet Networks Inc. Not be subject to US sanctions or reside in a US-embargoed country.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- Risks of MEV in executed or submitted transactions\n- Risks associated with an untrusted guardian\n- Risks associated with faulty oracles or third-party ERC20/ERC4626 asset implementations\n- Risks associated with use of `execute` by treasury\n- Risks associated with unsanctioned collusion of different roles (e.g., guardian and owner of asset registry)\n\n__Previous Audits__\n\nAera has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [https://github.com/aera-finance/aera-contracts-public/blob/main/v2/audits/spearbit/2023-09-22.pdf ](https://github.com/aera-finance/aera-contracts-public/blob/main/v2/audits/spearbit/2023-09-22.pdf)\n\n__Feasibility Limitations__\n\nBug reports that require an attack that involve one or more other protocols (e.g. utilizing flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be -50% of bounty reward. However, they will be considered as in-scope and categorized according to the program rules as long as all of the following are true:\n- Losses or other negative effects of the attack are inflicted upon Aera ecosystem participants \n- The additional protocols used must have enough liquidity in various assets to allow the attack to succeed at the time of bug report submission. For example: if an attack requires an ETH flash loan, but the amount is larger than all the ETH available for loan across the ecosystem\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Smart Contract, Critical Severity Level\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Aera team directly and are denominated in USD. However, payments are done in USDC.\n",
      "outOfScopeAndRules": "__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts__\n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Best practice recommendations\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "All code of Aera can be found at [https://github.com/aera-finance/aera-contracts-public/tree/main/v2.](https://github.com/aera-finance/aera-contracts-public/tree/main/v2) Documentation for the assets provided in the table can be found at [https://docs.aera.finance/. ](https://docs.aera.finance/) \n\nOther helpful links include:\n- [https://uploads-ssl.webflow.com/62cd150e5e9efc960319c44d/6346c4525380f8fa6435c2b5_Aera_Whitepaper.pdf](https://uploads-ssl.webflow.com/62cd150e5e9efc960319c44d/6346c4525380f8fa6435c2b5_Aera_Whitepaper.pdf)\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "Asset Management"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $2,000 to USD $120,000"
          }
        ],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "Aera Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Aera and get paid up to $120,000.",
      "url": "https://immunefi.com/bug-bounty/aera",
      "ogImg": "/api/bounty/og-image?project=Aera"
    }
  },
  "__N_SSG": true
}
