{
  "pageProps": {
    "bounty": {
      "contentfulId": "5uocLZV8kf69JNXJ8Xo52L",
      "id": "alephzero",
      "slug": "alephzero",
      "project": "Aleph Zero",
      "maxBounty": 50000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/ijqPWUm6i7qSGMKP6FJvR/312102e9caea0fea40c3573ffff31189/Aleph_Zero_logo.jpeg",
      "launchDate": "2023-08-16T11:30-06:00",
      "endDate": null,
      "updatedDate": "2024-04-08T18:53:57.069Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "USD $50,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "USD $15,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "medium",
          "payout": "USD $5,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "low",
          "payout": "USD $1,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "5Tgj7PweopJEUCv9ksUEOC",
          "type": "blockchain_dlt",
          "url": "https://github.com/Cardinal-Cryptography/aleph-node/releases",
          "description": "Aleph Node",
          "isPrimacyOfImpact": null
        },
        {
          "id": "6LKq4NEYX8KeEE1SV8g8c",
          "type": "blockchain_dlt",
          "url": "https://crates.io/crates/aleph-bft",
          "description": "AlephBFT",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2E8eX8GQSi8Zr53H2IYsw1",
          "type": "blockchain_dlt",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true
        }
      ],
      "impacts": [
        {
          "id": "118uCpeTUy7ASLLk7DTw6s",
          "title": "Network not being able to confirm new transactions (Total network shutdown)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "5t2iTpc1C90YsQghFNYwid",
          "title": "Unintended permanent chain split requiring hard fork (Network partition requiring hard fork)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "5Bwx5iezUmxcFFVTmshGRk",
          "title": "Arbitrary signature forging",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "6rBVuCmiNrrPMivH5jS7rY",
          "title": "Permanent finalization stall",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "6fH1YQ23Lo9dGfiiUc90HY",
          "title": "Prolonged chain splits and/or long, finalization stalls",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "1o4tcROwXV0MgXbwYDTCJq",
          "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "1fU5epEYxw76t5hsccS3eG",
          "title": "High compute consumption by validator nodes",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "3jkhOp2TChg3GAQsNmJ19r",
          "title": "Underpricing transaction fees relative to computation time",
          "type": "blockchain_dlt",
          "severity": "low"
        }
      ],
      "programOverview": "Aleph Zero is an enterprise-ready, high-performance blockchain platform with a novel, Directed Acyclic Graph (DAG)-based consensus protocol that has been peer-reviewed and presented at an ACM conference. To date, Aleph Zero raised $15m for continued development, integrated with the Parity’s Substrate stack, and expanded the team to ~50 people. In 2022, Aleph Zero has delivered a number of key milestones, including introducing community validators, enabling smart contracts and delivering its first privacy features.\n\nFor more information about Aleph Zero, please visit: [https://alephzero.org/](https://alephzero.org/)\n\nAleph Zero provides rewards in USDT, USDC, and AZERO. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__Responsible Publication__\n\nAleph Zero adheres to category 2 “Notice Required”. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nAleph Zero adheres to the Primacy of Impact for the following severity levels:\n- Blockchain/DLT - Critical\n- Blockchain/DLT - High\n- Blockchain/DLT - Medium\n- Blockchain/DLT - Low\n\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact.\n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Known Issue Assurance__\n\nAleph Zero commits to providing Known Issue Assurance to bug submissions through their program. This means that Aleph Zero will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Immunefi Standard Badge__\n\nAleph Zero has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-), which is given to projects that adhere to our best practices. \n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- Any outdated or vulnerable dependencies, unless directly exploitable against Assets in Scope with the severity “Low” or higher.\n\n__Previous Audits__\n\nAleph Zero has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n-[ https://assets.alephzero.org/docs/trail-of-bits-consensus-audit.pdf](https://assets.alephzero.org/docs/trail-of-bits-consensus-audit.pdf)\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Blockchain/DLT - Critical\n- Blockchain/DLT - High\n- Blockchain/DLT - Medium\n- Blockchain/DLT - Low\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Aleph Zero team directly and are denominated in USD. However, payments are done in AZERO, USDT and USDC.  Medium and Low reward will be paid in AZERO.  High and Critical reward will be paid 50% in AZERO and 50% in USDT and USDC.\n\nThe calculation of the net amount rewarded is based on the average price between CoinMarketCap.com and CoinGecko.com at the time the bug report was submitted. No adjustments are made based on liquidity availability. For avoidance of doubt, if the reward amount is USD 5 000 and the average price is USD 1.75 per token, then the reward will be 2857.142857 units of that token.\n",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts and Blockchain/DLT__ \n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "All code of Aleph Zero can be found at [https://github.com/orgs/Cardinal-Cryptography/repositories.](https://github.com/orgs/Cardinal-Cryptography/repositories) Documentation for the assets provided in the table can be found at [https://docs.alephzero.org/aleph-zero/. ](https://docs.alephzero.org/aleph-zero/)\n\nOther helpful links include:\n- [https://alephzero.org/developers](https://alephzero.org/developers)\n- [https://cardinal-cryptography.github.io/AlephBFT/what_is_aleph_bft.html](https://cardinal-cryptography.github.io/AlephBFT/what_is_aleph_bft.html)\n- [https://github.com/Cardinal-Cryptography/aleph-node#local-network](https://github.com/Cardinal-Cryptography/aleph-node#local-network)\n- [https://github.com/Cardinal-Cryptography/aleph-node/blob/main/BUILD.md](https://github.com/Cardinal-Cryptography/aleph-node/blob/main/BUILD.md)\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "Bridge",
          "L1",
          "Zero-Knowledge Proofs"
        ],
        "projectType": [
          "Blockchain",
          "Infrastructure"
        ],
        "ecosystem": [
          "Polkadot"
        ],
        "programType": [
          "Blockchain/DLT"
        ],
        "language": [
          "Rust"
        ]
      },
      "legacy": {
        "technologies": [
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000"
          },
          {
            "level": "High",
            "payout": "USD $15,000"
          },
          {
            "level": "Medium",
            "payout": "USD $5,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "Aleph Zero Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Aleph Zero and get paid up to $50,000.",
      "url": "https://immunefi.com/bug-bounty/alephzero",
      "ogImg": "/api/bounty/og-image?project=Aleph+Zero"
    }
  },
  "__N_SSG": true
}
