{
  "pageProps": {
    "bounty": {
      "contentfulId": "3xu5W3zuph8RMAhAAEEjGm",
      "id": "apecoinmainnet",
      "slug": "apecoinmainnet",
      "project": "ApeCoin Mainnet",
      "maxBounty": 3500000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/2Pv5v8qy7B5xVa3zU0lIfn/1c5059f2aed9dcd70c66b9500fc31bbf/ApeCoin_logo.jpeg",
      "launchDate": "2022-12-07T06:00:00.000Z",
      "endDate": null,
      "updatedDate": "2024-04-08T18:51:35.004Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $100,000 to USD $3,500,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "6e35GKxLvb8FL0gh7ghWfb",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x5954aB967Bc958940b7EB73ee84797Dc8a2AFbb9",
          "description": "Apecoin Staking",
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "7yToSFTMa533CRDuvVHZuI",
          "title": "Direct theft of any user deposited ApeCoin or unclaimed staking yield, whether at-rest or in-motion",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "2L1mnFIw6cmZg5hFT5yOrH",
          "title": "Permanent freezing of user deposited ApeCoin or unclaimed staking yield above $100,000 in value",
          "type": "smart_contract",
          "severity": "critical"
        }
      ],
      "programOverview": "ApeCoin is an ERC-20 governance and utility token used within the APE ecosystem to empower a decentralized community building at the forefront of web3. It allows its holders to participate in the ApeCoin DAO and provides access to exclusive games, merch, events, services, and more.\n\nEarlier this year, the DAO voted to launch a staking system to incentivize engagement within the ecosystem. ApeCoin staking will allow users to stake their APE in various pools to gain rewards. Anyone holding ApeCoin can participate, however additional pools are available to holders who own NFTs within the Bored Ape Yacht Club ecosystem.\n\nFor more information about Apecoin and staking, please visit [https://apecoin.com](https://apecoin.com/) and read [AIP-21](https://forum.apecoin.com/t/aip-21-staking-process-with-caps-1x-drop-process/5074) and [AIP-22](https://forum.apecoin.com/t/aip-22-staking-pool-allocation-reloaded-ecosystem-fund-allocation/5071).\n\nThe program will continue for the life of the staking system (3 years).",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.2](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-2). This is a simplified 5-level scale, with separate scales for websites/apps, smart contracts, and blockchains/DLTs, focusing on the impact of the vulnerability reported.\n\nCritical smart contract vulnerabilities are capped at 10% of economic damage, primarily based on value at risk, but also PR and branding aspects. However, there is a minimum reward for critical vulnerabilities of __USD 100 000__. \n\n\nAll bug reports must come with a PoC with an end-effect impacting an asset-in-scope in order to be considered for a reward. Explanations and statements are not accepted as PoC and code is required.\n\nAll vulnerabilities marked acknowledged and accepted in the [Halborn security review](https://drive.google.com/file/d/1ppauv4me-WWWKIwWUUiWP32vtisXcKKg/view?usp=share_link) are not eligible for a reward.\n\nApeCoin requires KYC to be done for all bug bounty hunters submitting a report and wanting a reward. Recipients must provide their name, certificate of incorporation (if a company), physical address, email address, ethereum address to receive the funds, and confirmation on whether the ethereum address is at an exchange or other custodian, or owned directly by the recipient. They will also be required to sign the ApeCoin foundation’s standard grant agreement document. The collection of this information will be done by the project team.\n\nPayouts are handled by the __ApeCoin Foundation__ directly and are denominated in __USD__. However, all payouts are done in __ApeCoin (APE)__.",
      "outOfScopeAndRules": "The following vulnerabilities are excluded from the rewards for this bug bounty program:\n\n  - User error that results in the loss of custody of a BAYC, MAYC, or BAKC which leads to the unintentional loss of staked ApeCoin\n  - Attacks that the reporter has already exploited themselves, leading to damage\n  - Attacks requiring access to leaked keys/credentials\n  - Attacks requiring access to privileged addresses (governance, strategist)\n\n__Smart Contracts and Blockchain__\n  - Incorrect data supplied by third party oracles\n    - Not to exclude oracle manipulation/flash loan attacks, which are in-scope\n  - Basic economic governance attacks (e.g. 51% attack)\n  - Lack of liquidity\n  - Best practice critiques\n  - Sybil attacks\n  - Centralization risks\n\nThe following activities are prohibited by this bug bounty program:\n  - Any testing with mainnet or public testnet contracts; all testing should be done on private testnets\n  - Any testing with pricing oracles or third party smart contracts\n  - Attempting phishing or other social engineering attacks against our employees and/or customers\n  - Any testing with third party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n  - Any denial of service attacks\n  - Automated testing of services that generates significant amounts of traffic\n  - Public disclosure of an unpatched vulnerability in an embargoed bounty\n  - Vulnerabilities requiring access to the staking contract’s owner role\nAttacks that are a direct result of user error (e.g. using incorrect function arguments)",
      "assetsBodyV2": "All smart contracts can be found in the [staking github repo](https://github.com/HorizenLabs/ape-staking-public). However, only [ApeCoinStaking.sol](https://github.com/HorizenLabs/ape-staking-public/blob/main/contracts/ApeCoinStaking.sol) is in-scope for the bug bounty program. The repo is a hardhat project that contains a simple local deploy script that uses realistic config parameters.\n\nIf an impact can be caused to any other asset managed by ApeCoin that isn’t on this table but for which the impact is in the Impacts in Scope section below, you are encouraged to submit it for the consideration by the project.\n\nPlease watch the [Horizen Labs Ape Staking Smart Contract Walk-Thru](https://www.youtube.com/watch?v=_LO-1f9nyjs) for a video overview of the staking contract and read the docs for further information, [https://docs.apestake.io/](https://docs.apestake.io/).",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "Staking",
          "Token"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $100,000 to USD $3,500,000"
          }
        ],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "ApeCoin Mainnet Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on ApeCoin Mainnet and get paid up to $3,500,000.",
      "url": "https://immunefi.com/bug-bounty/apecoinmainnet",
      "ogImg": "/api/bounty/og-image?project=ApeCoin+Mainnet"
    }
  },
  "__N_SSG": true
}
