{
  "pageProps": {
    "isAttackathon": false,
    "academyContent": null,
    "ethereumAttackathonSponsors": null,
    "project": {
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "bounty": {
      "contentfulId": "6UE7QOY0udMSU9Pdb9bI5T",
      "id": "audit-comp-shardeum-ancillaries-iii",
      "slug": "audit-comp-shardeum-ancillaries-iii",
      "project": "Audit Comp | Shardeum: Ancillaries III",
      "maxBounty": 100000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/50jbsPjqHgWEHZN7KZIjiB/396901905d4d1515ab3c0aaa9fc5bcc4/4B19YQz__400x400.png",
      "launchDate": "2025-01-15T21:45:00.000Z",
      "endDate": "2025-02-12T17:00:00.000Z",
      "updatedDate": "2025-03-31T17:47:16.075Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "medium",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "low",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        }
      ],
      "audits": [
        {
          "id": "1LdgNqdnEosXZIK0TDXW8K",
          "url": "https://reports.immunefi.com/shardeum-ancillaries",
          "auditor": "Immunefi",
          "date": "2024-08-14"
        },
        {
          "id": "2u2ne92N780VjqSsruy0X9",
          "url": "https://reports.immunefi.com/shardeum-ancillaries-ii",
          "auditor": "Immunefi",
          "date": "2024-10-16"
        },
        {
          "id": "7cYyx5S4ct0NnNUl6LSClM",
          "url": "https://docs.google.com/document/d/1OlmijVY2ga_7QEe8DYU-NTEXfAqMRpuwlduIofjmEwA",
          "auditor": "Arcadia",
          "date": "2024-02-23"
        },
        {
          "id": "7L38JwR6JKQ5Rf0VRlPFAM",
          "url": "https://docs.google.com/document/d/1n11d40JZYgL33-F-Lw6FMuBP9AJSXvyg-xBpJhwOkUE",
          "auditor": "HashCloak",
          "date": "2024-04-16"
        }
      ],
      "assets": [
        {
          "id": "1tMlkjWqhWtajFQqqXs1Gx",
          "type": "websites_and_applications",
          "url": "https://github.com/shardeum/validator-gui/tree/itn4",
          "description": "WebApp - - 7313",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:45:00.000Z"
        },
        {
          "id": "23FDMXtxRH47E7PBPDqYIj",
          "type": "websites_and_applications",
          "url": "https://github.com/shardeum/validator-cli/tree/itn4",
          "description": "Command line app - 2051",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:45:00.000Z"
        },
        {
          "id": "2sj6azi1QKbu3NiyIGqqVk",
          "type": "websites_and_applications",
          "url": "https://github.com/shardeum/archive-server/tree/itn4",
          "description": "WebApp - 14144",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:45:00.000Z"
        },
        {
          "id": "4CIVRMfv0ub6OtOOhwt0ka",
          "type": "websites_and_applications",
          "url": "https://github.com/shardeum/json-rpc-server/tree/itn4",
          "description": "WebApp - 8015",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:45:00.000Z"
        }
      ],
      "impacts": [
        {
          "id": 35,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Execute arbitrary system commands"
        },
        {
          "id": 36,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Retrieve sensitive data/files from a running server, such as:\n- /etc/shadow\n- database passwords\n- blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)"
        },
        {
          "id": 39,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Taking and/modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as:\n- Changing registration information\n- Commenting\n- Voting\n- Making trades\n- Withdrawals, etc."
        },
        {
          "id": 42,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Direct theft of user funds"
        },
        {
          "id": 43,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Malicious interactions with an already-connected wallet, such as:\n- Modifying transaction arguments or parameters\n- Substituting contract addresses\n- Submitting malicious transactions"
        },
        {
          "id": 46,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Injecting/modifying the static content on the target application without JavaScript (persistent), such as:\n- HTML injection without JavaScript\n- Replacing existing text with arbitrary text\n- Arbitrary file uploads, etc."
        },
        {
          "id": 47,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as:\n- Email\n- Password of the victim etc."
        },
        {
          "id": 48,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Improperly disclosing confidential user information, such as:\n- Email address\n- Phone number\n- Physical address, etc."
        },
        {
          "id": 50,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Changing non-sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as:\n- Changing the first/last name of user\n- Enabling/disabling notifications"
        },
        {
          "id": 51,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Injecting/modifying the static content on the target application without JavaScript (reflected), such as:\n- Reflected HTML Injection\n- Loading external site data"
        },
        {
          "id": 52,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Redirecting users to malicious websites (open redirect)"
        },
        {
          "id": 53,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Changing details of other users (including modifying browser local storage) without already-connected wallet interaction and with significant user interaction, such as:\n- Iframing leading to modifying the backend/browser state (must demonstrate impact with PoC)"
        },
        {
          "id": 54,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Taking over broken or expired outgoing links, such as:\n- Social media handles, etc."
        },
        {
          "id": 55,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Temporarily disabling user to access target site, such as:\n- Locking up the victim from login\n- Cookie bombing, etc."
        },
        {
          "id": 5284,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Taking down the application/website"
        },
        {
          "id": 5286,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Subdomain takeover without already-connected wallet interaction"
        },
        {
          "id": 5287,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer"
        },
        {
          "id": 5288,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Injection of malicious HTML or XSS through metadata"
        }
      ],
      "programOverview": "Shardeum is an EVM-based, linearly scalable network offering low gas fees forever while maintaining true decentralization and (hopefully) solid security. Shardeum is a large project and as such, will be split over two concurrent boosts. This boost, called Ancillaries III, will cover the Web2 aspects of the project. This will cover four components: The validator GUI, validator CLI, Archive Server, and the RPC server.\n\nThis Audit Competition is running on testnet. The following conditions apply:\n\n- Shardeum team will freeze the codebase during the duration of the Audit Competition\n- Duplicates are rewarded\n\nShardeum provides rewards in USDC, denominated in USD. \n\nFor more information about Shardeum, please visit [https://shardeum.org/](https://shardeum.org/)",
      "prioritizedVulnerabilities": "Only the impacts listed in this program are accepted within this AC program.  All other impacts are not considered as in-scope, even if they affect something in the assets in scope table",
      "rewardsBody": "The following reward terms are a summary, for the full details read our [Ancillaries III Boost Reward Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/31797437799441-Shardeum-Ancillaries-III-Audit-Competition-Reward-Terms)\n\n\nThe reward pool will be entirely distributed among participants. The size depends on the bugs found:\n* If one or more Critical severity bugs are found, **the reward pool will be 100% of the respective reward pool, $100,000 USD**\n* If one or more High severity bugs are found, the **reward pool will be 75% of the respective reward pool, $75,000 USD** \n* If one or more Medium severity bugs are found, **the reward pool will be 50% of the respective reward pool, $50,000 USD**\n* Otherwise, the reward pool will be **25% of the respective reward pool, $25,000 USD**\n\nFor this Audit Competition, duplicates and private known issues are valid for a reward. \n\nPrivate known issues will unlock higher reward pools according to their severity level without any downgrade. For example, a Critical severity bug which was a private known issue would unlock the reward pool conditional on a Critical severity bug being found.\n\n\nRewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.3.](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/) \n\n**Duplicates of Insight reports are not eligible for a reward.** \n\n**Reward Payment Terms**\nPayouts are handled by the Shardeum team directly and are denominated in USD. However, payments are done in USDC\n\n**Insight Rewards Payment Terms**\nInsight Rewards: Portion of the Rewards Pool\n\nThe \"Insight\" severity was introduced on Audit Competition & Attackathon programs to recognize contributions that extend beyond identifying immediate vulnerabilities. Currently, it's not an option to select the Insight severity when submitting a report. However, our team or program will designate it accordingly if applicable. \"Insights\" underscores our commitment to valuing all types of contributions that contribute to a more secure environment and will always be rewarded. [View more information about Insights.](https://immunefisupport.zendesk.com/hc/en-us/articles/13333032674961-Severity-Classification-System?utm_source=immunefi)",
      "outOfScopeAndRules": "Bug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \nBugs from previous bounties are in scope unless explicitly said otherwise. Reports 33428, 33655, 33963, 34508, 33576, 34053, 36024, 36025, 36025 are OOS.\n\n[https://reports.immunefi.com/shardeum-ancillaries](https://reports.immunefi.com/shardeum-ancillaries-ii)\n[https://reports.immunefi.com/shardeum-ancillaries-ii](https://reports.immunefi.com/shardeum-ancillaries-ii)",
      "assetsBodyV2": "__Asset Accuracy Assurance__\n\nBugs found on assets incorrectly listed in-scope will be considered valid and be rewarded.\n\n__Private Known Issues Reward Policy__\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward equal to that of a bug one severity lower.\n\n__Known Issue Assurance__\n\nShardeum commits to providing Known Issue Assurance to bug submissions through their program. This means that Shardeum will either disclose known issues publicly, or at the very least, privately via a self-reported bug submission. \n\nIn a potential scenario of a mediation, this allows for a more objective and streamlined process, in order to prove that an issue is known. Otherwise, assuming the bug report is valid, it would result in the report being considered as in-scope, and due a reward.\n\n__Primacy of Impact vs Primacy of Rules__\n\nShardeum adheres to the Primacy of Rules, which means that the whole bug bounty program is run strictly under the terms and conditions stated within this page. \n\n\n__Eligibility Criteria__\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n__Responsible Publication__\n\nWhitehats may publish their bug reports after they have been fixed & paid, or closed as invalid, with the following exceptions:\n- Bug reports in mediation may not be published until mediation has concluded and the bug report is resolved.\n\nImmunefi may publish bug reports submitted to this audit competition and a leaderboard of the participants and their earnings.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Shardeum has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209-The-Immunefi-Standard-Badge).",
      "impactsBody": "__Proof of Concept (PoC) Requirements__\n\nPOCs should be tested against the most recent changes on the /tree/dev github repo.\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules).\n\n**Which parts of the code are you most concerned about?**\nCommunication between the archiver and validators\nCommunication between the RPC and the validators\nThe GUI\n\n**What attack vectors are you most concerned about?**\nPriv escalation from the GUI\nCrashing archivers\nPriv escalation in  archivers. Archivers will not be public at launch\nPriv escalation in RPC\nLoss of data integrity on archive/RPC servers  Ex: changing receipts\n**Which part(s) of the system do you want whitehats to attempt to break the most?**\nArchiver and RPC server. We want them to break all of it obviously but we believe these two components need more attention\n\n**What external dependencies are there?**\n\nThings listed in package.json\n\n**Where might Security Researchers confuse out-of-scope code to be in-scope?**\n\nThe default config in the branch is in scope. Whitehats are free to configure, patch, and modify their own malicious hosts however they want. However, target service must be running the default config in the target branch running in production mode. Vulns involving a service attacking itself are not in scope. This is to prevent the whitehats from wasting time reporting things we specifically allow in debug mode. If the researchers can enable debug mode options remotely then that is valid and can be paid out.\nAttacks that require the attacker to own an archive server will have their severity reduced to insight by default, but may be raised at the project’s discretion.\nAttacks that require the network to still be initializing/bootstrapping are out of scope. Wait until the network mode reaches “processing” + 15 cycles after startup before launching attacks. The rules for staking/join are a little different and the network will not be public during this time. Attacks on a network that is repairing itself (was once in “processing” mode but has since degraded to “safety” or “recovery”) are in scope.\nAttacks that require lots of network traffic, large messages, or many connections will be given an severity of “insight”. The project may increase this at our discretion.\n0day vulnerabilities in dependencies will have a max impact of insight. Any other vuln in dependencies is out of scope.\nAny report based on unit tests, simulations, or anything not a fully functioning service, will have a max impact of low.\nSmart contracts and smart contract related code/functions are out of scope\nFinally, the more nodes that are required to launch an attack, the more at risk the vuln is of being downgraded. If it takes 33% (for example) of the nodes in the network being malicious to cause damage, then it becomes difficult to distinguish the impact from a brute-force/51% attack, which is completely out of scope.\n\n**Are there any unusual points about your protocol that may confuse Security Researchers?**\n\nThe archive server is designed to store the history of the network. Archivers are not a part of the core protocol, do not have any part in consensus, and do not affect joining/rotation. Another quirk is that currently, the transaction history is not chained. The cycle certificates are chained which contains information like joined and lost nodes per cycle, active nodes, archiver list, standby list, etc. The transaction history will have a Merkle root published while the chaining is developed.",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Not Required",
          "Step-by-step PoC Required"
        ],
        "productType": [
          "Services",
          "Validator"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": [
          "Shardeum"
        ],
        "programType": [
          "Websites and Applications"
        ],
        "language": [
          "Typescript"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "High",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Medium",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Low",
            "payout": "Portion of the Reward Pool"
          }
        ]
      },
      "evaluationEndDate": "2025-03-31T17:47:10.219Z",
      "boostedIntroStartingIn": "A total of $100,000 USD in rewards is available for identifying bugs in Shardeum Ancillaries III. This scope is limited to the Web2 components of the project.\n\nNo KYC is required.\n\nAny technical questions can be asked directly to the Shardeum technical team on [Immunefi’s Discord](https://discord.com/invite/immunefi) in the \"shardeum-ancillaries-iii-audit-competition\" channel.\n\nShardeum will record a technical walkthrough, which will then be shared in the Immunefi Discord.\n\nWhen the Audit Competition has ended, Immunefi will publish an event-specific leaderboard and bug reports from the event.",
      "boostedIntroLive": "",
      "boostedIntroEvaluating": "",
      "boostedIntroFinished": "Audit Competition cards for security researchers with paid reports are available [here](https://drive.google.com/drive/folders/11ltDwfWK0Ow799N_FY9oZ8Bpk8Oynj5p?usp=sharing). \n\nAll paid bug reports are available in original format [here](https://reports.immunefi.com/shardeum-ancillaries-iii)",
      "rewardsToken": "USDC",
      "rewardsPool": 100000,
      "primaryPool": 100000,
      "allStarsPool": 0,
      "podiumPool": 0,
      "sourceLinesOfCode": 31523,
      "boostedSummaryReport": "https://drive.google.com/file/d/1cuZEwk7e163gcIe0a-AGLnpvOd0eJlZj/view",
      "inviteOnly": false,
      "hideAssetsInScope": null,
      "boostedLeaderboard": [
        {
          "high": 0,
          "name": "Blockian",
          "critical": 3,
          "earnings": 49315,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 3
        },
        {
          "high": 0,
          "name": "periniondon630",
          "critical": 3,
          "earnings": 31936,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 3
        },
        {
          "high": 0,
          "name": "ZhouWu",
          "critical": 1,
          "earnings": 9836,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "anton_quantish",
          "critical": 0,
          "earnings": 5542,
          "insights": 0,
          "mediumLow": 4,
          "totalValidBugs": 4
        },
        {
          "high": 0,
          "name": "Franfran",
          "critical": 0,
          "earnings": 2197,
          "insights": 1,
          "mediumLow": 2,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "riproprip",
          "critical": 0,
          "earnings": 675,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "br0nz3p1ck4x3",
          "critical": 0,
          "earnings": 500,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 0
        }
      ],
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "academyStartDate": null,
      "websiteUrl": "https://shardeum.org/",
      "description": "Shardeum is an EVM-based, linearly scalable network offering low gas fees forever while maintaining true decentralization and (hopefully) solid security. Shardeum is a large project and as such, will be split over two concurrent boosts. This boost, called Ancillaries III, will cover the Web2 aspects of the project. This will cover four components: The validator GUI, validator CLI, Archive Server, and the RPC server. For more information about Shardeum, please visit [https://shardeum.org/](https://shardeum.org/) \n\n",
      "githubUrl": "https://github.com/shardeum",
      "feasibilityLimitations": null,
      "prohibitedActivites": null,
      "responsiblePublicationCategory": null,
      "knownIssues": [
        {
          "id": 5,
          "description": "Known Issues before BB1",
          "link": "https://drive.google.com/file/d/1H6o8IPtrlTDvr_cfTRhvgr1Vvh4EYwb8/view",
          "lastUpdatedAt": "2024-12-17T00:00:00.000Z",
          "relatedImpactInScope": "websites_and_applications"
        }
      ],
      "knownIssueAssurance": false,
      "defaultOutOfScopeBlockchain": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
      "defaultOutOfScopeSmartContract": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
      "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
      "defaultOutOfScopeWebAndApplications": "- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n- SPF/DMARC misconfigured records)\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering",
      "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
      "customOutOfScopeInformation": "Bug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \nBugs from previous bounties are in scope unless explicitly said otherwise. Reports 33428, 33655, 33963, 34508, 33576, 34053, 36024, 36025, 36025 are OOS.\n\n[https://reports.immunefi.com/shardeum-ancillaries](https://reports.immunefi.com/shardeum-ancillaries-ii)\n\n[https://reports.immunefi.com/shardeum-ancillaries-ii](https://reports.immunefi.com/shardeum-ancillaries-ii)\n\n\n**Other Known issues**\n\n- AJV Validation error on archiver can cause missing receipts [https://github.com/shardeum/archiver/blob/bugbounty/src/Data/Collector.ts#L280](https://github.com/shardeum/archiver/blob/bugbounty/src/Data/Collector.ts#L280)\n\n- getTxTimestampBinary endpoint could be used as a memory overflow mechanism [https://github.com/shardeum/core/blob/9dae0abe5232ed532a9285da82118b41a04b3711/src/state-manager/TransactionConsensus.ts#L1796](https://github.com/shardeum/core/blob/9dae0abe5232ed532a9285da82118b41a04b3711/src/state-manager/TransactionConsensus.ts#L1796)\n\n- SQL injection in inputs at https://github.com/shardeum/shardeum/blob/dev/src/storage/sqlite3storage.ts#L257-L289\n\n- Tx data : ( ORIGINAL_TX_DATA) getting saved in originalTxData, processedData and transaction table without any verification [https://github.com/shardeum/archiver/blob/cbe1d515e91058d17fa483f84361992cd3d1cf9c/src/archivedCycle/StateMetaData.ts#L156](https://github.com/shardeum/archiver/blob/cbe1d515e91058d17fa483f84361992cd3d1cf9c/src/archivedCycle/StateMetaData.ts#L156)",
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Ethereum",
      "eligibilityCriteria": [],
      "eligibilityCriteriaAdditionalInformation": null,
      "programCodebases": [],
      "programDocumentations": [
        {
          "id": 168,
          "title": "Shardeum's Documentation",
          "description": "Shardeum’s up to date documentation can be found at",
          "url": "https://docs.shardeum.org/"
        },
        {
          "id": 169,
          "title": "Shardeum's Codebase",
          "description": "Shardeum’s up to date codebase can be found at",
          "url": "https://github.com/shardeum/?utm_source=immunefi"
        },
        {
          "id": 171,
          "title": "Shardeum’s youtube page",
          "description": "Shardeum’s youtube page can be found at",
          "url": "https://www.youtube.com/@Shardeum"
        },
        {
          "id": 172,
          "title": "Technical Walkthroughs",
          "description": "Previous Technical Walkthroughs",
          "url": "https://www.youtube.com/watch?v=Lt-jI8FAQcQ "
        },
        {
          "id": 173,
          "title": "PoC scaffolding",
          "description": "Here is a helpful PoC scaffolding. Even though it targets the Core, it may still be helpful",
          "url": "https://gist.github.com/kun6fup4nd4/162d491e07d0a84344abbf33bc602502"
        },
        {
          "id": 174,
          "title": "RPC",
          "description": "Running Tests",
          "url": "https://github.com/shardeum/json-rpc-server/tree/localtest#running-tests"
        },
        {
          "id": 175,
          "title": "Archiver",
          "description": "No specific doc, however an archiver is launched with the local network when following the directions here:",
          "url": "https://github.com/shardeum/shardeum?tab=readme-ov-file#running-the-network-locally"
        }
      ],
      "primacy": "primacy_of_rules",
      "newProgramRewardsEnabled": false,
      "findingsUrl": null,
      "premiumTriaging": true
    },
    "layoutProps": {
      "headerMarginBottom": "mb-12 lg:mb-16"
    },
    "metaData": {
      "title": "Audit Comp | Shardeum: Ancillaries III Bug Bounties",
      "description": "Find bugs and vulnerabilities on Audit Comp | Shardeum: Ancillaries III and get paid up to $100,000.",
      "url": "https://immunefi.com/audit-competition/audit-comp-shardeum-ancillaries-iii/",
      "ogImg": "/api/bounty/og-image/?project=Audit+Comp+%7C+Shardeum%3A+Ancillaries+III&slug=audit-comp-shardeum-ancillaries-iii"
    }
  },
  "__N_SSG": true
}
