{
  "assets": [
    {
      "id": "4ndFfaa7pRJWE1JfJ8Pgrl",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/Stargate.sol",
      "description": "Stargate.sol - Entrypoint to the protocol - 640 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "5YxGQdHxdZmnbkhYPHoqB7",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateProxy.sol",
      "description": "StargateProxy - Proxy for upgradeability - 11 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "79RXAl91s0yFTx4YFhfAWG",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/StargateNFT.sol",
      "description": "StargateNFT/StargateNFT.sol - ERC721 with extra functionality - 373 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "6Z44gaUvtZLJ4WwlXMcCJx",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/Clock.sol",
      "description": "StargateNFT/libraries/Clock.sol - Library for handling time - 22 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "57m3yIgKEsRKxixYjzoux2",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/DataTypes.sol",
      "description": "StargateNFT/libraries/DataTypes.sol - Types used across the project - 79 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "nbJgXlt2rD2i9QTrqECVN",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/Errors.sol",
      "description": "StargateNFT/libraries/Errors.sol - Errors used in StargateNFT - 37 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "4F3aWxL8GWo09FY9iLPA4S",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/Levels.sol",
      "description": "StargateNFT/libraries/Levels.sol - Library that handles NFT levels - 237 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "68RzDEDlEKVQoTCVFcu4xq",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/MintingLogic.sol",
      "description": "StargateNFT/libraries/MintingLogic.sol - Library that takes care of minting, burning and migrating NFTs - 177 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "6dG7AJmrmgtMmICtjmsRB7",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/Settings.sol",
      "description": "StargateNFT/libraries/Settings.sol - NFT settings - 13 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "3UOsp16vUV3bxB5fzuCL6n",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/Token.sol",
      "description": "StargateNFT/libraries/Token.sol - Handles token maturity and getters - 141 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    },
    {
      "id": "6YJU99bnrCqTKHdqUbEoja",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/immunefi-team/audit-comp-vechain-stargate-hayabusa/tree/main/packages/contracts/contracts/StargateNFT/libraries/TokenManager.sol",
      "description": "StargateNFT/libraries/TokenManager.sol - Library for handling Token Managers - 190 lines",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-11-10T10:00:00.000Z"
    }
  ],
  "assetsBodyV2": "**Insight Reporting** \n\nInsight reports may be reported to this program and require a PoC. Insights are rewarded in accordance with [Immunefi’s Standardized Competition Reward Terms.](https://immunefisupport.zendesk.com/hc/en-us/articles/31657285001873-Standardized-Competition-Reward-Terms)\n\n**Dispute Resolution**\n\nIf there is any dispute over bug reports between projects and security researchers, Immunefi has the final say on validity and severity based on the terms of this program.\n\n**Responsible Publication Policy**\n\n- Immunefi will publish bug reports, earnings, and a leaderboard for this Audit Competition.\n- Security Researchers may publish their bug reports as well, but only after Immunefi has published the valid bug reports as part of the competition results.\n\n**Eligibility Criteria**\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in an audit review of the code in scope (Such auditors may still participate in this program only if they receive project permission)",
  "boostedIntroEvaluating": "### Thank You to All Participating Security Researchers!\n\nThe audit competition has now concluded and is currently in the evaluation phase. During this period, all submitted reports are being carefully reviewed by the Immunefi triage team and the project team.",
  "boostedIntroFinished": "### Thank You to All Participating Security Researchers!\n\nYour valuable contributions played a crucial role in identifying and resolving critical vulnerabilities, helping to strengthen and secure the platform for all users.",
  "boostedIntroLive": "### **$40,000 USD** in rewards is available for finding bugs on VeChain's Stargate contracts. \n\nFor more information about the project, please visit https://vechain.org/.\n- KYC is required.\n\n- Flat Reward Pool\n\n**Proof of Concept (PoC) Requirements**\n\n- A **runnable PoC**, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules)\n\n- Any technical questions and support requests can be asked directly to the VeChain team or Immunefi in the [#vechain-stargate-audit-competition](https://discord.com/channels/787092485969150012/1436371776182554705) discord channel.",
  "boostedIntroStartingIn": "### **$40,000 USD** in rewards is available for finding bugs on VeChain's Stargate contracts. \n\nFor more information about the project, please visit https://vechain.org/.\n\nAny technical questions and support requests can be asked directly to the Vechain team or Immunefi in the [#vechain-stargate-audit-competition](https://discord.com/channels/787092485969150012/1436371776182554705) discord channel. \n\nWhen the Audit Competition ends, Immunefi will publish an event-specific leaderboard and bug reports from the event.\n\nA few days after the launch, Immunefi will publish VeChain's technical walkthrough on our official [YouTube channel](https://www.youtube.com/@immunefi).\n\n**A runnable PoC is required**. For more information, please read [Immunefi Proof of Concept (PoC) Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules?utm_source=immunefi)\n\nInsight reports can be submitted. Read our [Insight validity rules](https://immunefisupport.zendesk.com/hc/en-us/articles/34179768760337-Insight-Severity-Level)",
  "boostedLeaderboard": [],
  "boostedSummaryReport": null,
  "ecosystem": null,
  "endDate": "2025-11-24T10:00:00.000Z",
  "evaluationEndDate": "2025-12-26T10:00:51.000Z",
  "features": [
    "Boost",
    "Vault",
    "Managed Triage: Signal Booster"
  ],
  "hideAssetsInScope": null,
  "immunefiStandard": true,
  "inviteOnly": false,
  "kyc": true,
  "language": [
    "Solidity"
  ],
  "launchDate": "2025-11-10T10:00:00.000Z",
  "logo": "https://images.ctfassets.net/t3wqy70tc3bv/7q4VEwyYrIzlUZx9hVaL79/0ef8226fec777e8be7c4564fd615398c/vechain__1_.png",
  "maxBounty": 40000,
  "outOfScopeAndRules": "To be determined",
  "pocPerTypeAndSeverity": [
    "smart_contract - critical",
    "smart_contract - high",
    "smart_contract - medium",
    "smart_contract - low"
  ],
  "primaryPaymentWallet": "EVM",
  "prioritizedVulnerabilities": "_blank_",
  "productType": null,
  "programOverview": "StarGate is the gateway to staking in the next era of the VeChainThor blockchain, marking a major milestone in the Hayabusa upgrade under the VeChain Renaissance initiative. It’s a next-generation staking protocol designed to give VET holders an active role in securing the network and earning rewards through NFT-based staking and delegation.\n\n**Key Features**\n- NFT-Based Staking: Users stake VET to mint unique staking NFTs, which represent their locked position and can be delegated to validator nodes.\n- Earn VTHO: Delegators earn a share of block rewards (in VTHO) every time their selected validator produces a block, based on the amount and type of NFT staked.\n- Decentralized Access: Any VET holder can participate in the network by staking and delegating to validators—no need to run a full node.\n\n**Powering Hayabusa's Delegated Proof of Stake**\n\nThe Hayabusa hard fork introduces Delegated Proof of Stake (dPoS) to VeChainThor, enabling a network of 101 validators who rotate to produce blocks and secure the chain. StarGate integrates directly with this system, serving as the onboarding layer for validators and delegators alike.\nWhether you're running a validator machine or holding VET, StarGate turns every user into a contributor to network security—bringing performance, transparency, and reward opportunities to all.\n\nThe Hayabusa hard fork introduces Delegated Proof of Stake (dPoS) to VeChainThor, enabling a network of 101 validators who rotate to produce blocks and secure the chain. StarGate integrates directly with this system, serving as the onboarding layer for validators and delegators alike.\nWhether you're running a validator machine or holding VET, StarGate turns every user into a contributor to network security—bringing performance, transparency, and reward opportunities to all.\n\nFor more information about VeChain, please visit https://vechain.org/. \n\nVeChain is running an audit in parallel. However, submitted reports depicting the same issues raised in the audit will be confirmed.",
  "programType": [
    "Smart Contract"
  ],
  "project": "Audit Comp | Vechain | Stargate Hayabusa",
  "projectType": null,
  "rewardsBody": "Rewards are distributed among SRs according to [Immunefi’s Standardized Competition Reward Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/31657285001873-Standardized-Competition-Reward-Terms) and includes All Star Pool and Podium Pool reserved for [All Star Program ](https://immunefi.com/allstars/) participants. \n\nRewards are denominated in USD and distributed in USDT on Ethereum.\n\nThe reward pool is $40,000 USD if any bug is found. That means that even if 1 Low severity bug is found, the whole reward pool is unlocked and has to be fully distributed between security researchers. \n\nIf not a single bug is found (Insights do not count as bugs) the reward pool is $6,000 USD.\n\nKYC Requirement\n\nVeChain requires KYC information to pay for bug submissions. The following information will be required:\nFull name \nDate of birth\nProof of address (either a redacted bank statement with address or a recent utility bill)\nCopy of Passport or other Government issued ID\nSecurity researchers are required to submit KYC within 14 days of KYC being requested, else their rewards may be forfeited. Immunefi may make exceptions due to extenuating circumstances.",
  "rewardsPool": 40000,
  "primaryPool": 28000,
  "allStarsPool": 8000,
  "podiumPool": 4000,
  "rewardsToken": "USDT",
  "slug": "audit-comp-vechain-stargate-hayabusa",
  "tenPercentEconomicRule": false,
  "updatedDate": "2025-11-13T11:10:05.086Z",
  "impactsBody": "**VeChain is running an audit in parallel. However, submitted reports depicting the same issues raised in the audit will be confirmed.**\n\n------------------\n\n**Build Commands, Test Commands, and How to Run Them**\n\nThe repo is a monorepo. Every command is in the readme. The most relevant ones:\n- Build Contracts: yarn contracts:compile\n- Unit Tests: yarn contracts:test:unit\n- Integration Tests: yarn contracts:test:integration\n- Coverage: yarn contracts:test:unit:coverage\n- Deploy locally: yarn:contracts:deploy\n- Deploy on other networks: yarn:contracts:deploy:{network}\n- Spin a solo network locally: make solo-up\n\n**Asset Accuracy Assurance**\n\nBugs found on assets incorrectly listed in-scope are valid.\n\n**Code Freeze Assurance**\n\nCode of the assets in scope is frozen while the program is live.\n\nDuplicate submissions of bugs are valid. Duplicate submissions of Insights are invalid.\n\nThe project commits to keeping private all info related to bug findings until this program is over. This means the project will not leak info about any bug findings or planned bug fixes, including bug findings found independently by the project or from concurrent private audits.\n\n--------------------\n\n**Previous Audits**\n\nVeChain’s completed audit reports can be found at [https://docs.stargate.vechain.org/hayabusa/for-developers/contracts](https://docs.stargate.vechain.org/hayabusa/for-developers/contracts). Unfixed vulnerabilities  mentioned in these reports are not eligible for a reward.\n\n**Public Disclosure of Known Issues**\n\nBug reports for publicly disclosed bugs are not eligible for a reward. \n\n- There are some functions that can run out of gas due to excessive looping, most of them are getters so we are not really worried about them. In the cases there are not getters we implemented mechanisms to avoid running out of gas like in the claimRewards function.\n- There is a style choice in the _burnCallback and _safeMintCallback to precede the functions with an underscore even though they are external. This functions can only be called by the own StargateNFT contract and we want to discourage the usage of them from external developers.\nWe are not checking address zero when granting or revoking roles\n- The boostOnBehalfOf function uses an arbitrary _sender parameter instead of msg.sender, which deviates from standard patterns but is intentional. The Stargate contract calls this function during stakeAndDelegate flows. Since msg.sender would be the Stargate contract (no VTHO), _sender specifies which user's VTHO to use. This is protected by the onlyStargate modifier ensuring only the Stargate contract can set an arbitrary _sender\n- There can be breaks of the check-effects pattern in some functions but they are using the nonReentrant modifier\n- We can assume the IProtocolStaker interface is correct\n\n**Private Known Issues Reward Policy**\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward.\n\n-------------------------\n\n**Where might Security Researchers confuse out-of-scope code to be in-scope?**\n\nOnly Solidity is in-scope, external tools like the scripts written in Typescript are out of scope.\nAlso the project contains a `deprecated` folder with the previous versions of the contracts, those contracts can be useful to understand some of the decisions taken in the new contracts but they are out-of-scope.\nOnly the specified contracts are in-scope\n\n\n**Is this an upgrade of an existing system? If so, which? And what are the main differences?**\n\nThis is the second part of Vechain dPoS strategy.\n\nIn the first phase was a bootstrapping phase where we allowed users to stake their VET and get VTHO rewards from a pool allocated by Vechain. This was done so users are familiar with the language and the flows before the second phase.\n\nThe  3 main contracts from this bootstrapping phase are\n\n- StargateNFT\n- StargateDelegation\n- NodeManagementV3\n\nBoth NodeManagement and StargateDelegation will be deprecated and paused for this second phase.\n\nNodeManagement functionality now will live in the TokenManager.sol library. StargateDelegation was totally deprecated since it simulated the delegation and rewards that now will be handled by Stargate.sol and the thor protocol.\n\nStargateNFT is upgraded so it can interact with Stargate, this means that all the NFTs minted and migrated in the bootstrapping phase should be compatible with this new phase.\n\nAlso in this new phase the funds are moved to Stargate rather than StargateNFT, so we can have a single entrypoint to the protocol.\n\nSo as a summary\n\nBootstrapping Phase:\n\n- StargateNFT\n- NodeManagement\n- StargateDelegation\n\nSecond phase (hayabusa):\n\n- StargateNFT\n- Stargate\n\n**Where do you suspect there may be bugs and/or what attack vectors are you most concerned about?**\n\nIn the bootstrapping phase we had a bug related to rewards calculation that we had to fix and took us some time to reimburse all the affected users.\n\nSo calculating the rewards given to users is a key operation, since for example giving less rewards can be fixable giving extra rewards can cause a mismatch with what the protocol gives stargate and run the contract out of VTHO. Check that rewards calculations are correctly handled after rewards are claimed, and if rewards are not claimed.\n\nAlso minting, burning and migrating tokens since they have a fixed VET amount linked to them an unexpected mint of a token without paying the correct amount can have critical results in the protocol.\n\nOther key operations are moving the VET from StargateNFT to Stargate, and ensuring those funds are secure.\n\n**What ERC20 / ERC721 / ERC777 / ERC1155 token standards are supported?**\n\nStargateNFT contract is an extension of the ERC721 standard\n\n**What emergency actions may you want to use as a reason to downgrade an otherwise valid bug report?**\n\nPause Stargate or StargateNFT\n\n**What addresses would you consider any bug report requiring their involvement to be out of scope, as long as they operate within the privileges attributed to them?**\n\nAny requiring an address with the DEFAULT_ADMIN_ROLE or any other role, we can assume that the addresses that have this roles are secure\n\n**What addresses would you consider any bug report requiring their involvement be out of scope, even if they exceed the privileges attributed to them?**\n\nThe ProtocolStaker is a third party address that we trust for our operations of delegating, staking... we can assume the ProtocolStaker contract is not malicious and will perform as intended\n\n**Which chains and/or networks will the code in scope be deployed to?**\n\nVeChain Testnet, VeChain Mainnet\n\n**What external dependencies are there?**\n\n@openzeppelin/contracts\n@openzeppelin/contracts-upgradeable\n\n**Are there any unusual points about your protocol that may confuse Security Researchers?**\n\nThis is going to be deployed in the vechain network.\n\nThe vechain network is an EVM-like network with some extra features like multiclause. \n\nThe major difference with other EVM networks is that it does not have a traditional JSON-RPC API instead it uses an HTTPS API, this is relevant because most of the tooling developed for Ethereum is not directly compatible with vechain.\n\nWe use Hardhat with an adapter that intercepts the RPC calls and translates them to HTTPS so we can perform integration tests against the vechain network but this is not available for other frameworks like foundry.\n\nPerforming integration tests against the vechain network should be easy because we have a beforeEach hook that sets up an environment with docker and deploys the contract on each test.\n\nFor unit tests we use the hardhat chain but we mock the interaction with the protocol (setting delegations, giving rewards, adding validators...)\n\n**What are the most valuable educational resources already available? (Ie. Documentation, Explainer videos or articles, etc)**\n\n- Bootstrapping phase: https://docs.stargate.vechain.org\n- Hayabusa phase: https://docs.stargate.vechain.org/hayabusa \n- VeChain Docs: https://docs.vechain.org/",
  "websiteUrl": "https://vechain.org/",
  "githubUrl": null,
  "eligibilityCriteria": [
    "no_ofac_sdn",
    "no_official_contributor",
    "no_auditor",
    "no_employee"
  ],
  "responsiblePublicationCategory": null,
  "description": "StarGate is the gateway to staking in the next era of the VeChainThor blockchain, marking a major milestone in the Hayabusa upgrade under the VeChain Renaissance initiative. It’s a next-generation staking protocol designed to give VET holders an active role in securing the network and earning rewards through NFT-based staking and delegation.\n",
  "knownIssues": [
    {
      "id": 1202,
      "description": "There are some functions that can run out of gas due to excessive looping, most of them are getters so we are not really worried about them. In the cases there are not getters we implemented mechanisms to avoid running out of gas like in the claimRewards function.",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    },
    {
      "id": 1203,
      "description": "There is a style choice in the _burnCallback and _safeMintCallback to precede the functions with an underscore even though they are external. This functions can only be called by the own StargateNFT contract and we want to discourage the usage of them from external developers.",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    },
    {
      "id": 1204,
      "description": "We are not checking address zero when granting or revoking roles",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    },
    {
      "id": 1205,
      "description": "The boostOnBehalfOf function uses an arbitrary _sender parameter instead of msg.sender, which deviates from standard patterns but is intentional. The Stargate contract calls this function during stakeAndDelegate flows. Since msg.sender would be the Stargate contract (no VTHO), _sender specifies which user's VTHO to use. This is protected by the onlyStargate modifier ensuring only the Stargate contract can set an arbitrary _sender",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    },
    {
      "id": 1206,
      "description": "There can be breaks of the check-effects pattern in some functions but they are using the nonReentrant modifier",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    },
    {
      "id": 1207,
      "description": "We can assume the IProtocolStaker interface is correct",
      "link": "https://vechain.org/",
      "lastUpdatedAt": "2025-11-07T00:00:00.000Z",
      "relatedImpactInScope": "smart_contract"
    }
  ],
  "defaultOutOfScopeBlockchain": null,
  "defaultOutOfScopeSmartContract": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
  "defaultOutOfScopeWebAndApplications": null,
  "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
  "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
  "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
  "customOutOfScopeInformation": null,
  "customProhibitedActivities": [],
  "impacts": [
    {
      "id": 14,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results"
    },
    {
      "id": 15,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield"
    },
    {
      "id": 17,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Permanent freezing of funds"
    },
    {
      "id": 22,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Protocol insolvency"
    },
    {
      "id": 23,
      "type": "smart_contract",
      "severity": "high",
      "title": "Theft of unclaimed yield"
    },
    {
      "id": 24,
      "type": "smart_contract",
      "severity": "high",
      "title": "Theft of unclaimed royalties"
    },
    {
      "id": 25,
      "type": "smart_contract",
      "severity": "high",
      "title": "Permanent freezing of unclaimed yield"
    },
    {
      "id": 26,
      "type": "smart_contract",
      "severity": "high",
      "title": "Permanent freezing of unclaimed royalties"
    },
    {
      "id": 29,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Smart contract unable to operate due to lack of token funds"
    },
    {
      "id": 30,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Block stuffing"
    },
    {
      "id": 31,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)"
    },
    {
      "id": 32,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Theft of gas"
    },
    {
      "id": 33,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Unbounded gas consumption"
    },
    {
      "id": 34,
      "type": "smart_contract",
      "severity": "low",
      "title": "Contract fails to deliver promised returns, but doesn't lose value"
    },
    {
      "id": 5807,
      "type": "smart_contract",
      "severity": "high",
      "title": "Temporary freezing of funds for at least 24 hour"
    },
    {
      "id": 5808,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Temporary freezing of funds for at least 1 hour"
    }
  ],
  "rewards": [
    {
      "assetType": "smart_contract",
      "level": "critical",
      "payout": "Portion of the Reward Pool",
      "pocRequired": true
    },
    {
      "assetType": "smart_contract",
      "level": "high",
      "payout": "Portion of the Reward Pool",
      "pocRequired": true
    },
    {
      "assetType": "smart_contract",
      "level": "medium",
      "payout": "Portion of the Reward Pool",
      "pocRequired": true
    },
    {
      "assetType": "smart_contract",
      "level": "low",
      "payout": "Portion of the Reward Pool",
      "pocRequired": true
    }
  ]
}
