{
  "pageProps": {
    "isAttackathon": false,
    "academyContent": null,
    "ethereumAttackathonSponsors": null,
    "project": {
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "bounty": {
      "contentfulId": "23vBOe26H8f97hnYr5oc2e",
      "id": "audit-comp-shardeum-core-iii",
      "slug": "audit-comp-shardeum-core-iii",
      "project": "Audit Comp | Shardeum: Core III",
      "maxBounty": 250000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/2RGZifA5Y7aVEVItpmE3ST/08f7b34f881a614a49730ff91f64dbfc/4B19YQz__400x400.png",
      "launchDate": "2025-01-15T21:44:00.000Z",
      "endDate": "2025-02-12T17:00:00.000Z",
      "updatedDate": "2025-04-18T09:36:35.513Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "medium",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "low",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        }
      ],
      "audits": [
        {
          "id": "3swJjDq8HBLP5yUuMiCRjm",
          "url": "https://reports.immunefi.com/shardeum-core",
          "auditor": "Immunefi",
          "date": "2024-08-14"
        },
        {
          "id": "63g3xgoGhSAoM3lmgF0Npu",
          "url": "https://reports.immunefi.com/shardeum-core-ii",
          "auditor": "Immunefi",
          "date": "2024-10-16"
        },
        {
          "id": "56cuhfwh8oCbinI5HVeW3X",
          "url": "https://docs.google.com/document/d/1OlmijVY2ga_7QEe8DYU-NTEXfAqMRpuwlduIofjmEwA",
          "auditor": "The Arcadia Group",
          "date": "2024-02-23"
        },
        {
          "id": "2pxskA87kYZKNIbENrU9ew",
          "url": "https://docs.google.com/document/d/1n11d40JZYgL33-F-Lw6FMuBP9AJSXvyg-xBpJhwOkUE",
          "auditor": "HashCloak",
          "date": "2024-04-16"
        }
      ],
      "assets": [
        {
          "id": "2gFgktjEhJmN70toPQUqSI",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/shardus-core/tree/bugbounty",
          "description": "DLT - 48906",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:44:00.000Z",
          "fund": null
        },
        {
          "id": "2CLuTlhWkEC3GIERp3o7N1",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/shardeum/tree/bugbounty",
          "description": "DLT- - 22264",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:44:00.000Z",
          "fund": null
        },
        {
          "id": "3ixpQ5HAXeFlOC7cPchu7T",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/lib-crypto-utils/tree/bugbounty",
          "description": "Library–499",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:44:00.000Z",
          "fund": null
        },
        {
          "id": "sdocLpdyQfQUltXHWxjEa",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/lib-net/tree/bugbounty",
          "description": "Library–2321",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2025-01-15T21:44:00.000Z",
          "fund": null
        }
      ],
      "impacts": [
        {
          "id": 1,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Network not being able to confirm new transactions (total network shutdown)"
        },
        {
          "id": 3,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Direct loss of funds"
        },
        {
          "id": 4,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Permanent freezing of funds (fix requires hardfork)"
        },
        {
          "id": 7,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "Causing network processing nodes to process transactions from the mempool beyond set parameters"
        },
        {
          "id": 9,
          "type": "blockchain_dlt",
          "severity": "medium",
          "title": "Increasing network processing node resource consumption by at least 30% without brute force actions, compared to the preceding 24 hours"
        },
        {
          "id": 10,
          "type": "blockchain_dlt",
          "severity": "medium",
          "title": "Shutdown of greater than or equal to 30% of network processing nodes without brute force actions, but does not shut down the network"
        },
        {
          "id": 12,
          "type": "blockchain_dlt",
          "severity": "low",
          "title": "Shutdown of greater than 10% or equal to but less than 30% of network processing nodes without brute force actions, but does not shut down the network"
        },
        {
          "id": 13,
          "type": "blockchain_dlt",
          "severity": "low",
          "title": "Modification of transaction fees outside of design parameters"
        },
        {
          "id": 5281,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Bypassing Staking Requirements"
        },
        {
          "id": 5282,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Bypassing Penalties"
        },
        {
          "id": 5289,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "Blocking specific wallet addresses from making transactions"
        }
      ],
      "programOverview": "This Audit Competition is running on testnet. The following conditions apply:\n\nShardeum team will freeze the codebase during the duration of the Audit Competition\n- Duplicates are rewarded\n- Shardeum provides rewards in USDC, denominated in USD.\n\nNote: \n\nWhitehats who need to run the network locally must submit their EVM address for whitelisting to receive test tokens from the project team in the Discord channel. Alternatively, you can DM the Shardeum Team for assistance.",
      "prioritizedVulnerabilities": "Only the impacts listed in this program are accepted within this AC program.  All other impacts are not considered as in-scope, even if they affect something in the assets in scope table",
      "rewardsBody": "The following reward terms are a summary, for the full details read our [Shardeum Core III Reward Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/31793771662865-Shardeum-Core-III-Audit-Competition-Reward-Terms)\n\nThe reward pool size is determined by the greatest condition met. If multiple conditions are met only the largest reward pool applies.\n\nIf one or more Critical severity bugs are found, the reward pool will be **100% of the respective reward pool, $250,000 USD**\nIf one or more High severity bugs are found, the reward pool will be **75% of the respective reward pool, $187,500 USD**\nIf one or more Medium severity bugs are found, the reward pool will be **50% of the respective reward pool, $125,000 USD**\nOtherwise, the reward pool will be **25% of the respective reward pool, $62,500 USD**\n\nDuplicates and private known issues are valid for a reward.\n\n**Duplicates of Insight reports are not eligible for a reward.**\nRewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.3.](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/).\n\n**Reward Payment Terms**\nPayouts are handled by the Shardeum team directly and are denominated in USD. However, payments are done in USDC on Ethereum.\n\n**Insight Rewards Payment Terms**\nInsight Rewards: Portion of the Rewards Pool\nThe \"Insight\" severity was introduced on Audit Competition & Attackathon programs to recognize contributions that extend beyond identifying immediate vulnerabilities. Currently, it's not an option to select the Insight severity when submitting a report. However, our team or program will designate it accordingly if applicable. \"Insights\" underscores our commitment to valuing all types of contributions that contribute to a more secure environment and will always be rewarded. [View more information about Insights.](https://immunefisupport.zendesk.com/hc/en-us/articles/13333032674961-Severity-Classification-System?utm_source=immunefi)",
      "outOfScopeAndRules": "Bug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\nBugs from previous bounties are in scope unless explicitly said otherwise.\nReports 33428, 33655, 33963, 34508, 33576, 34053, 36024, 36025, 36025 are OOS.\n\n\nShardeum Core full list of [reports](https://app.gitbook.com/o/SXzCm0g2yGtKdYxV9Y1d/s/eYmXU5PPPCrUVU4AeKnd/shardeum-core) \nShardeum Core II full list of [reports](https://app.gitbook.com/o/SXzCm0g2yGtKdYxV9Y1d/s/eYmXU5PPPCrUVU4AeKnd/shardeum-core-ii)",
      "assetsBodyV2": "__Asset Accuracy Assurance__\n\nBugs found on assets incorrectly listed in-scope will be considered valid and be rewarded.\n\n__Private Known Issues Reward Policy__\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward equal to that of a bug one severity lower.\n\n__Known Issue Assurance__\n\nShardeum commits to providing Known Issue Assurance to bug submissions through their program. This means that Shardeum will either disclose known issues publicly, or at the very least, privately via a self-reported bug submission. \n\nIn a potential scenario of a mediation, this allows for a more objective and streamlined process, in order to prove that an issue is known. Otherwise, assuming the bug report is valid, it would result in the report being considered as in-scope, and due a reward.\n\n__Primacy of Impact vs Primacy of Rules__\n\nShardeum adheres to the Primacy of Rules for all impacts. Which means that the whole bug bounty program is run strictly under the terms and conditions stated within this page. \n\n\n\n__Eligibility Criteria__\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n__Responsible Publication__\n\nWhitehats may publish their bug reports after they have been fixed & paid, or closed as invalid, with the following exceptions:\n- Bug reports in mediation may not be published until mediation has concluded and the bug report is resolved.\n\nImmunefi may publish bug reports submitted to this audit competition and a leaderboard of the participants and their earnings.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Shardeum has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209-The-Immunefi-Standard-Badge).",
      "impactsBody": "**Which chains and/or networks will the code in scope be deployed to?**\n\nShardeum\n\n**Which parts of the code are you most concerned about?**\nWe are concerned with the web3 and business logic within all four repositories in this boost. Things like transaction queuing, penalties, and consensus. This includes any internal transactions or things involving the global account.\n\n**What attack vectors are you most concerned about?**\n\nParsing/signature errors, cheating the rotation system, and transaction processing. We received quite a few message parsing and signature related reports in the previous boosts and feel like there may still be some vulns to find. Secure accounts and multisig transactions involving them will be valuable targets and need extra scrutiny.\n**Which part(s) of the system do you want whitehats to attempt to break the most?**\ntransaction queuing, penalties, and consensus.\n**Are there any assumed invariants that you want whitehats to attempt to break?**\nSum of EOA account balances before attack == Sum of EOA account balances after attack + transaction fees. This should cover SHM disappearing from the network or being created out of thin air\n\n**What external dependencies are there?**\n\nThese are listed in package.json\n\n**Where might Security Researchers confuse out-of-scope code to be in-scope?**\n\n\nA note on Shardeum and Shardus Core scope: the default config in release mode in the branch is in scope. Whitehats are free to configure, patch, and modify their own malicious nodes however they want. However, target nodes must be running the default config in the target branch in release mode. This is to prevent the whitehats from wasting time reporting things we specifically allow in debug mode. The only exception is minNodes and maxNodes settings, which allow different size networks to be created. Certain vulnerabilities may only exist in certain network sizes, and we do not wish to limit Whitehat activity and participation for lack of computing power attempting to run a large local network. However, network-wide attacks that only work under 128 nodes may be rejected or reduced in severity at our discretion. If the researchers can enable debug mode options remotely then that is valid and can be paid out.\n\nAttacks that require the network to still be initializing/bootstrapping are out of scope. Wait until the network mode reaches “processing” + 15 cycles after startup before launching attacks. The rules for staking/join are a little different and the network will not be public during this time. Attacks on a network that is repairing itself (was once in “processing” mode but has since degraded to “safety” or “recovery”) are in scope.\nThis bounty introduces the concept of a KYC-required “genesis node”. Attacks performed with genesis nodes are in scope, attacks performed against genesis nodes are in scope. Nodes attacking themselves are out of scope.\n\n0day vulnerabilities in dependencies are in scope. Any other vuln in dependencies is out of scope. Smart contracts are out of scope\n\nFinally, the more nodes that are required to launch an attack, the more at risk the vuln is of being downgraded. If it takes 33% (for example) of the nodes in the network being malicious to cause damage, then it becomes difficult to distinguish the impact from a brute-force/51% attack, which is completely out of scope.\n\n**Are there any unusual points about your protocol that may confuse Security Researchers?**\n\nPlease consider how your vulnerability will behave on a network with a shard size of 129 nodes. We will accept reports with a PoC on a smaller network, but the severity may be affected if the impact is less feasible on network with a shard size of 129 nodes.",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "Step-by-step PoC Required"
        ],
        "productType": [
          "L1"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": [
          "Shardeum"
        ],
        "programType": [
          "Blockchain/DLT"
        ],
        "language": [
          "Typescript"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "High",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Medium",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Low",
            "payout": "Portion of the Reward Pool"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": []
      },
      "evaluationEndDate": "2025-04-17T13:20:40.592Z",
      "boostedIntroStartingIn": "A total of $250,000 USD in rewards is available for discovering bugs in Shardeum Core III. The scope includes four components: the Shardus Core Protocol, Shardeum Validator Nodes, networking libraries, and crypto-utils.\n\nFor more information about Shardeum, please visit https://shardeum.org/\n\nNo KYC is required.\n\nAny technical questions can be asked directly to the Shardeum technical team on [Immunefi’s Discord](https://discord.com/invite/immunefi) in the \"shardeum-core-iii-audit-competition\" channel.\n\nNote:\nWhitehats, to join the testnet that Shardeum will be running, please ping the project team here in the Discord channel to get your EVM address whitelisted. Alternatively, you can DM the Shardeum Team for assistance.\n\nWhen the Audit Competition has ended, Immunefi will publish an event-specific leaderboard and bug reports from the event.\nShardeum will record a technical walkthrough, which will then be shared in the Immunefi Discord.\n\nJoin our Discord for more updates.",
      "boostedIntroLive": "",
      "boostedIntroEvaluating": "",
      "boostedIntroFinished": "Audit Competition cards for security researchers with paid reports are available [here](https://drive.google.com/drive/folders/1ThQUQMcM6Khxkp7tCKzoVsavmae4cO-c)\n\nAll paid bug reports are available in original format [here](https://reports.immunefi.com/shardeum-core-iii)\n\n\n\n\n\n\n\n(https://reports.immunefi.com/shardeum-core-iiI)",
      "rewardsToken": "USDC",
      "rewardsPool": 250000,
      "primaryPool": 250000,
      "allStarsPool": 0,
      "podiumPool": 0,
      "sourceLinesOfCode": 73990,
      "boostedSummaryReport": "https://drive.google.com/file/d/1VrAHi9k1DaWxxWLpf-BapmsIMHaLA08p/",
      "inviteOnly": false,
      "hideAssetsInScope": null,
      "boostedLeaderboard": [
        {
          "high": 0,
          "name": "Blockian",
          "critical": 10,
          "earnings": 94767,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 11
        },
        {
          "high": 0,
          "name": "throwing5tone7",
          "critical": 3,
          "earnings": 34483,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 3
        },
        {
          "high": 0,
          "name": "ZhouWu",
          "critical": 4,
          "earnings": 32346,
          "insights": 3,
          "mediumLow": 0,
          "totalValidBugs": 4
        },
        {
          "high": 1,
          "name": "bountyhunter2048",
          "critical": 2,
          "earnings": 32014,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 3
        },
        {
          "high": 0,
          "name": "periniondon630",
          "critical": 2,
          "earnings": 17111,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "fomohacker",
          "critical": 1,
          "earnings": 13766,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "riproprip",
          "critical": 2,
          "earnings": 12820,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 3
        },
        {
          "high": 0,
          "name": "neploxaudit",
          "critical": 2,
          "earnings": 10297,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "gladiator111",
          "critical": 0,
          "earnings": 1147,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "Pig46940",
          "critical": 0,
          "earnings": 625,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 0
        },
        {
          "high": 0,
          "name": "XDZIBECX",
          "critical": 0,
          "earnings": 625,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 0
        }
      ],
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "academyStartDate": null,
      "websiteUrl": "https://shardeum.org/",
      "description": "Shardeum is an EVM-based, linearly scalable network offering low gas fees forever while maintaining true decentralization and (hopefully) solid security. Shardeum is a large project and as such, will be split over two concurrent boosts. This boost, called Core III, will cover the Web3 aspects of the project. This will cover four components: Shardus Core Protocol, Shardeum Validator Nodes, networking libs, and Crypto-utils. For more information about Shardeum, please visit [https://shardeum.org/](https://shardeum.org/)\n",
      "githubUrl": null,
      "feasibilityLimitations": null,
      "prohibitedActivites": null,
      "responsiblePublicationCategory": null,
      "knownIssues": [
        {
          "id": 11,
          "description": "Shardeum Core II Audit Competition",
          "link": "https://reports.immunefi.com/shardeum-core-ii",
          "lastUpdatedAt": "2024-12-17T00:00:00.000Z",
          "relatedImpactInScope": "blockchain_dlt"
        },
        {
          "id": 10,
          "description": "https://reports.immunefi.com/shardeum-core",
          "link": "https://reports.immunefi.com/shardeum-core",
          "lastUpdatedAt": "2024-12-17T00:00:00.000Z",
          "relatedImpactInScope": "blockchain_dlt"
        },
        {
          "id": 6,
          "description": "Known Issues before BB1",
          "link": "https://drive.google.com/file/d/1H6o8IPtrlTDvr_cfTRhvgr1Vvh4EYwb8/view",
          "lastUpdatedAt": "2024-12-17T00:00:00.000Z",
          "relatedImpactInScope": "blockchain_dlt"
        }
      ],
      "knownIssueAssurance": false,
      "defaultOutOfScopeBlockchain": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
      "customOutOfScopeInformation": "Bug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\nBugs from previous bounties are in scope unless explicitly said otherwise.\n\nReports 33428, 33655, 33963, 34508, 33576, 34053, 36024, 36025, 36025 are OOS.\n\n\nShardeum Core full list of [reports](https://app.gitbook.com/o/SXzCm0g2yGtKdYxV9Y1d/s/eYmXU5PPPCrUVU4AeKnd/shardeum-core) \nShardeum Core II full list of [reports](https://app.gitbook.com/o/SXzCm0g2yGtKdYxV9Y1d/s/eYmXU5PPPCrUVU4AeKnd/shardeum-core-ii)\n\n**Other Known issues**\n\n- AJV Validation error on archiver can cause missing receipts [https://github.com/shardeum/archiver/blob/bugbounty/src/Data/Collector.ts#L280](https://github.com/shardeum/archiver/blob/bugbounty/src/Data/Collector.ts#L280)\n\n- getTxTimestampBinary endpoint could be used as a memory overflow mechanism [https://github.com/shardeum/core/blob/9dae0abe5232ed532a9285da82118b41a04b3711/src/state-manager/TransactionConsensus.ts#L1796](https://github.com/shardeum/core/blob/9dae0abe5232ed532a9285da82118b41a04b3711/src/state-manager/TransactionConsensus.ts#L1796)\n\n- SQL injection in inputs at https://github.com/shardeum/shardeum/blob/dev/src/storage/sqlite3storage.ts#L257-L289\n\n- Tx data : ( ORIGINAL_TX_DATA) getting saved in originalTxData, processedData and transaction table without any verification [https://github.com/shardeum/archiver/blob/cbe1d515e91058d17fa483f84361992cd3d1cf9c/src/archivedCycle/StateMetaData.ts#L156](https://github.com/shardeum/archiver/blob/cbe1d515e91058d17fa483f84361992cd3d1cf9c/src/archivedCycle/StateMetaData.ts#L156)",
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Ethereum",
      "eligibilityCriteria": [],
      "eligibilityCriteriaAdditionalInformation": null,
      "programCodebases": [],
      "programDocumentations": [
        {
          "id": 176,
          "title": "Shardeum's codebase",
          "description": "Shardeum’s up to date codebase can be found at",
          "url": "https://github.com/shardeum/?utm_source=immunefi"
        },
        {
          "id": 177,
          "title": "Shardeum’s youtube page",
          "description": "Shardeum’s youtube page can be found at",
          "url": "https://www.youtube.com/@Shardeum"
        },
        {
          "id": 178,
          "title": "Tech walkthroughs",
          "description": "Previous tech walkthroughs",
          "url": "https://www.youtube.com/watch?v=U2ZHqQchBgA, https://www.youtube.com/watch?v=Lt-jI8FAQcQ"
        },
        {
          "id": 179,
          "title": "Whitepaper",
          "description": "Whitepaper can be found at",
          "url": " https://docs.shardeum.org/docs/whitepaper"
        },
        {
          "id": 180,
          "title": "Documentation",
          "description": "Shardeum's up to date documentation",
          "url": "https://docs.shardeum.org/"
        },
        {
          "id": 181,
          "title": "Script",
          "description": "Script to clean up code to make review easier:",
          "url": "https://github.com/shardeum/sec_im_cleanup "
        }
      ],
      "primacy": "primacy_of_rules",
      "newProgramRewardsEnabled": false,
      "findingsUrl": "https://reports.immunefi.com/shardeum-core-iii",
      "premiumTriaging": true
    },
    "layoutProps": {
      "headerMarginBottom": "mb-12 lg:mb-16"
    },
    "metaData": {
      "title": "Audit Comp | Shardeum: Core III Bug Bounties",
      "description": "Find bugs and vulnerabilities on Audit Comp | Shardeum: Core III and get paid up to $250,000.",
      "url": "https://immunefi.com/audit-competition/audit-comp-shardeum-core-iii/",
      "ogImg": "/api/bounty/og-image/?project=Audit+Comp+%7C+Shardeum%3A+Core+III&slug=audit-comp-shardeum-core-iii"
    }
  },
  "__N_SSG": true
}
