{
  "assets": [
    {
      "id": "18liAnHwE6kAUPXBNjvUqI",
      "revision": 4,
      "type": "websites_and_applications",
      "url": "https://bridge.availproject.org",
      "description": "Bridge UI",
      "isPrimacyOfImpact": null,
      "addedAt": "2024-07-23T02:00:00.000Z"
    },
    {
      "id": "1ZTboJSRu0wkWmVirAJIRM",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/availproject/ca-sc",
      "description": "Avail Nexus Vault Smart Contracts",
      "isPrimacyOfImpact": null,
      "addedAt": "2025-12-01T08:06:57.979Z"
    },
    {
      "id": "2H8B6VRAaNU6KqQ8JMd7JZ",
      "revision": 2,
      "type": "smart_contract",
      "url": "https://github.com/availproject/contracts",
      "description": "Avail Bridge Smart Contracts",
      "isPrimacyOfImpact": null,
      "addedAt": "2024-07-23T02:00:00.000Z"
    },
    {
      "id": "41lsglKkylNLYDjhj3uPRG",
      "revision": 2,
      "type": "blockchain_dlt",
      "url": "https://github.com/availproject/avail-core",
      "description": "Avail Core",
      "isPrimacyOfImpact": null,
      "addedAt": "2024-07-23T02:00:00.000Z"
    },
    {
      "id": "7KtVhVPOH6Q31YMlnZccOp",
      "revision": 2,
      "type": "blockchain_dlt",
      "url": "https://github.com/availproject/avail",
      "description": null,
      "isPrimacyOfImpact": null,
      "addedAt": "2025-12-01T08:24:47.660Z"
    }
  ],
  "assetsBodyV2": "For Avail Nexus Vault Smart Contracts, only the Vaults.sol contract is part of the scope.",
  "boostedIntroEvaluating": "",
  "boostedIntroFinished": "",
  "boostedIntroLive": "",
  "boostedIntroStartingIn": "",
  "boostedLeaderboard": [],
  "boostedSummaryReport": null,
  "ecosystem": [
    "ETH"
  ],
  "endDate": null,
  "evaluationEndDate": null,
  "features": [
    "Managed Triage: Time Saver",
    "Subscription Plan: Essential"
  ],
  "hideAssetsInScope": null,
  "immunefiStandard": true,
  "inviteOnly": false,
  "kyc": true,
  "language": [
    "Solidity"
  ],
  "launchDate": "2024-07-23T02:00:00.000Z",
  "logo": "https://images.ctfassets.net/t3wqy70tc3bv/37wGk8Qz27HTCY0URGtIzR/3c3171085fec2e44832cc45a25326d09/avail.png",
  "maxBounty": 250000,
  "outOfScopeAndRules": ".",
  "pocPerTypeAndSeverity": [
    "blockchain_dlt - critical",
    "blockchain_dlt - high",
    "blockchain_dlt - medium",
    "blockchain_dlt - low",
    "smart_contract - critical",
    "smart_contract - high",
    "smart_contract - medium",
    "websites_and_applications - critical",
    "websites_and_applications - high",
    "websites_and_applications - medium",
    "websites_and_applications - low"
  ],
  "primaryPaymentWallet": "EVM",
  "prioritizedVulnerabilities": "Avail’s codebase can be found at [https://github.com/availproject](https://github.com/availproject). \n\nDocumentation and further resources can be found on [https://docs.availproject.org/docs/introduction-to-avail](https://docs.availproject.org/docs/introduction-to-avail).",
  "productType": [
    "L2"
  ],
  "programOverview": "Avail is designed to be a platform that connects different ecosystems by providing a modular, scalable, and interoperable platform.\nAvail's vision is to provide a cohesive, unified user experience within a flexible and modular blockchain ecosystem, drawing on lessons from Web2 to innovate in Web3. Avail is not just building a product; we are pioneering a new category in the blockchain space, paving the way for an era of enhanced scalability and seamless integration.\n\n\nAvail aims to provide a cohesive platform that bridges the gaps between various blockchain ecosystems.\nBy implementing the right primitives and standards, Avail seeks to ensure interoperability and cooperation among diverse blockchain networks. This approach not only enhances the user experience but also fosters a more integrated and efficient blockchain ecosystem.\nWith Avail's foundational DA layer, different ecosystems can innovate on top freely, while leveraging Nexus for cross-ecosystem messaging.\nFor more information about Avail, please visit https://www.availproject.org/\n\nAvail provides rewards in USDC on Ethereum, denominated in USD. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__KYC Requirement__ \n\nAvail will be requesting KYC information in order to pay for successful bug submissions. The following information will be required:\n- Full name \n- Date of birth\n- Proof of address (either a redacted bank statement with address or a recent utility bill)\n- Copy of Passport or other Government issued ID\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules).\n\n__Previous Audits__\n\nAvail’s completed audit reports can be found at [https://github.com/availproject/audits](https://github.com/availproject/audits). Any unfixed vulnerabilities  mentioned in these reports are not eligible for a reward.\n\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Avail has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209).",
  "programType": [
    "Blockchain/DLT",
    "Smart Contract",
    "Websites and Applications"
  ],
  "project": "Avail",
  "projectType": [
    "Infrastructure"
  ],
  "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/). \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Blockchain/DLT bugs, the reward amount is 10% of the funds directly affected, capped at the maximum critical reward USD 250,000. However, a minimum reward of USD 25,000 is to be rewarded in order to incentivize security researchers against withholding on a bug report. Note that critical Blockchain/DLT bugs need to be able to exploit the runtime layer of the blockchain, as the critical chain logic is strictly part of the runtime.\n\nFor critical Blockchain/DLT bugs with a non-funds-at risk impact, the reward will be paid out as follows: \n\n- Network not being able to confirm new transactions (total network shutdown) - USD 30,000\n- Unintended permanent chain split requiring hard fork (network partition requiring hard fork) - USD 30,000\n- Permanent freezing of funds (fix requires hardfork) - USD 30,000\n\nFor high Blockchain/DLT non-funds-at risk impacts, the reward will be paid out as follows: \n\n- Unintended chain split (network partition) - USD 20,000\n- Temporary freezing of network transactions by delaying one block by 500% or more of the average block time of the preceding 24 hours beyond standard difficulty adjustments - USD 20,000\n- Causing network processing nodes to process transactions from the mempool beyond set parameters - USD 20,000\n- RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer - USD 20,000\n\nFor critical smart contract bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 250,000. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of USD 25,000 is to be rewarded in order to incentivize security researchers against withholding a critical bug report.\n\n__Repeatable Attack Limitations__\n\nIf the smart contract where the vulnerability exists can be upgraded or paused, only the initial attack will be considered for a reward. This is because the project can mitigate the risk of further exploitation by upgrading or pausing the component where the vulnerability exists. The reward amount will depend on the severity of the impact and the funds at risk. \n\nFor critical repeatable attacks on smart contracts that cannot be upgraded or paused, the project will consider the cumulative impact of the repeatable attacks for a reward. This is because the project cannot prevent the attacker from repeatedly exploiting the vulnerability until all funds are drained and/or other irreversible damage is done. Therefore, this warrants a reward equivalent to 10% of funds at risk, capped at the maximum critical reward. \n\n__Reward Calculation for High Level Reports__\n\nHigh vulnerabilities concerning theft/permanent freezing of unclaimed yield/royalties are rewarded within a range of USD 5,000 to USD 20,000 depending on the funds at risk, capped at the maximum high reward.  \n\nIn the event of temporary freezing, the reward doubles from the full frozen value for every additional [24h] that the funds are temporarily frozen, up until a max cap of the high reward. This is because as the duration of the freezing lengthens, the potential for greater damage and subsequent reputational harm intensifies. Thus, by increasing the reward proportionally with the frozen duration, the project ensures stronger incentives for bug disclosure of this nature.\n\nFor critical web/apps bug reports will be rewarded with USD 20,000, only if the impact leads to:\nA loss of funds involving an attack that does not require any user action\nPrivate key or private key generation leakage leading to unauthorized access to user funds \n\nAll other impacts that would be classified as Critical would be rewarded a flat amount of USD 6,000. The rest of the severity levels are paid out according to the Impact in Scope table.  \n\n__Reward Payment Terms__\n\nPayouts are handled by the Avail team directly and are denominated in USD. However, payments are done in USDC on Ethereum.\n\nThe calculation of the net amount rewarded is based on the average price between CoinMarketCap.com and CoinGecko.com at the time the bug report was submitted. No adjustments are made based on liquidity availability.",
  "rewardsPool": 0,
  "primaryPool": 0,
  "allStarsPool": 0,
  "podiumPool": 0,
  "rewardsToken": "USDC",
  "slug": "avail",
  "tenPercentEconomicRule": false,
  "updatedDate": "2025-12-02T23:09:36.781Z",
  "impactsBody": null,
  "websiteUrl": "https://www.availproject.org/",
  "githubUrl": "https://github.com/availproject",
  "eligibilityCriteria": [
    "no_ofac_sdn",
    "no_official_contributor",
    "no_employee",
    "no_auditor"
  ],
  "responsiblePublicationCategory": "category_3",
  "description": "Avail is designed to be a platform that connects different ecosystems by providing a modular, scalable, and interoperable platform. Avail Nexus powers the new onchain world, beyond the boundaries of siloed blockchain networks. \nAvail's vision is to provide a cohesive, unified user experience within a flexible and modular blockchain ecosystem, drawing on lessons from Web2 to innovate in Web3. Avail is not just building a product; we are pioneering a new category in the blockchain space, paving the way for an era of enhanced scalability and seamless integration.",
  "knownIssues": [],
  "defaultOutOfScopeBlockchain": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
  "defaultOutOfScopeSmartContract": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
  "defaultOutOfScopeWebAndApplications": "- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n- SPF/DMARC misconfigured records)\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering",
  "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
  "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
  "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
  "customOutOfScopeInformation": null,
  "customProhibitedActivities": [],
  "impacts": [
    {
      "id": 5,
      "type": "blockchain_dlt",
      "severity": "high",
      "title": "Unintended chain split (network partition)"
    },
    {
      "id": 6,
      "type": "blockchain_dlt",
      "severity": "high",
      "title": "Temporary freezing of network transactions by delaying one block by 500% or more of the average block time of the preceding 24 hours beyond standard difficulty adjustments"
    },
    {
      "id": 7,
      "type": "blockchain_dlt",
      "severity": "high",
      "title": "Causing network processing nodes to process transactions from the mempool beyond set parameters"
    },
    {
      "id": 9,
      "type": "blockchain_dlt",
      "severity": "medium",
      "title": "Increasing network processing node resource consumption by at least 30% without brute force actions, compared to the preceding 24 hours"
    },
    {
      "id": 10,
      "type": "blockchain_dlt",
      "severity": "medium",
      "title": "Shutdown of greater than or equal to 30% of network processing nodes without brute force actions, but does not shut down the network"
    },
    {
      "id": 11,
      "type": "blockchain_dlt",
      "severity": "medium",
      "title": "A bug in the respective layer 0/1/2 network code that results in unintended smart contract behavior with no concrete funds at direct risk"
    },
    {
      "id": 12,
      "type": "blockchain_dlt",
      "severity": "low",
      "title": "Shutdown of greater than 10% or equal to but less than 30% of network processing nodes without brute force actions, but does not shut down the network"
    },
    {
      "id": 13,
      "type": "blockchain_dlt",
      "severity": "low",
      "title": "Modification of transaction fees outside of design parameters"
    },
    {
      "id": 14,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results"
    },
    {
      "id": 17,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Permanent freezing of funds"
    },
    {
      "id": 22,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Protocol insolvency"
    },
    {
      "id": 27,
      "type": "smart_contract",
      "severity": "high",
      "title": "Temporary freezing of funds"
    },
    {
      "id": 31,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)"
    },
    {
      "id": 33,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Unbounded gas consumption"
    },
    {
      "id": 35,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Execute arbitrary system commands"
    },
    {
      "id": 37,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Taking down the application/website"
    },
    {
      "id": 41,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Subdomain takeover with already-connected wallet interaction"
    },
    {
      "id": 42,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Direct theft of user funds"
    },
    {
      "id": 45,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Injection of malicious HTML or XSS through metadata"
    },
    {
      "id": 49,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Subdomain takeover without already-connected wallet interaction"
    },
    {
      "id": 52,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Redirecting users to malicious websites (open redirect)"
    },
    {
      "id": 4991,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Temporarily disabling user to access target site, such as:  Locking up the victim from login Cookie bombing, etc."
    },
    {
      "id": 4992,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Taking over broken or expired outgoing links, such as:  Social media handles, etc."
    },
    {
      "id": 4993,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Changing details of other users (including modifying browser local storage) without already-connected wallet interaction & with significant user interaction, such as: Iframing leading to modifying the backend/browser state(must demonstrate impact with POC)"
    },
    {
      "id": 4995,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Improperly disclosing confidential user information, such as:  Email address, Phone number, Physical address, etc."
    },
    {
      "id": 4996,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as:  Email, Password of the victim etc."
    },
    {
      "id": 4997,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Injecting/modifying the static content on the target application without JavaScript (persistent), such as:  HTML injection without JavaScript, Replacing existing text with arbitrary text, Arbitrary file uploads, etc"
    },
    {
      "id": 4998,
      "type": "blockchain_dlt",
      "severity": "high",
      "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer"
    },
    {
      "id": 5001,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Injecting/modifying the static content on the target application without JavaScript (reflected), such as:  Reflected HTML injection, Loading external site data"
    },
    {
      "id": 5002,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Changing non-sensitive details of other users(including modifying browser local storage)without already-connected wallet interaction & with up to one click of user interaction, such as: Changing the first/last name of user, Enabling/disabling notifications"
    },
    {
      "id": 5005,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Malicious interactions with an already-connected wallet, such as:  Modifying transaction arguments or parameters Substituting contract addresses Submitting malicious transactions"
    },
    {
      "id": 5006,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as:   Changing registration information, Commenting, Voting, Making trades, Withdrawals, etc."
    },
    {
      "id": 5007,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Retrieve sensitive data/files from a running server, such as:   /etc/shadow, database passwords, blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)"
    },
    {
      "id": 5008,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Direct theft of any user funds, whether at-rest or in-motion"
    },
    {
      "id": 5296,
      "type": "blockchain_dlt",
      "severity": "critical",
      "title": "WASM runtime exploits leading to direct loss of funds"
    },
    {
      "id": 5297,
      "type": "blockchain_dlt",
      "severity": "critical",
      "title": "WASM runtime exploits leading to permanent freezing of funds (fix requires hardfork)"
    }
  ],
  "rewards": [
    {
      "id": 39205,
      "assetType": "smart_contract",
      "severity": "critical",
      "rewardModel": "range",
      "maxReward": 250000,
      "minReward": 25000,
      "rewardCalculationPercentage": 10
    },
    {
      "id": 39201,
      "assetType": "blockchain_dlt",
      "severity": "critical",
      "rewardModel": "range",
      "maxReward": 250000,
      "minReward": 25000,
      "rewardCalculationPercentage": 10
    },
    {
      "id": 39208,
      "assetType": "websites_and_applications",
      "severity": "critical",
      "rewardModel": "range",
      "maxReward": 20000,
      "minReward": 6000
    },
    {
      "id": 39206,
      "assetType": "smart_contract",
      "severity": "high",
      "rewardModel": "range",
      "maxReward": 40000,
      "minReward": 5000
    },
    {
      "id": 39202,
      "assetType": "blockchain_dlt",
      "severity": "high",
      "rewardModel": "range",
      "maxReward": 40000,
      "minReward": 20000
    },
    {
      "id": 39209,
      "assetType": "websites_and_applications",
      "severity": "high",
      "rewardModel": "fixed",
      "fixedReward": 5000
    },
    {
      "id": 39207,
      "assetType": "smart_contract",
      "severity": "medium",
      "rewardModel": "fixed",
      "fixedReward": 4000
    },
    {
      "id": 39203,
      "assetType": "blockchain_dlt",
      "severity": "medium",
      "rewardModel": "fixed",
      "fixedReward": 5000
    },
    {
      "id": 39210,
      "assetType": "websites_and_applications",
      "severity": "medium",
      "rewardModel": "fixed",
      "fixedReward": 2500
    },
    {
      "id": 39204,
      "assetType": "blockchain_dlt",
      "severity": "low",
      "rewardModel": "fixed",
      "fixedReward": 1000
    },
    {
      "id": 39211,
      "assetType": "websites_and_applications",
      "severity": "low",
      "rewardModel": "fixed",
      "fixedReward": 1000
    }
  ]
}
