{
  "assets": [
    {
      "id": "1b0RqlxSmzajKDfSXpp5Bk",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-c-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:06:25.718Z",
      "revision": 2,
      "description": "dlmm-pool-c-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "36Z6Bp60qppHT4kyUyAiy5",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-swap-router-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:04:08.891Z",
      "revision": 2,
      "description": "dlmm-swap-router-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "3qOmBxFJeHHHlAIRRyGSMe",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-h-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:07:15.930Z",
      "revision": 2,
      "description": "dlmm-pool-h-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "4cxcJZzAiUpQdH0DOX4Ex7",
      "url": "https://explorer.hiro.so/txid/SM1793C4R5PZ4NS4VQ4WMP7SKKYVH8JZEWSZ9HCCR.token-stx-v-1-2?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:07:28.905Z",
      "revision": 2,
      "description": "token-stx-v-1-2",
      "isPrimacyOfImpact": null
    },
    {
      "id": "5XJ3M6ggPAFXJarQjtFq4V",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-d-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:06:46.024Z",
      "revision": 2,
      "description": "dlmm-pool-d-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "5jFioauR92OFCIWEnsfRjH",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-core-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T18:51:59.491Z",
      "revision": 2,
      "description": "dlmm-core-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "64dQuPCxJ3DkjvYY848Nba",
      "url": "https://hodlmm.bitflow.finance/",
      "type": "websites_and_applications",
      "addedAt": "2025-11-26T04:27:00.000Z",
      "revision": 3,
      "description": "App",
      "isPrimacyOfImpact": null
    },
    {
      "id": "6HRjrhKCx1FiuIZDraYsav",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-g-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:06:59.316Z",
      "revision": 2,
      "description": "dlmm-pool-g-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "B4HmB2UqxIdiAWWf23Wg2",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-b-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:05:56.681Z",
      "revision": 2,
      "description": "dlmm-pool-b-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "XZDaemW2QQ0cCkOF1Wpai",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-pool-trait-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:05:40.932Z",
      "revision": 2,
      "description": "dlmm-pool-trait-v-0-1",
      "isPrimacyOfImpact": null
    },
    {
      "id": "srMsB8Pvy6mT6v2BA7KdA",
      "url": "https://explorer.hiro.so/txid/SP3ESW1QCNQPVXJDGQWT7E45RDCH38QBK9HEJSX4X.dlmm-liquidity-router-v-0-1?chain=mainnet",
      "type": "smart_contract",
      "addedAt": "2025-11-26T19:05:26.373Z",
      "revision": 2,
      "description": "dlmm-liquidity-router-v-0-1",
      "isPrimacyOfImpact": null
    }
  ],
  "assetsBodyV2": "Bitflow’s latest contract codebase and test-suite for the “HODLMM” can be found here: https://github.com/BitflowFinance/bitflow-dlmm. \nWhitelisted early access to HODLMM with mock tokens: [https://hodlmm.bitflow.finance](https://hodlmm.bitflow.finance)\n\n**Note:** You’ll need to be whitelisted to access the dapp ahead of public release. Use this link to get access: [https://waitlist.bitflow.finance](https://waitlist.bitflow.finance) \n\nFor any issues with expedited access, try to DM [@bitflow](https://x.com/bitflow) or [@StacksDeveloper](https://x.com/dylan_) on X.",
  "boostedIntroEvaluating": "",
  "boostedIntroFinished": "",
  "boostedIntroLive": "",
  "boostedIntroStartingIn": "",
  "boostedLeaderboard": [],
  "boostedSummaryReport": null,
  "ecosystem": [
    "Stacks"
  ],
  "endDate": null,
  "evaluationEndDate": null,
  "features": [
    "Arbitration",
    "Subscription Plan: Essential"
  ],
  "hideAssetsInScope": null,
  "immunefiStandard": true,
  "inviteOnly": false,
  "kyc": false,
  "language": [
    "Clarity",
    "NextJS"
  ],
  "launchDate": "2025-11-26T04:27:00.000Z",
  "logo": "https://images.ctfassets.net/t3wqy70tc3bv/1wBdOtq6xoBJTdPjGbJmiq/8165a74640386a368784458f72749f7f/tq71coRV_400x400.png",
  "maxBounty": 100000,
  "pocPerTypeAndSeverity": [
    "smart_contract - critical",
    "smart_contract - high",
    "smart_contract - medium",
    "smart_contract - low",
    "websites_and_applications - critical"
  ],
  "primaryPaymentWallet": "Stacks",
  "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
  "productType": [
    "DEX",
    "Liquid Staking"
  ],
  "programOverview": "Bitflow, a decentralized exchange (DEX) built on the Stacks blockchain, positioning itself as a key liquidity hub for Bitcoin DeFi users (traders, liquidity providers, and developers). Bitflow has a history of recreating battle tested DEX smart contracts in the Clarity smart contract language, as well as innovating with new designs such as the variable midpoint stableswap. In the past, Bitflow has delivered Curve style pools, Uniswap V2 style pools, and Jupiter style aggregator contracts for multi-dex swaps. \n\nThis BBP (bug bounty program) however will initially focus exclusively on a new orderbook style AMM that unlocks concentrated liquidity in the Stacks ecosystem. Bitflow calls this the HODLMM – High-throughput, Orderbook-style, Decentralized Liquidity Market Maker. Concentrated liquidity is much more efficient for traders and liquidity providers compared to legacy AMMs like the Uniswap V2 design, and this implementation draws inspiration from Trader Joe’s Liquidity Book AMM and Meteora’s DLMM designs. Over time, the scope may expand to include contracts for legacy AMMs and more peripheral contracts built on HODLMM\n\nFor more information about Bitflow, please visit [https://www.bitflow.finance/](https://www.bitflow.finance/)\n\nBitflow provides rewards in **STX** on Stacks, denominated in **USD**. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n\n__Primacy of Impact vs Primacy of Rules__\n\nBitflow adheres to the Primacy of Impact for the following impacts:\n\n- Smart Contract - Critical\n- Smart Contract - High\n- Web/App - Critical\n\nPrimacy of Impact means that the impact is prioritized rather than a specific asset. This encourages security researchers to report on all bugs with an in-scope impact, even if the affected assets are not in scope. For more information, please see [Best Practices: Primacy of Impact ](https://immunefisupport.zendesk.com/hc/en-us/articles/12340245635089-Best-Practices-Primacy-of-Impact)\n\nWhen submitting a report on Immunefi’s dashboard, the security researcher should select the Primacy of Impact asset placeholder. If the team behind this project has multiple programs, those other programs are not covered under Primacy of Impact for this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nIf the project has any testnet and/or mock files, those will not be covered under Primacy of Impact.\n\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms and conditions set within this program.\n\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the[ Immunefi PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules)\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\n **Bitflow HODLMM Known Issues (Most here were acknowledged during Completed Audits)**\n- Pool Operations Lack Deadline Checks \n  - Deadlines allow users to specify the time by which the operation must be executed otherwise it would be invalid.\n\n- Pool verification status set during pool creation, and allows unverified pools to exist\n  - Even though they can’t be verified, in theory malicious pools contracts can still be deployed and swapped through via core. This is intentional to ensure that permissionless pool creation is possible when public pool creation is enabled. Note that liquidity remains isolated in each pool contract.\n\n- Verified pools can still contain malicious tokens\n  - Malicious tokens can therefore be swapped through core or peripheral routers\n  - At scale, there is no way to check on-chain for whether or not a token is malicious during pool creation (unlike template pool contracts that can be compared to a hash of the code body). \n  - Peripheral router contracts could be built on top to maintain a list of verified tokens (separate from core) to add more protection to user’s swaps and liquidity provision. \n \n - Avoid using ‘tx-sender’ for Caller Authorization\n  - Throughout the codebase there are instances where `tx-sender` is used instead of `contract-caller` or passing the caller address. By doing this, users that fall to phishing scams and interact with malicious contracts can unwittingly interact with the codebase and execute sensitive operations. By using contract-caller, we lose composability for more peripheral contracts to be built on top; tx-sender allows for that which means that phishing is possible. Users looking out for post conditions will also help mitigate risk of phishing attacks.\n\n- Variable Fee Design Choices\n  - The current variable fee is intended to serve as a volatility fee, where many bin changes in recent blocks will result in increased variable fee, which can also be reset or reduced.\n  - The pool uses specific data points to calculate the fee. Admins can calculate off-chain the fee and set the fees via a set-variable-fees call, with the intent that in the future, a peripheral contract will update these via asynchronous calls. \n  - With this design, multi-bin swaps can often precede a fee adjustment\n  - Lower fee swaps can be frontrun if users see a fee-increase transaction in the mempool.\n  - Users may be charged more than needed if the transactions to reset or lower the variable fees do not get confirmed before more swaps get confirmed\n  - Users could be charged too high of a variable fee by a malicious admin that also deploys liquidity into a bin\n\n- Absence of Preview Functions for Key Operations\n  - Current implementation does not offer any mechanism of previewing operation results. \n  - Intention is to create a peripheral contract with preview functions, one for each major operation in the core contract: swap-x-for-y, swap-y-for-x, add-liquidity, withdraw-liquidity, and move-liquidity\n\n- Remove Redundant begin Blocks\n  - Throughout the codebase, after let declarations, the implementation redundantly adds a begin block instead of just writing the next statements as it is normally allowed by the let block. This is done, redundantly in almost all contracts, all instances of begin code blocks can be removed.\n\n- Bin steps can be added with wrong values and they cannot be updated/removed\n  - With the ability to migrate to new core contracts, admins can upgrade with the corrected bin factors.\n\n- Multi-bin swaps using favorable bins can actually lead to worse outcomes\n  - A user can actually do worse when favorable bins are available because the capacity of those bins is not as high as they expected. The result is unexpected funds loss for the user. However, the user can prevent this by setting min-received correctly for each swap step.  The unfavorable bin logic only compares the active bin ID to the expected bin ID, not bin balances or other factors. Bitflow calculates min-received per swap off-chain and enforces it on-chain. Thus, this was assessed by auditors as informational.\n\n- Malicious core contract upgradability if an admin is compromised\n  - A malicious admin could attempt to upgrade pools to use a new core contract \n  - if original deployer or admin hasn’t frozen migration and hasn’t noticed within the cooldown period of at least 1 week.\n  - In a previous design, Bitflow had no way to upgrade the core contract. The likelihood of needing to roll out a new version is eventually high.\n\n- Implement Timelocks for Sensitive Configuration Changes\n  - Admins can modify some configuration parameters at any time and changes take place immediately. This creates risk for existing users (including but not limited to: higher fees, disabling of swaps, etc)\n\n\n__Previous Audits__\n\nBitflow’s completed audit reports can be found at https://docs.Bitflow.finance/Bitflow-documentation/resources/audits. Any unfixed vulnerabilities mentioned in these reports are not eligible for a reward.",
  "programType": [
    "Smart Contract",
    "Websites and Applications"
  ],
  "project": "Bitflow",
  "projectType": [
    "Exchange",
    "Defi"
  ],
  "rewardsBody": "__Reward Calculation for Critical Level Reports__\n\nFor critical smart contract bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 100 000. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of USD 20 000 is to be rewarded in order to incentivize security researchers against withholding a critical bug report.\n\n\n__Repeatable Attack Limitations__\n\nIf the smart contract where the vulnerability exists can be upgraded or paused, only the initial attack will be considered for a reward. \n\nThe amount of funds at risk will be calculated with the impact of the first attack being at 100% and then a reduction of 25% from the amount of the first attack for every [720 blocks] the attack needs for subsequent attacks from the first attack, rounded down.\n\n__Reward Calculation for High Level Reports__\n\nHigh impacts concerning theft/permanent freezing of unclaimed yield/royalties are rewarded within a range of USD 2 500 to USD 20 000 with the reward calculated based on 100% of the funds at risk, though capped at the maximum high.\n\nIn the event of temporary freezing, the reward doubles from the full frozen value for every additional [24h] that the funds are temporarily frozen, up until a max cap of the high reward. \n\nFor critical web/apps bug reports will be rewarded with USD 25 000, only if the impact leads to:\n\n- A loss of funds involving an attack that does not require any user action\n- Private key or private key generation leakage leading to unauthorized access to user funds \n\nAll other impacts that would be classified as Critical would be rewarded a flat amount of USD 5 000. The rest of the severity levels are paid out according to the Impact in Scope table.  \n\nThe SIP10 implementation of STX we deployed for use across legacy DEXs and soon with the HODLMM (SM1793C4R5PZ4NS4VQ4WMP7SKKYVH8JZEWSZ9HCCR.token-stx-v-1-2) is within scope, and all other fungible tokens are not in scope. Other contracts deployed by SM1793C4R5PZ4NS4VQ4WMP7SKKYVH8JZEWSZ9HCCR or SPQC38PW542EQJ5M11CR25P7BS1CA6QT4TBXGB3M are not in scope.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Bitflow team directly and are denominated in USD. However, payments are done in USDC on Ethereum.\n\nThe calculation of the net amount rewarded is based on the average price between CoinMarketCap.com and CoinGecko.com at the time the bug report was submitted. No adjustments are made based on liquidity availability.",
  "rewardsPool": 0,
  "primaryPool": 0,
  "allStarsPool": 0,
  "podiumPool": 0,
  "rewardsToken": "USDC",
  "slug": "bitflow",
  "updatedDate": "2025-12-08T07:57:57.211Z",
  "impactsBody": null,
  "websiteUrl": null,
  "githubUrl": null,
  "eligibilityCriteria": [],
  "responsiblePublicationCategory": "category_3",
  "description": "Bitflow, a decentralized exchange (DEX) built on the Stacks blockchain, positioning itself as a key liquidity hub for Bitcoin DeFi users (traders, liquidity providers, and developers).",
  "knownIssues": [],
  "defaultOutOfScopeBlockchain": null,
  "defaultOutOfScopeSmartContract": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
  "defaultOutOfScopeWebAndApplications": "- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n- SPF/DMARC misconfigured records)\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering",
  "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
  "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
  "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
  "customOutOfScopeInformation": "- Tokens not deployed from SPQC38PW542EQJ5M11CR25P7BS1CA6QT4TBXGB3M\n- Impacts relying on theoretical user interactions without any demonstration of regular or significant occurrence",
  "customProhibitedActivities": [],
  "impacts": [
    {
      "id": 34,
      "type": "smart_contract",
      "severity": "low",
      "title": "Contract fails to deliver promised returns, but doesn't lose value"
    },
    {
      "id": 4823,
      "type": "smart_contract",
      "severity": "high",
      "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results"
    },
    {
      "id": 23,
      "type": "smart_contract",
      "severity": "high",
      "title": "Theft of unclaimed yield"
    },
    {
      "id": 25,
      "type": "smart_contract",
      "severity": "high",
      "title": "Permanent freezing of unclaimed yield"
    },
    {
      "id": 27,
      "type": "smart_contract",
      "severity": "high",
      "title": "Temporary freezing of funds"
    },
    {
      "id": 29,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Smart contract unable to operate due to lack of token funds"
    },
    {
      "id": 30,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Block stuffing"
    },
    {
      "id": 31,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)"
    },
    {
      "id": 32,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Theft of gas"
    },
    {
      "id": 33,
      "type": "smart_contract",
      "severity": "medium",
      "title": "Unbounded gas consumption"
    },
    {
      "id": 15,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield"
    },
    {
      "id": 17,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Permanent freezing of funds"
    },
    {
      "id": 22,
      "type": "smart_contract",
      "severity": "critical",
      "title": "Protocol insolvency"
    },
    {
      "id": 4824,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Retrieve sensitive data/files from a running server, such as:   /etc/shadow, database passwords, blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)"
    },
    {
      "id": 4825,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as:   Changing registration information, Commenting, Voting, Making trades, Withdrawals, etc."
    },
    {
      "id": 42,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Direct theft of user funds"
    },
    {
      "id": 4826,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Malicious interactions with an already-connected wallet, such as:  Modifying transaction arguments or parameters, Substituting contract addresses, Submitting malicious transactions"
    }
  ],
  "rewards": [
    {
      "id": 39100,
      "severity": "critical",
      "assetType": "smart_contract",
      "maxReward": 100000,
      "minReward": 20000,
      "rewardModel": "range",
      "rewardCalculationPercentage": 10
    },
    {
      "id": 39101,
      "severity": "high",
      "assetType": "smart_contract",
      "maxReward": 20000,
      "minReward": 2500,
      "rewardModel": "range"
    },
    {
      "id": 39102,
      "severity": "medium",
      "assetType": "smart_contract",
      "fixedReward": 2000,
      "rewardModel": "fixed"
    },
    {
      "id": 39103,
      "severity": "low",
      "assetType": "smart_contract",
      "fixedReward": 1000,
      "rewardModel": "fixed"
    },
    {
      "id": 39104,
      "severity": "critical",
      "assetType": "websites_and_applications",
      "maxReward": 25000,
      "minReward": 5000,
      "rewardModel": "range",
      "otherImpactMaxReward": 5000
    }
  ]
}
