{
  "pageProps": {
    "bounty": {
      "contentfulId": "1CX9VyQdTXqVwfXlfb98Nr",
      "id": "bitswift",
      "slug": "bitswift",
      "project": "Bitswift Cash",
      "maxBounty": 5000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/1ta3BCV18CvuAgafn5MnQ2/39078c6321c8262348d6ed652829ba86/Bitswift-logo.jpg",
      "launchDate": "2021-02-04T00:00-07:00",
      "endDate": null,
      "updatedDate": "2023-11-30T18:17:10.588Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $5,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "61GSXQ29J7tJkVxqSAvgIO",
          "type": "websites_and_applications",
          "url": "http://bitswift.cash/",
          "description": null,
          "isPrimacyOfImpact": null,
          "addedAt": "2022-02-17T14:59:55.158Z"
        }
      ],
      "impacts": [
        {
          "id": "6RrjDW0N2ZzCoJKoyAco68",
          "title": "Users being able to withdraw more than they are supposed to be able to",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "5NKPYP3Tvbnu6B5Ox1eJiD",
          "title": "Users accounts are credited more than the actual deposit",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6VVUSTluRWHvkq4q0art2X",
          "title": "Users are able to claim more crypto than the stipulated time period allows",
          "type": "websites_and_applications",
          "severity": "critical"
        }
      ],
      "programOverview": "Focused on business applications, Bitswift comes with a community and support\nnetwork of tech pros that have been working with blockchain since its\ninception. However, Bitswift is more than just a blockchain and token. Bitswift\nis composed of community, companies, and customers from all sectors including\nreal estate, healthcare, governance, supply chain management, retail, and much\nmore.\n\nBitswift.cash allows people to conveniently participate in the token economy,\nproviding an accessible interface interconnecting blockchains, leaving the user\nin control of their own personal digital information.\n\nThe bug bounty program is focused around bugs that relate to the ability to\nexploit the deposit, withdrawal, and claim processes on [https://bitswift.cash](https://bitswift.cash).  Bitswift seeks to\nensure its claim, deposit, and withdrawal systems are functioning as intended\nand cannot be exploited to any user's advantage.",
      "prioritizedVulnerabilities": "We are especially interested in receiving and rewarding vulnerabilities of the\nfollowing types:\n\n**Web/App:**\n\n- Remote Code Execution\n- Trusting trust/dependency vulnerabilities\n- Vertical Privilege Escalation\n- XML External Entities Injection\n- SQL Injection\n- LFI/RFI\n- Horizontal Privilege Escalation\n- Stored XSS\n- Reflective XSS with impact\n- CSRF\n- CSRF with impact\n- Direct object reference\n- Internal SSRF\n- Session fixation\n- Insecure Deserialization\n- Direct object reference\n- Path Traversal\n- DOM XSS\n- SSL misconfigurations\n- SSL/TLS issues (weak crypto, improper setup)\n- URL redirect\n- Clickjacking\n- Misleading Unicode text (e.g. using right to left override characters)\n- Coercing the application to display/return specific text to other users",
      "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on\nthe [Immunefi Vulnerability Severity Classification System](/severity-system/). This is a simplified 5-level scale, with separate scales for websites/apps and smart contracts/blockchains, encompassing everything from consequence of exploitation to privilege required to likelihood of a successful exploit.\n\nCritical-level payouts are only applicable when the vulnerability results in \nusers being able to withdraw more than they are supposed to be able to or \nwhen their accounts are credited more than the actual deposit or when the \nuser is able to claim more crypto than the stipulated time period \nallows. Otherwise, they may be classified as High.\n\nAdditionally, all web and app bug reports without proof of concept exploits with \ndemonstrated impact, as well as recommendations for new features, are not accepted. \n\nThere is currently a total bounty pool of CAD $5,710. Because of this, if\nthere are valid bug reports covering different vulnerabilities submitted where\nthe total reward amount is greater than the remaining bounty pool amount, the\nappropriate reward levels will be provided on a first-come-first-served basis,\nand the total bounty pool will be used to reward reports on this priority\nsystem until exhausted. This amount will be updated as rewards are paid out and\nrewards will adjust accordingly.\n\nPayouts are handled by **Bitswift** directly. The USD amount published is just\nan estimate. **In the event of a discrepancy between the CAD and USD exchange\nrates with the estimate provided on this page, the prevailing CAD rate will\napply.** However, payouts are done in **BTC, ETH, CASH or BITS.** Before any\npayout, the bug must first be verified and validated by Bitswift.",
      "outOfScopeAndRules": "**The following vulnerabilities are excluded from the rewards for this bug\nbounty program:**\n\n- Attacks that the reporter has already exploited themselves, leading to damage\n- Attacks requiring access to leaked keys/credentials\n- Attacks requiring access to privileged addresses (governance, strategist)\n- Theoretical vulnerabilities without any proof or demonstration\n- Content spoofing / Text injection issues\n- Self-XSS\n- Captcha bypass using OCR\n- CSRF with no security impact (logout CSRF, change language, etc.)\n- Missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security\n  flags (such as “httponly”)\n- Server-side information disclosure such as IPs, server names, and most stack\n  traces\n- Vulnerabilities used to enumerate or confirm the existence of users or\n  tenants\n- Vulnerabilities requiring unlikely user actions\n- URL Redirects (unless combined with another vulnerability to produce a more\n  severe vulnerability)\n- Lack of SSL/TLS best practices\n- DDoS vulnerabilities\n- Attacks requiring privileged access from within the organization\n\n**The following activities are prohibited by bug bounty program:**\n\n- Any testing with mainnet or public testnet contracts; all testing should be\n  done on private testnets\n- Any testing with pricing oracles or third party smart contracts\n- Attempting phishing or other social engineering attacks against our employees\n  and/or customers\n- Any testing with third party systems and applications (e.g. browser\n  extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- Multi accounts\n\n## Other Notes \n\nInstructions for replication of the bug must be provided in order for\nconsideration.",
      "assetsBodyV2": null,
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Required"
        ],
        "productType": [],
        "projectType": [],
        "ecosystem": [],
        "programType": [
          "Websites and Applications"
        ],
        "language": [],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $5,000"
          }
        ]
      },
      "websiteUrl": null,
      "description": "Focused on business applications, Bitswift comes with a community and support network of tech pros that have been working with blockchain since its inception. However, Bitswift is more than just a blockchain and token. Bitswift is composed of community, companies, and customers from all sectors including real estate, healthcare, governance, supply chain management, retail, and much more.",
      "githubUrl": null,
      "feasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "prohibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": null,
      "knownIssues": [],
      "knownIssueAssurance": false,
      "outOfScopeBlockchain": null,
      "outOfScopeGeneral": null,
      "outOfScopeSmartContract": null,
      "outOfScopeWebAndApplications": null,
      "defaultOutOfScopeBlockchain": null,
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": null,
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": null,
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Ethereum",
      "rewardsToken": "BTC, ETH, CASH or BITS",
      "eligibilityCriteria": [],
      "eligibilityCriteriaAdditionalInformation": null,
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "metaData": {
      "title": "Bitswift Cash Bug Bounties",
      "description": "Find bugs and vulnerabilities on Bitswift Cash and get paid up to $5,000.",
      "url": "https://immunefi.com/bug-bounty/bitswift",
      "ogImg": "/api/bounty/og-image?project=Bitswift+Cash"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
