{
  "pageProps": {
    "isAttackathon": false,
    "academyContent": null,
    "ethereumAttackathonSponsors": null,
    "project": {
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "bounty": {
      "contentfulId": "fzaLgdNany6A10ZLfw1RV",
      "id": "boost-acre",
      "slug": "boost-acre",
      "project": "Audit Comp | Acre",
      "maxBounty": 50000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/0cbT2nwEwQOYtYtnErdn5/29aa15cc2c2cdcec374f927e50bf9b58/ACRE_logo.png",
      "launchDate": "2024-08-20T08:00:25.000Z",
      "endDate": "2024-09-03T08:00:00.000Z",
      "updatedDate": "2024-11-19T12:19:46.549Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "low",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "3PMFspRiiFcgWzej3XJ9uk",
          "type": "smart_contract",
          "url": "https://sepolia.etherscan.io/address/0x7e184179b1F95A9ca398E6a16127f06b81Cb37a3",
          "description": "stBTC - 552",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2024-08-20T08:00:25.000Z",
          "fund": null
        },
        {
          "id": "3fMKyFzodJw6f6Ypl6x4zv",
          "type": "smart_contract",
          "url": "https://sepolia.etherscan.io/address/0xd5EbDD6fF384a465D56562D3a489c8CCE1B92dd0",
          "description": "MezoAllocator - 253",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2024-08-20T08:00:25.000Z",
          "fund": null
        },
        {
          "id": "4GQrMkoUmuCeZiMzZSQ5Ha",
          "type": "smart_contract",
          "url": "https://sepolia.etherscan.io/address/0x6c2c643c90383Cba125E4b8DD01344eA35A75F27",
          "description": "BitcoinDepositor - 355",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2024-08-20T08:00:25.000Z",
          "fund": null
        },
        {
          "id": "2smMScLVlUldQJnmkCk0jB",
          "type": "smart_contract",
          "url": "https://sepolia.etherscan.io/address/0xF4011FD0C77Bd4d909Ae05c7390b88455294dAeA",
          "description": "BitcoinRedeemer - 180",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2024-08-20T08:00:25.000Z",
          "fund": null
        },
        {
          "id": "6SYykUU8W0LlcgaCe8BvzW",
          "type": "smart_contract",
          "url": "https://immunefi.com/",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "isSafeHarbor": null,
          "addedAt": "2024-08-20T08:00:25.000Z",
          "fund": null
        }
      ],
      "impacts": [
        {
          "id": 34,
          "type": "smart_contract",
          "severity": "low",
          "title": "Contract fails to deliver promised returns, but doesn't lose value"
        },
        {
          "id": 23,
          "type": "smart_contract",
          "severity": "high",
          "title": "Theft of unclaimed yield"
        },
        {
          "id": 25,
          "type": "smart_contract",
          "severity": "high",
          "title": "Permanent freezing of unclaimed yield"
        },
        {
          "id": 27,
          "type": "smart_contract",
          "severity": "high",
          "title": "Temporary freezing of funds"
        },
        {
          "id": 29,
          "type": "smart_contract",
          "severity": "medium",
          "title": "Smart contract unable to operate due to lack of token funds"
        },
        {
          "id": 30,
          "type": "smart_contract",
          "severity": "medium",
          "title": "Block stuffing"
        },
        {
          "id": 31,
          "type": "smart_contract",
          "severity": "medium",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)"
        },
        {
          "id": 32,
          "type": "smart_contract",
          "severity": "medium",
          "title": "Theft of gas"
        },
        {
          "id": 33,
          "type": "smart_contract",
          "severity": "medium",
          "title": "Unbounded gas consumption"
        },
        {
          "id": 14,
          "type": "smart_contract",
          "severity": "critical",
          "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results"
        },
        {
          "id": 15,
          "type": "smart_contract",
          "severity": "critical",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield"
        },
        {
          "id": 17,
          "type": "smart_contract",
          "severity": "critical",
          "title": "Permanent freezing of funds"
        },
        {
          "id": 22,
          "type": "smart_contract",
          "severity": "critical",
          "title": "Protocol insolvency"
        }
      ],
      "programOverview": "Acre is a liquid staked Bitcoin protocol. Users deposit BTC and receive stBTC representing their deposited BTC. The deposited BTC is deployed to Bitcoin layers that use BTC as their Proof-of-Stake asset, generating rewards for stBTC holders.\nAcre allows BTC holders to earn rewards on their BTC via stBTC. Acre provides a simple method for Bitcoin holders to benefit from the growth of Bitcoin scaling without losing exposure to BTC price.  \nStrictly designed for a \"bitcoin in, bitcoin out\" experience, Acre is a portal to broad exposure by supporting Bitcoin scaling with minimal user effort. Acre supports native BTC deposits via Thresholds programmable and decentralized BTC bridge.\nAcre's goal is to offer the benefits of earning rewards on idle BTC without deep technical know-how. It is important to note that each transaction within the Acre protocol is completely visible on-chain for everyone to monitor.\n\nFor more information about Acre, please visit https://acre.fi\nAcre provides rewards in USDC, denominated in USD.",
      "prioritizedVulnerabilities": "The following impacts are accepted within this bug bounty program, including those listed under \"Primacy of Impact\" in the Resources > Resources & Documentation section.",
      "rewardsBody": "The following reward terms are a summary, for the full details read our [Acre Audit Competition Reward Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/27470648000273-ACRE-Audit-Competition-Reward-Terms)\n\nThe reward pool of **$50,000 USD** will be entirely distributed among participants. \n\n- 10% of the total reward pool or a maximum of $50k, whichever is lower, is allocated to guaranteed rewards for Insight reports, regardless of whether 0 or more bugs are found or not.\n\nFor this audit competition, duplicates and private known issues are valid for a reward.\n\nRewards are distributed according to the impact of the vulnerability based on the Immunefi [Vulnerability Severity Classification System V2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/). \n\n__Reward Payment Terms__\n\nPayouts are handled by the Acre team directly and are denominated in USD. However, payments are done in USDC\n\nRewards will be distributed all at once based on Immunefi’s distribution formula after the event has concluded and the final bug reports have been resolved.\n\n__Insight Rewards Payment Terms__\n\nInsight Rewards: Portion of the Rewards Pool\n\n* The \"Insight\" severity was introduced on Audit Competition & Attackathon programs to recognize contributions that extend beyond identifying immediate vulnerabilities. Currently, it's not an option to select the Insight severity when submitting a report. However, our team or program will designate it accordingly if applicable. \"Insights\" underscores our commitment to valuing all types of contributions that contribute to a more secure environment and will always be rewarded. [View more information about Insights](https://immunefisupport.zendesk.com/hc/en-us/articles/13333032674961-Severity-Classification-System?utm_source=immunefi). Duplicates of Insight reports weren't rewarded in any previous Audit Competitions, neither they will be rewarded in this Audit Competition or any other Audit Competition going forward.",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program\n\n__All Categories:__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Blockchain/DLT & Smart Contract Specific:__\n\n- Incorrect data supplied by third party oracles\n- Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n\n__Prohibited Activities:__\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty",
      "assetsBodyV2": "__Asset Accuracy Assurance__\n\nBugs found on assets incorrectly listed in-scope will be considered valid and be rewarded.\n\n__Private Known Issues Reward Policy__\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward.\n\n__Known Issue Assurance__\n\nAcre commits to providing Known Issue Assurance to bug submissions through their program. This means that Acre Finance will either disclose known issues publicly, or at the very least, privately via a self-reported bug submission. \n\nIn a potential scenario of a mediation, this allows for a more objective and streamlined process, in order to prove that an issue is known. Otherwise, assuming the bug report is valid, it would result in the report being considered as in-scope, and due a reward.\n\n__Primacy of Impact vs Primacy of Rules__\n\nAcre adheres to the Primacy of Impact for the following impacts:\n\n**Critical**\n\n- Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield\n- Permanent freezing of funds\n- Protocol insolvency\n\n\n**High**\n\n- Theft of unclaimed yield\n- Permanent freezing of unclaimed yield\n- Temporary freezing of funds\n\n\n**Medium**\n\n- Smart contract unable to operate due to lack of token funds\n- Block stuffing\n- Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)\n- Theft of gas\n- Unbounded gas consumption\n\n**Low**\n\n- Contract fails to deliver promised returns, but doesn't lose value\n\n\nPrimacy of Impact means that the impact is prioritized rather than a specific asset. This encourages security researchers to report on all bugs with an in-scope impact, even if the affected assets are not in scope. For more information, please see Best Practices: Primacy of Impact \nWhen submitting a report on Immunefi’s dashboard, the security researcher should select the Primacy of Impact asset placeholder. If the team behind this project has multiple programs, those other programs are not covered under Primacy of Impact for this program. Instead, check if those other projects have a bug bounty program on Immunefi.\nIf the project has any testnet and/or mock files, those will not be covered under Primacy of Impact.\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms and conditions set within this program.\n\n__Eligibility Criteria__\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n__Responsible Publication__\n\nWhitehats may publish their bug reports after they have been fixed & paid, or closed as invalid, with the following exceptions:\n\n- Bug reports in mediation may not be published until mediation has concluded and the bug report is resolved.\n\nImmunefi may publish bug reports submitted to this [Program Type]ed bug bounty and a leaderboard of the participants and their earnings.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Acre has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209-The-Immunefi-Standard-Badge).",
      "impactsBody": "__Proof of Concept (PoC) Requirements__\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the Immunefi PoC Guidelines and Rules\n\n__Whitehat Educational Resources & Technical Info__\n\n- Technical documentation currently lives on GitHub: https://github.com/thesis/acre/tree/main/solidity\n- For a non-technical overview, please see our docs: https://docs.acre.fi\n\n__Is this an upgrade of an existing system? If so, which? And what are the main differences?__\n\nThis is not an upgrade.\n\n__Where do you suspect there may be bugs? Useful aspects of this question are:__\n\nThe stBTC contract is based on the ERC4626 token vault. Attacks resulting in breaking the vault invariants and manipulating the shares conversion ratio are considered significant threats. We want to focus on users funds security.\n\n__What ERC20 / ERC721 / ERC777 / ERC1155 token standards are supported? Which are not?__\n\nAcre’s stBTC implements the ERC-4626 tokenized vault standard. By staking tBTC, users acquire a liquid staking token called stBTC, commonly referred to as \"shares\". Users have the flexibility to redeem stBTC, enabling them to withdraw their deposited tBTC along with the accrued yield. stBTC is a non-rebasing ERC4626 token.\n\n__What emergency actions may you want to use as a reason to invalidate or downgrade an otherwise valid bug report?__\n\nPausing stBTC contract, upgarde of contracts, adjusting minimum deposit limits\n\n\n__What addresses would you consider any bug report requiring their involvement to be out of scope, as long as they operate within the privileges attributed to them?__\n\nContracts Owners, Pause Admin, Mezo Portal, Maintainers\n\n__What addresses would you consider any bug report requiring their involvement be out of scope, even if they exceed the privileges attributed to them?__\n\nContracts Owners, Pause Admin\n\n__What external dependencies are there?__\n\nIn order to support a native bitcoin-in, bitcoin-out experience, Acre has integrated Threshold Network’s tBTC bridge, which is an existing technology. Deposited funds are allocated to the Mezo Portal contract.\n\n__Where might whitehats confuse out-of-scope code to be in-scope?__\n\nExternal libraries are out-of-scope (i.e. @openzeppelin).\n\n__What is the test suite setup information?__\n\nhttps://github.com/thesis/acre/tree/main/solidity#testing\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\n__Previous Audits__\n\nAcre’s completed audit reports can be found at:\n\n- https://github.com/Thesis-Defense/Security-Audit-Reports/blob/main/PDFs/240517_Thesis_Defense-Acre_Smart_Contracts_Security_Audit_Report.pdf\n- https://github.com/Thesis-Defense/Security-Audit-Reports/blob/main/PDFs/240808_Thesis_Defense-Mezo-Acre_stBTC_Smart_Contracts_Security_Audit_Report.pdf\n\nAny unfixed vulnerabilities  mentioned in these reports are not eligible for a reward.",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "Step-by-step PoC Required",
          "Primacy of Impact"
        ],
        "productType": [],
        "projectType": [],
        "ecosystem": [],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "High",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Medium",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Low",
            "payout": "Portion of the Reward Pool"
          }
        ],
        "web_rewards": []
      },
      "evaluationEndDate": "2024-11-19T12:13:45.904Z",
      "boostedIntroStartingIn": "$50,000 USD in rewards is available for finding bugs on Acre.\n\nAcre is a liquid staked Bitcoin protocol. Users deposit BTC and receive stBTC representing their deposited BTC. The deposited BTC is deployed to Bitcoin layers that use BTC as their Proof-of-Stake asset, generating rewards for stBTC holders.\n\nAcre allows BTC holders to earn rewards on their BTC via stBTC. Acre provides a simple method for Bitcoin holders to benefit from the growth of Bitcoin scaling without losing exposure to BTC price.  \n\nNo KYC is required.\n\nAcre will respond within 24 hours on weekdays to all bug reports. Any technical questions can be asked directly to the Acre technical team on Immunefi's [Immunefi’s Discord](https://discord.com/invite/immunefi) in the \"acre-boost\" channel.\n\nWhen the Boost has ended, Immunefi will publish an event-specific leaderboard and bug reports from the event.\n\nAcre will give a live technical walkthrough, hosted in the Immunefi Discord. Sign up below to be notified with more details.",
      "boostedIntroLive": "",
      "boostedIntroEvaluating": "",
      "boostedIntroFinished": "Audit Competition cards for security researchers with paid reports are available [here](https://drive.google.com/drive/folders/1B7bBTfp7vrZkC8Emw2H9kBa3TF-O93X-?usp=sharing)\n\nAll paid bug reports are available in original format [here](https://reports.immunefi.com/acre)",
      "rewardsToken": "USDC",
      "rewardsPool": 50000,
      "primaryPool": 50000,
      "allStarsPool": 0,
      "podiumPool": 0,
      "sourceLinesOfCode": 1340,
      "boostedSummaryReport": "https://drive.google.com/file/d/1ld8VgCkCMxBm65MuAcI8AFjjyAoYTBf6/view?usp=drive_link",
      "inviteOnly": false,
      "hideAssetsInScope": null,
      "boostedLeaderboard": [
        {
          "high": 0,
          "name": "brivan",
          "critical": 0,
          "earnings": 11416,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "Dliteofficial",
          "critical": 0,
          "earnings": 9155,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "trachev",
          "critical": 0,
          "earnings": 8425,
          "insights": 0,
          "mediumLow": 2,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "nnez",
          "critical": 0,
          "earnings": 8425,
          "insights": 0,
          "mediumLow": 2,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "magtentic",
          "critical": 0,
          "earnings": 3942,
          "insights": 0,
          "mediumLow": 2,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "Bx4",
          "critical": 0,
          "earnings": 3662,
          "insights": 0,
          "mediumLow": 2,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "sammytm",
          "critical": 0,
          "earnings": 2585,
          "insights": 0,
          "mediumLow": 1,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "dash",
          "critical": 0,
          "earnings": 2390,
          "insights": 1,
          "mediumLow": 1,
          "totalValidBugs": 1
        }
      ],
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "academyStartDate": null,
      "websiteUrl": "https://acre.fi",
      "description": "Acre is the liquidity layer for Bitcoin scaling. Users deposit BTC and receive stBTC representing their deposited BTC. The deposited BTC is deployed to Bitcoin layers that use BTC as their Proof-of-Stake asset, generating rewards for stBTC holders.",
      "githubUrl": "https://github.com/thesis/acre/tree/main/solidity/contracts",
      "feasibilityLimitations": null,
      "prohibitedActivites": null,
      "responsiblePublicationCategory": null,
      "knownIssues": [],
      "knownIssueAssurance": false,
      "defaultOutOfScopeBlockchain": null,
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": null,
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": null,
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Ethereum",
      "eligibilityCriteria": [],
      "eligibilityCriteriaAdditionalInformation": null,
      "programCodebases": [],
      "programDocumentations": [],
      "primacy": "primacy_of_rules",
      "newProgramRewardsEnabled": false,
      "findingsUrl": null,
      "premiumTriaging": true
    },
    "layoutProps": {
      "headerMarginBottom": "mb-12 lg:mb-16"
    },
    "metaData": {
      "title": "Audit Comp | Acre Bug Bounties",
      "description": "Find bugs and vulnerabilities on Audit Comp | Acre and get paid up to $50,000.",
      "url": "https://immunefi.com/audit-competition/boost-acre/",
      "ogImg": "/api/bounty/og-image/?project=Audit+Comp+%7C+Acre&slug=boost-acre"
    }
  },
  "__N_SSG": true
}
