{
  "pageProps": {
    "bounty": {
      "contentfulId": "32ntnlyoxY9wp63kB5Gv1L",
      "id": "carbonbancor",
      "slug": "carbonbancor",
      "project": "Carbon DeFi by Bancor",
      "maxBounty": 900000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/1nqF3UKYXUVR0FZzbX8zcf/3e9ef81cd45a182e816adbfad9ba4fc3/Bancor-logo.png",
      "launchDate": "2021-04-07T00:00-07:00",
      "endDate": null,
      "updatedDate": "2023-11-30T18:17:08.088Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "up to USD $900,000",
          "pocRequired": false
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $4,500",
          "pocRequired": false
        },
        {
          "assetType": "smart_contract",
          "level": "low",
          "payout": "USD $900",
          "pocRequired": false
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "4jHE0bld2xLIuwNQz616Fz",
          "type": "smart_contract",
          "url": "https://github.com/bancorprotocol/carbon-contracts",
          "description": "Carbon Defi",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-04-18T14:49:38.269Z"
        }
      ],
      "impacts": [
        {
          "id": "6rwi4UDudg4U7aZGlXrSBN",
          "title": "Direct theft of user or protocol funds other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "vh8wnnqY8TOEMl8X3AKXz",
          "title": "Protocol Insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "4jKZFSClYTiDaEFtjWEQob",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "b2byiSPQWQHObtHtI1inF",
          "title": "Smart contract unable to operate due to lack of token funds",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "2MLkt77EgT1qIpkmoFoDqB",
          "title": "Block stuffing for profit",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "vLu7NkFn22i2R3X3W4vuS",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "6uAOs5EueVGPS0WIEUFCXm",
          "title": "Unbounded gas consumption",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "732XrpyQ0IKnskYy7NBelR",
          "title": "Theft of gas",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "6IeLBqDh86W1hJfDRG2nS5",
          "title": "Contract fails to deliver promised returns, but doesn't lose value",
          "type": "smart_contract",
          "severity": "low"
        }
      ],
      "programOverview": "The Carbon Defi Bug Bounty aims to incentivize responsible disclosures of any bugs in the Carbon Defi smart contracts. Starting with the official Beta launch, the [carbon-contracts repository](https://github.com/bancorprotocol/carbon-contracts)  are subject to the bounty program.\n\nRewards are allocated based on the severity of the bug disclosed and awarded up to __$900,000 USD__. The scope, terms and rewards are at the sole discretion of the Bprotocol Foundation.",
      "prioritizedVulnerabilities": "__Scope__\n\nThe list below is not limited to the following submissions but it gives an overview of the issues we care about:\n\n  - Stealing or loss of funds\n  - Unauthorized transactions\n  - Transaction manipulation\n  - Price manipulation\n  - Fee payment bypass\n  - Balance manipulation\n  - Privacy violation\n  - Cryptographic flaws\n  - Reentrancy\n  - Logic errors (including user authentication errors)\n  - Solidity details not considered, including integer over-/under-flow, rounding errors, unhandled exceptions)\n  - Trusting trust/dependency vulnerabilities, including composability vulnerabilities)\n  - Oracle failure/manipulation\n  - Novel governance attacks and economic/financial attacks, including flash loan attacks\n  - Congestion and scalability, including running out of gas, block stuffing, susceptibility to frontrunning\n  - Consensus failures\n  - Cryptography problems, e.g., signature malleability, susceptibility to replay attacks, weak randomness and weak encryption\n  - Susceptibility to block timestamp manipulation\n  - Missing access controls / unprotected internal or debugging interfaces\n  - Issues arising from whitelisted tokens\n\n__Disclosure__\n\nThe vulnerability must not be disclosed publicly or to any other person, entity or email address before Bprotocol Foundation has been notified, has confirmed the issue is fixed, and has granted permission for public disclosure. In addition, disclosure must be made within 24 hours following discovery of the vulnerability.\n\nA detailed report of a vulnerability increases the likelihood of a reward and may increase the reward amount. Please provide as much information about the vulnerability as possible, including:\n\n  - The conditions on which reproducing the bug is contingent.\n  - The steps needed to reproduce the bug or, preferably, a proof of concept.\n  - The potential implications of the vulnerability being abused.\n\nAnyone who reports a unique, previously-unreported vulnerability that results in a change to the code or a configuration change and who keeps such vulnerability confidential until it has been resolved will be recognized publicly for their contribution if they so choose.",
      "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on\nthe [Immunefi Vulnerability Severity Classification System](/severity-system/). This is a simplified 5-level scale, with separate scales for websites/apps and smart contracts/blockchains, encompassing everything from consequence of exploitation to privilege required to likelihood of a successful exploit.\n\nCritical smart contract vulnerabilities are further capped at 10% of economic damage, which primarily takes into consideration the funds at risk. In cases of repeatable attacks, only the first attack is considered unless the smart contract cannot be upgraded or paused.\n\nHigh smart contract vulnerabilities are further capped at 10% of economic damage, which primarily takes into consideration the funds at risk. In cases of repeatable attacks, only the first attack is considered unless the smart contract cannot be upgraded or paused.\n\nTo be eligible for a reward, an invoice must be provided to the Bprotocol Foundation, together with a proper invoice that indicates that it is for the reward of a valid bug report (e.g Carbon Defi bug bounty). The invoice must include the full name and address of the bug bounty hunter as well as an invoice number and date. \n\nPayouts are handled by Bancor directly and are denominated in USD. However, payouts are  done in BNT. All reward amounts are decided by the Bprotocol Foundation and all severity levels have no minimum reward amount.",
      "outOfScopeAndRules": "The following are not within the scope of the Program:\n\n  - Bugs in any third party contract or platform that interacts with Carbon Defi.\n  - Vulnerabilities already reported and/or discovered in contracts built by third parties on Carbon Defi. We reserve the right to keep private previous bug disclosures.\n  - Any previously reported bugs.\n\nThe following vulnerabilities are excluded from the rewards for this bug bounty program:\n\n  - Attacks that the reporter has already exploited themselves, leading to damage.\n  - Attacks requiring access to leaked keys/credentials.\n  - Attacks requiring access to privileged addresses (governance, strategist)\n  - Incorrect data supplied by third party oracles (Note that oracle manipulation and flash loan attacks are included in the bounty)\n  - Basic economic governance attacks (e.g. 51% attack)\n  - Best practice critiques\n  - Sybil attacks\n  - Bugs in any third party contract or platform that interacts with the Carbon Defi protocol (Note that oracle manipulation and flash loan attacks are included in the bounty)\n\nThe following activities are prohibited by bug bounty program:\n\n  - Any testing with mainnet or public testnet contracts; all testing should be done on private testnets or private mainnet forks\n  - Any testing with pricing oracles or third party smart contracts\n  - Attempting phishing or other social engineering attacks against contributors and/or customers\n  - Any testing with third party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n  - Any denial of service attacks\n  - Automated testing of services that generates significant amounts of traffic\n  - Public disclosure of an unpatched vulnerability in an embargoed bounty\n\n__Other Terms__\n\nBy submitting your report, you grant the Bprotocol Foundation any and all rights, including intellectual property rights, needed to validate, mitigate, and disclose the vulnerability. All reward decisions, including eligibility for and amounts of the rewards and the manner in which such rewards will be paid, are made at the sole discretion of the Bprotocol Foundation. The terms and conditions of the Carbon Defi Bug Bounty Program may be altered at any time. The above scope, terms and rewards of the program are at the sole discretion of the Bprotocol Foundation.\n",
      "assetsBodyV2": "### Eligibility \n\nTo be eligible for a reward under this Program, you must:\n\n  - Discover a previously unreported, non-public vulnerability in Carbon Defi (but not on any third party platform interacting with Carbon Defi) that is within the scope of this Program. Vulnerabilities must be distinct from issues covered in any of the official security audits.\n  - Be the first to disclose the unique vulnerability, in compliance with the disclosure requirements above. If similar vulnerabilities are reported within the same 24 hour period, rewards will be split at the discretion of Bprotocol Foundation.\n  - Provide sufficient information to enable contributors to reproduce and fix the vulnerability.\n  - Not engage in any unlawful conduct when disclosing the bug, including through threats, demands, or any other coercive tactics.\n  - Not exploit the vulnerability in any way, including through making it public or by obtaining a profit (other than a reward under this Program).\n  - Make a good faith effort to avoid privacy violations, destruction of data, interruption or degradation of Carbon Defi.\n  - Submit only one vulnerability per submission, unless you need to chain vulnerabilities to provide impact regarding any of the vulnerabilities.\n  - Not submit a vulnerability caused by an underlying issue that is the same as an issue on which a reward has been paid under this program.\n  - Not be a current or former vendor, contractor or subcontractor to the Bprotocol Foundation\n  - Not be subject to Swiss sanctions or reside in a Swiss-embargoed country.\n  - Be at least 18 years of age or, if younger, submit your vulnerability with the consent of your parent or guardian.\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Required",
          "PoC Not Required"
        ],
        "productType": [
          "AMM",
          "DEX"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "up to USD $900,000"
          },
          {
            "level": "Medium",
            "payout": "USD $4,500"
          },
          {
            "level": "Low",
            "payout": "USD $900"
          }
        ],
        "web_rewards": []
      },
      "websiteUrl": null,
      "description": "The Carbon Defi Bug Bounty aims to incentivize responsible disclosures of any bugs in the Carbon Defi smart contracts. Starting with the official Beta launch, the [carbon-contracts repository](https://github.com/bancorprotocol/carbon-contracts)  are subject to the bounty program.",
      "githubUrl": null,
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "defaultProhibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {
        "medianResponseTimeInMinutes": 426,
        "totalPaidAmount": 10647
      }
    },
    "metaData": {
      "title": "Carbon DeFi by Bancor Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Carbon DeFi by Bancor and get paid up to $900,000.",
      "url": "https://immunefi.com/bug-bounty/carbonbancor",
      "ogImg": "/api/bounty/og-image?project=Carbon+DeFi+by+Bancor"
    },
    "bbpPageV2Enabled": true,
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
