{
  "pageProps": {
    "bounty": {
      "contentfulId": "3z2ECKyX1B0YYhlth8wPif",
      "id": "coreum",
      "slug": "coreum",
      "project": "Coreum",
      "maxBounty": 25000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/crJXSyRL6Phpmff7hq91J/cbd0406e1e8ddf23fa6a41837ef228e0/3174316_original.png",
      "launchDate": "2023-12-20T09:00:00.000Z",
      "endDate": null,
      "updatedDate": "2024-05-15T14:14:09.995Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "USD $3,000 to USD $25,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "USD $3,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "medium",
          "payout": "USD $2,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "low",
          "payout": "USD $1,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "12wvfhdsswf00gM1pCzf1D",
          "type": "blockchain_dlt",
          "url": "https://github.com/CoreumFoundation/coreum",
          "description": "Coreum Blockchain",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-12-20T09:00:00.000Z"
        },
        {
          "id": "1Xk86mOsoAzvZHMO0XD6BE",
          "type": "blockchain_dlt",
          "url": "https://immunefi.com/",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2023-12-20T09:00:00.000Z"
        }
      ],
      "impacts": [
        {
          "id": "7jlW6wXmyuIjvSjUiuTGaL",
          "title": "Network not being able to confirm new transactions (Total network shutdown)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "7J0EnDTUXuCGQqYiaFT1Tw",
          "title": "Direct loss of funds",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "1OrtbSHVyAOyyUvvWSSzQj",
          "title": "Permanent freezing of funds (fix requires hard fork)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "1ouAQmoYjR0LrEKMO1hfCI",
          "title": "Temporary freezing of network transactions by delaying one block by 500% or more of the average block time of the preceding 24 hours beyond standard difficulty adjustments",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "65nnowepsMjqXCd8R5wN9I",
          "title": "Causing network processing nodes to process transactions from the mempool beyond set parameters",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "3WFiWPYEy2zuXRSxjqITce",
          "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "53IXWPROh6ZDrc3YKjhKaB",
          "title": "Increasing network processing node resource consumption by at least 30% without brute force actions, compared to the preceding 24 hours",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "44Tr68mUpx7xsVknf6gNWy",
          "title": "Shutdown of greater than or equal to 30% of network processing nodes without brute force actions, but does not shut down the network",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "7gRkDOht6ZmAfHugo3N3vk",
          "title": "Shutdown of greater than 10% or equal to but less than 30% of network processing nodes without brute force actions, but does not shut down the network",
          "type": "blockchain_dlt",
          "severity": "low"
        },
        {
          "id": "7nm2viLrr2AdL6IvonN5lp",
          "title": "Modification of transaction fees outside of design parameters",
          "type": "blockchain_dlt",
          "severity": "low"
        }
      ],
      "programOverview": "Coreum addresses the existing limitations of the current blockchains and empowers a solid foundation for future decentralized projects. Coreum’s unique approach is to provide built-in, on-chain solutions to process transactions in a deterministic way to ensure a fast, secure, cheap, and green network for various use cases.\n\nFor more information about Coreum, please visit [https://www.coreum.com/](https://www.coreum.com/)\n\nCoreum provides rewards in COREUM. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__Responsible Publication__\n\nCoreum adheres to category 3: Approval Required. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nCoreum adheres to the Primacy of Impact for their entire program\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact.\n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Known Issue Assurance__\n\nCoreum commits to providing Known Issue Assurance to bug submissions through their program. This means that Coreum will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Immunefi Standard Badge__\n\nCoreum has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-), which is given to projects that adhere to our best practices.",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\nFor critical Blockchain/DLT bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 25 000, but may also consider subsequent impacts on other projects built on the respective blockchain, as well as PR and brand reputation risk, capped at the maximum critical reward USD 25 000. \n\nTo incentivize security researchers and ensure bug reports are not withheld, a minimum reward USD 3 000  will be provided. \n\nFor Total Network Shutdown, the maximum payment of 25 000 will be rewarded.\n\n__Repeatable Attack Limitations__\n\nIf the blockchain/DLT component where the vulnerability exists can be upgraded/paused/killed, only the initial attacks within the first hour will be considered for a reward. This is because the project can mitigate the risk of further exploitation by upgrading, pausing, or in some cases, killing the component where the vulnerability exists. The reward amount will depend on the severity of the impact and the funds at risk. \n\nAll other impacts that would be classified as Critical would be rewarded a flat amount of USD 3 000. The rest of the severity levels are paid out according to the Impact in Scope table.  \n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- Previously known vulnerabilities in Tendermint(CometBFT) and or/any other fork of these. \n- Previously known vulnerabilities in Cosmos-SDK and or/any other fork of these. \n- Previously known vulnerabilities in CosmWasm and or/any other fork of these. \n- Previously known vulnerabilities in IBC and or/any other fork of these. \n- Any other vulnerabilities that come from Third-Party services and SDKs. \n- Public Zero-day vulnerabilities\n- Any issue on the issue tracker: [https://github.com/CoreumFoundation/coreum/issues ](https://github.com/CoreumFoundation/coreum/issues)\n- Any issue found on open pull requests: [https://github.com/CoreumFoundation/coreum/pulls ](https://github.com/CoreumFoundation/coreum/pulls)\n   - The bridge is out of scope - Coreum to XRPL and XRPL to Coreum\n\n__Previous Audits__\n\nCoreum has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [https://skynet.certik.com/projects/coreum](https://skynet.certik.com/projects/coreum)\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Blockchain/DLT - Critical\n- Blockchain/DLT - High\n- Blockchain/DLT - Medium\n- Blockchain/DLT - Low\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Other Terms and Information__\n\nPayouts are handled by the Coreum team directly and are denominated in USD. However, payouts are done in COREUM. This bug bounty program will have a hard cap of USD 500 000. In the event that multiple bug reports are submitted that exceed this amount, the rewards will be provided on a first come first served basis.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Coreum team directly and are denominated in USD. However, payments are done in COREUM.\n\nThe calculation of the net amount rewarded is based on the average price between CoinMarketCap.com and CoinGecko.com at the time the bug report was submitted. No adjustments are made based on liquidity availability. For avoidance of doubt, if the reward amount is USD 5 000 and the average price is USD 1.75 per token, then the reward will be 2857.142857 units of that token.",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts and Blockchain/DLT__\n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Best practice recommendations\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- Phishing attacks or scams \n- Previously known vulnerabilities in Tendermint(CometBFT) and or/any other fork of these. \n- Previously known vulnerabilities in Cosmos-SDK and or/any other fork of these. \n- Previously known vulnerabilities in CosmWasm and or/any other fork of these. \n- Previously known vulnerabilities in IBC and or/any other fork of these. \n- Any other vulnerabilities that come from Third-Party services and SDKs. \n- Public Zero-day vulnerabilities \n- Denial of service (DoS) / Distributed Denial of Service(DDOS) / Spamming \n- Email services configuration DKIM and SPF records. \n- Any issue on the issue tracker: [https://github.com/CoreumFoundation/coreum/issues ](https://github.com/CoreumFoundation/coreum/issues)\n- Any issue found on open pull requests: [https://github.com/CoreumFoundation/coreum/pulls](https://github.com/CoreumFoundation/coreum/pulls) \n   - The bridge is out of scope",
      "assetsBodyV2": "All code of Coreum can be found at [https://github.com/orgs/CoreumFoundation/repositories.](https://github.com/orgs/CoreumFoundation/repositories) Documentation for the assets provided in the table can be found at [https://docs.coreum.dev/overview/introduction.html. ](https://docs.coreum.dev/overview/introduction.html)\n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers.](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers)\n\nOther helpful links include:\n- Coreum documentation and tutorials - [https://docs.coreum.dev](https://docs.coreum.dev)\n- Coreum smart tokens - [https://docs.coreum.dev/tutorials/smart-tokens/main.html](https://docs.coreum.dev/tutorials/smart-tokens/main.html)\n- Coreum code examples - [https://github.com/CoreumFoundation/tutorials](https://github.com/CoreumFoundation/tutorials)",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [
          "L1",
          "Wallet"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": [],
        "programType": [
          "Blockchain/DLT"
        ],
        "language": [
          "Go",
          "Rust"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "USD $3,000 to USD $25,000"
          },
          {
            "level": "High",
            "payout": "USD $3,000"
          },
          {
            "level": "Medium",
            "payout": "USD $2,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": []
      },
      "websiteUrl": null,
      "description": "Coreum addresses the existing limitations of the current blockchains and empowers a solid foundation for future decentralized projects. Coreum’s unique approach is to provide built-in, on-chain solutions to process transactions in a deterministic way to ensure a fast, secure, cheap, and green network for various use cases.",
      "githubUrl": null,
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "defaultProhibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": null,
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "metaData": {
      "title": "Coreum Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Coreum and get paid up to $25,000.",
      "url": "https://immunefi.com/bug-bounty/coreum",
      "ogImg": "/api/bounty/og-image?project=Coreum"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
