{
  "pageProps": {
    "bounty": {
      "contentfulId": "HKhSWpIalui7eYrpTeGWw",
      "id": "drips",
      "slug": "drips",
      "project": "Drips",
      "maxBounty": 100000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/nYC6PqIgLjot92oyzZKKN/d72cb6d440cb994d48f49425acfca766/photo_2023-11-20_11-01-45_copy_2.jpg",
      "launchDate": "2023-12-01T12:00+03:00",
      "endDate": null,
      "updatedDate": "2024-04-08T18:56:49.380Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $50,000 to USD $100,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $40,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $20,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "3XV8hLBZinuHUVb97Rel11",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0xd0Dd053392db676D57317CD4fe96Fc2cCf42D0b4",
          "description": "Drips",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2e0qPZ88dRTzCStudQyBA3",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0xb0C9B6D67608bE300398d0e4FB0cCa3891E1B33F",
          "description": "Drips Logic",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2jmqfQqHDyPfedawwGaewO",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x60F25ac5F289Dc7F640f948521d486C964A248e5",
          "description": "Caller",
          "isPrimacyOfImpact": null
        },
        {
          "id": "4N5qgoFoziuWiB1tLKA8l5",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x1455d9bD6B98f95dd8FEB2b3D60ed825fcef0610",
          "description": "AddressDriver",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2bCCtOTtcCJsEtnhrWFxve",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x3Ea1e774f98cc4C6359bbCB3238E3e60365Fa5c9",
          "description": "AddressDriver Logic",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3uh0tmvHQIya2u0GIXGtIi",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0xcf9c49B0962EDb01Cdaa5326299ba85D72405258",
          "description": "NFTDriver",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1t3yU5tp0nfrVgAFaHresP",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x3B11537D0d4276Ba9e41FFe04e9034280bd7af50",
          "description": "NFTDriver Logic",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2u8D6rN46lzEqPuOo466PG",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x1212975c0642B07F696080ec1916998441c2b774",
          "description": "ImmutableSplitsDriver",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3iNprT3MK2Xtr6TEKTx8IG",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x2c338CDf00dFd5A9B3B6b0b78BB95352079AAF71",
          "description": "ImmutableSplitsDriver Logic",
          "isPrimacyOfImpact": null
        },
        {
          "id": "7eQ5hKYx5XZLUjRmisFcBK",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x770023d55D09A9C110694827F1a6B32D5c2b373E",
          "description": "RepoDriver",
          "isPrimacyOfImpact": null
        },
        {
          "id": "7BJgQkrTZ8yKuy9Nd12d9D",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0xa928d4b087AD35C46BA83331d8eEddb83152319b",
          "description": "RepoDriver AnyApi Operator",
          "isPrimacyOfImpact": null
        },
        {
          "id": "nwoOX3mOB2X2HMEJGp0gB",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0xfC446dB5E1255e837E95dB90c818C6fEb8e93ab0",
          "description": "RepoDriver Logic",
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "77dA6csccwU8dk5XQvP5I7",
          "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3U16KAIKWlUF6rFmwW4y9W",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield.",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "NGg2MXtvXVvxGc5ZfBFDd",
          "title": "Direct theft of any user NFTs, whether at-rest or in-motion, other than unclaimed royalties",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "28fDxwHhqz1PpBOKjHlP41",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3GzmgZJ6X1ersNrndI1zmY",
          "title": "Permanent freezing of NFTs",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3YTqm2bC68LlWUI30ydfJC",
          "title": "Unintended alteration of what the NFT represents (e.g. token URI, payload, artistic content)",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "14N40cPKpZV1awCexF6Vhk",
          "title": "Protocol insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "4ODJAEsxmE1awD0MscCiSX",
          "title": "Temporary freezing of funds",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "4jaA89ipRrpkTwmxomEqHh",
          "title": "Temporary freezing of NFTs",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "2wibt3Hde5C46qt4J1a5vd",
          "title": "Smart contract unable to operate due to lack of token funds",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "3hRQSngNgQaGipjMEfwUH7",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "medium"
        }
      ],
      "programOverview": "Drips is an Ethereum protocol and web app that makes it easy for organizations and individuals to provide direct financial support to developers of free and open source software (FOSS).\n\nIn essence, Drips serves as an off-the-shelf solution for direct and recurring financial support, allowing organizations to effortlessly allocate ongoing ERC-20 tokens to the projects they consider essential and to link their success to the success of their dependents.\n\nIn Drips, funders provide financial support to FOSS developers by creating Drip Lists.  A Drip List is a collection of Ethereum addresses, ENS names and Git repositories curated by an individual user or organization and packaged together under one title. This list is accompanied by a percentage of funds to be allocated to each item on the list. These lists are publicly available, shareable on the web and open for anyone to fund.\n\nDrips also includes a built-in capability to allow funders to provide continuous, recurring support to FOSS projects over time, which we refer to as “streaming”. Funders who create a stream have the ability to cancel the remainder of a stream at any time and reclaim any un-streamed funds, providing them with complete control and the freedom to adapt their support based on evolving circumstances.\n\nFinally, to enable funders to support FOSS projects that do not have Ethereum addresses at the time the funds are sent, Drips also includes an optional, oracle-based identity solution, powered by Chainlink. This feature enables users to directly send funds to the owners of public software repositories on Github, which the owner of the repository can claim at a later time by adding a FUNDING.json file to the root of the repository’s default branch.\n\nFor more information about Drips, please visit [https://www.drips.network/ ](https://www.drips.network/) \n\nDrips provides rewards in USDC. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__Responsible Publication__\n\nDrips adheres to category 3: Approval Required. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nDrips adheres to the Primacy of Rules, which means that the whole bug bounty program is run strictly under the terms stated in this page.\n\n__Known Issue Assurance__\n\nDrips commits to providing Known Issue Assurance to bug submissions through their program. This means that Drips will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Smart Contract bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 100 000. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of USD 50 000 is to be rewarded in order to incentivize security researchers against withholding a bug report. \n\nAll other impacts that would be classified as Critical, or an impact resulting in a theft of funds that does not fall under this definition, would be rewarded 50 000.\n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- [https://hackmd.io/6_EgTHw6TVGlfxls0iKMAQ?view](https://hackmd.io/6_EgTHw6TVGlfxls0iKMAQ?view)\n\n__Previous Audits__\n\nDrips has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [https://docs.drips.network/assets/files/Spearbit_Drips_Network_Security_Review-d5cda225c36d4c2f1185e154431812b5.pdf](https://docs.drips.network/assets/files/Spearbit_Drips_Network_Security_Review-d5cda225c36d4c2f1185e154431812b5.pdf)\n- [https://docs.drips.network/assets/files/Drips_Audit_Report-c2efbc01f0ce28c8847226339d63c3a7.pdf](https://docs.drips.network/assets/files/Drips_Audit_Report-c2efbc01f0ce28c8847226339d63c3a7.pdf)\n- [https://code4rena.com/reports/2023-01-drips](https://code4rena.com/reports/2023-01-drips)\n- [https://docs.drips.network/assets/files/Certora_Radicle_Drips_Report-a557b047cd7806033d47cfcba1ce334e.pdf](https://docs.drips.network/assets/files/Certora_Radicle_Drips_Report-a557b047cd7806033d47cfcba1ce334e.pdf)\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards ](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards)which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the all Smart contract and Web/App severity levels\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Other Terms and Information__\n\nExceptions to the PoC requirement for smart contract bugs may be made in cases where the vulnerability is objectively evident from simply mentioning the vulnerability and where it exists. However, the bug reporter may be required to provide a PoC at any point in time.\n\nFor smart contract-related vulnerabilities, in order to be eligible for a reward, the vulnerability must exist both in the deployed smart contract on Ethereum Mainnet and the GitHub file in the Assets in Scope table.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Drips team directly and are denominated in USD. However, payments are done in USDC. \n",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts and Blockchain/DLT__ \n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Best practice recommendations\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "All code of Drips can be found at [https://github.com/orgs/drips-network/repositories.](https://github.com/orgs/drips-network/repositories) Documentation for the assets provided in the table can be found at [https://docs.drips.network/. ](https://docs.drips.network/)\n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers.](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers)\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "DAO",
          "Services"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000 to USD $100,000"
          },
          {
            "level": "High",
            "payout": "USD $40,000"
          },
          {
            "level": "Medium",
            "payout": "USD $20,000"
          }
        ],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "Drips Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Drips and get paid up to $100,000.",
      "url": "https://immunefi.com/bug-bounty/drips",
      "ogImg": "/api/bounty/og-image/project=Drips"
    }
  },
  "__N_SSG": true
}
