{
  "pageProps": {
    "bounty": {
      "contentfulId": "7GIHX0KMBTiKu31n7dlZx9",
      "id": "gammaswap",
      "slug": "gammaswap",
      "project": "GammaSwap",
      "maxBounty": 30000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/139C1UQUOpAxZQpCgPNSbP/8b72b96955637df0c288dea8cb2e7602/GammaSwap_logo.png",
      "launchDate": "2023-09-29T20:00:00.000Z",
      "endDate": null,
      "updatedDate": "2024-04-29T12:08:37.931Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $15,000 to USD $30,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $5,000 to USD $10,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $2,000",
          "pocRequired": false
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "4SwcZCeriz4PWWjQONvi3K",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0xFD513630F697A9C1731F196185fb9ebA6eAAc20B#code",
          "description": "GammaPoolFactory",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3Ox23tOtSzukc5mad4JgTz",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0xacce8760b090758e7f703a576387ac89aba0e896#code",
          "description": "PositionManager",
          "isPrimacyOfImpact": null
        },
        {
          "id": "jkYuZepVB0WECzSZmAjAg",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x78c11A2293F7b00E304812c1B90209F3B4fFdea1#code",
          "description": "CPMMShortStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "4Ta86OXVbHWOIibUbqZNHH",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x9195b2141F73AAaC8274C0cd57ca3519CCd48D5E#code",
          "description": "CPMMRepayStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1kd7Caw2SDlwtc7k7xwM88",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x6C223e3Dc9A1b2dBadcD96eF39DeAe1e42103413#code",
          "description": "CPMMMath",
          "isPrimacyOfImpact": null
        },
        {
          "id": "5M2E8CJ85SbevVScVoMuw3",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x2b02d276fD32cC0ea8Bceb38E5aDefe4116fFC8F#code",
          "description": "CPMMLiquidationStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1dnypzEbAX1eqeIgMkcsDX",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x52BBdd04F8E5Ce906337d78aA53232f963Eb4A5e#code",
          "description": "CPMMGammaPool",
          "isPrimacyOfImpact": null
        },
        {
          "id": "5CvhZX96jmrEqk1kRWYltX",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x496b80AdA6758c0a7cF9801b9ded7AeA815f74a6#code",
          "description": "CPMMExternalRebalanceStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2X1Z7bnkMtVSkc7chGQSFZ",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x2076a2f5aB4f1AB471565a5E2C36e9A480E0184E#code",
          "description": "CPMMExternalLiquidationStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "2aIIgATTkans24bFSY9BNp",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x8Fe2C0B1c396Ac9530037897A2085794FA0B609A#code",
          "description": "CPMMBorrowStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3TMHxIWNowHJeC7GWKDYFC",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x6b614a6f2300e22C1Ef721918a8D9E3dc8EA0D18#code",
          "description": "CPMMBatchLiquidationStrategy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "7HGKnv71uwHHHVs2F4qTVw",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0xCb85E1222f715a81b8edaeB73b28182fa37cffA8#code",
          "description": "DeltaSwapFactory",
          "isPrimacyOfImpact": null
        },
        {
          "id": "6kPBhBGVFb8FNlUoyHdadT",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x5FbE219e88f6c6F214Ce6f5B1fcAa0294F31aE1b#code",
          "description": "DeltaSwapRouter02",
          "isPrimacyOfImpact": null
        },
        {
          "id": "4vfIKSoBm6L0ZWa0mOc5Xw",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x755F72D7F22eFaeD6E00E589a8C7bD95A666fEF0#code",
          "description": "DeltaSwapPair",
          "isPrimacyOfImpact": null
        },
        {
          "id": "6aeyw0usB6YIp29cKOaG1G",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0x63c531ffed7e17f8adca4ed490837838f6fa1b66#code",
          "description": "MinimalBeaconProxy",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3Z7p7zw889iuwrb3kkOHCs",
          "type": "smart_contract",
          "url": "https://arbiscan.io/address/0xad64702F5556Bf897d4BA30Cc8e6e54891095cCC#code",
          "description": "LockableMinimalBeacon",
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "KrGyyRKHd9eL1Tu0v4LC8",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "5FCOBkbN9zX6p6dq0f83pw",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "47N9FTFH7bPFpH5PZEzZyV",
          "title": "Protocol insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "aQfh7fGNYqDvYHqyrVnjV",
          "title": "Theft of unclaimed yield",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "6eU12VHue81aay1AYtiuve",
          "title": "Permanent freezing of unclaimed yield",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "5Pq8ULcFzEMZMgsPL0D7x0",
          "title": "Temporary freezing of funds",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "2qekZw2JYLnqsWMW9JFFHn",
          "title": "Contract fails to deliver promised returns, but doesn't lose value",
          "type": "smart_contract",
          "severity": "medium"
        }
      ],
      "programOverview": "GammaSwap is a decentralized exchange enabling anyone to borrow liquidity from any AMM pool, oracle free. This contract is for UniV2 style AMMs but GammaSwap will support Balancer weighted pools in the future.There are two participants in the GammaSwap ecosystem: Liquidity Providers and Borrowers.\n\nFor more information about GammaSwap, please visit [https://gammaswap.com/.](https://gammaswap.com/)  \n\nGammaSwap provides rewards in USDC. For more details about the payment process, please view the Rewards by Threat Level section further below.  \n\n__Responsible Publication__\n\nGammaSwap adheres to category 2: Notice Required. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nGammaSwap adheres to the Primacy of Rules, which means that the whole bug bounty program is run strictly under the terms stated in this page.\n\n__Known Issue Assurance__\n\nGammaSwap commits to providing Known Issue Assurance to bug submissions through their program. This means that GammaSwap will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Invoicing Information__\n\nIf needed by the security researcher, GammaSwap is able to provide the necessary information for the proper issuance of an invoice. This includes:\n- Legal Entity Name\n- Registered Address",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Smart Contract bugs, the reward amount is 10% of the funds directly affected up to a maximum of USD 30,000. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of USD 15,000 is to be rewarded in order to incentivize security researchers against withholding a bug report.   \n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Reward Calculation for High Level Reports__\n\nHigh smart contract vulnerabilities will be capped at up to 100% of the funds affected. There is a minimum reward of __$5,000 USD__. In the event of temporary freezing, the reward doubles for every additional  5  blocks that the funds or NFTs could be temporarily frozen, rounded down to the nearest multiple of 5, up to the hard cap of USD 10,000.  \n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- (Fail promised returns) Arbitrum block number mismatch with mainnet means that the next mainnet block update in arbitrum is usually 4 numbers higher than the previous one because Arbitrum syncs with mainnet every 1 minute. So a loan can be opened and closed in that timeframe to avoid paying an interest rate. However, they will still pay an origination fee.\n- (Fail promised returns) We say GammaSwap performs as good or better than the undeerlying CFMM. However, it is possible for the CFMM to outperform GammaSwap. GammaSwap’s yield is capped at 250% and the return calculated as an annualized value from the yield since the last update. Therefore, if there are many transactions or one really large transaction in the CFMM and subsequently one in GammaSwap soon after so that the annualized yield of the CFMM during that period (calculated by GammaSwap) is greater than 250% then the CFMM will outperform GammaSwap because GammaSwap’s rates are capped at 250%. This means how much a GS LP token represents in CFMM LP tokens would decrease after that update. However, over a longer period since CFMM’s fees don’t sustain that level of activity constantly, such event is short lived and GammaSwap will outperform the CFMM. \n- (Fail promised returns) Protocol fees in the CFMM can make the cfmm fee index be less than 1. This can make the value of the liquidity of GS LP token holders seem greater than it really is before the protocol fee in the CFMM is charged. The CFMM protocol fees in UniswapV2 and its forks are charged during the call of the mint() and burn() functions. Therefore, they always update to accurate values after transactions in GammaSwap that call the mint and burn functions of the CFMM (borrow, repay, liquidate, depositReserves, withdrawReserves). This does not create a benefit to anyone, other than the illusion that the returns (to liquidity suppliers) and expenses (to liquidity borrowers) are greater than they really are prior to the payment of accrued protocol fees. A calculation of the returns or costs after the protocol fee is paid is always accurate.\n- (Fail promised returns) Borrowing more liquidity has to be done in increments of the minBorrow amount. If minBorrow amount is of significant size then there’s not much granularity in borrowing liquidity. It doesn’t affect returns in the platform but it does affect the ease of use of the platform.\n- (Fail promised returns) Long volatility buyers (liquidity borrowers) may show a large profit but when deciding to close their positions to cash in, their profits may be smaller than they expected. The reason is because rebalancing the collateral to repay liquidity debt can have substantial market impact that diminishes their profits. However, this does not create protocol insolvency. The positions are always capable of repaying the liquidity debts as long as they are overcollateralized enough to recover the liquidity borrowed and pay the trading fees in the CFMM to rebalance the collateral.\n- (Fail promised returns, Temporary Freezing of Funds) A user may choose to LP into GammaSwap to become most of the liquidity deposited in the pool. Then borrow most of the liquidity in the pool at a relatively low origination fee. At last he may withdraw enough liquidity that he has LPed to leave the pool locked so nobody else can withdraw and spike up interest rates to 250%. This attack only affects liquidity borrowers, benefits LPs with high yields (although prevents them from withdrawing), and it’s a net cost to the attacker because 10% of the yield LPs receive goes to the protocol, and the attacker is paying most of this yield through interest in his large loan, while not receiving back 100% of the yield he earned. Liquidation rewards on undercollateralized loans are set at 25basis points of the collateral. So the attack may be worth it in some rare instances where there are enough loans close to liquidation that the attacker feels confident in being able to liquidate to cover his losses for spiking interest rates. However, the high rates may attract other LPs to provide liquidity, decreasing the time to liquidation of at risk loans. Also if these at risk loans are closed by their owners before the become undercollateralized then it is a loss to the attacker. Undercollateralization doesn’t mean bad debt in this case either. The current parameters leave a buffer of 50 basis points before reaching a bad debt scenario. That’s about 17.5 hours before a loan becomes bad debt at a constant interest rate of 250%\n- (Fail promised returns) A block stuffing attack may be performed to prevent liquidation transactions, until a GamaPool starts accruing bad debt. The cost of such an attack is of no benefit to the attacker, and given costs to liquidate being 10 cents currently on arbitrum, with the fee reward being multiples higher. The attacker would have to spike up the fees many times for a sustained period of time to make the attack successful. Unlikely to be economically viable for long periods of time.\n- (Fail promised returns) Since GammaPools track the liquidity of each loan as well as the sum of that whole liquidity as two separate numbers that compound separately using the same index. Mismatches may arise due to rounding issues that can accrue over time. The effect only affects the last person closing a loan. The result is that the payment of the last loan causes a write down, even if not undercollateralized, so that LPs do not earn the amount it was calculated they earned. The last person closing the loan is also not charged anymore than he was already aware he owed. These rounding differences however are so small and accrue at such a slow rate (e.g. grow by 1x10^-17 per day) that are unlikely to become a problem within any realistic timeframe.\n- (Fail promised returns) Since solidity does not have native support for decimals or square root formulas, some of the rebalancing calculations may be off a bit due to rounding issues again and liquidity borrowers may get slightly different results from what they expect during rebalancing or closing of their positions. The rounding differences however are usually seen at levels much less than a basis point so they’re usually expected to be very small and more prevalent in tokens that have smaller decimals, such as USDC and USDT which only use 6 decimals. But even in these scenarios the rounding errors lead to differences in outcome of around a couple of basis points.\n- (Fail promised returns) The LP token can be inflated away (e.g. through donations to the CFMM as in UniswapV2 and clones). When this happens it may change the actual reserve tokens a GS LP token represents due to rounding issues. This can lead to gains and losses to different LPs and borrowers. The effects are expected to be small except in early periods when a pool is first created.\n(Fail promised returns) Liquidations can lead to the loss of the entire profit of a loan under certain conditions, especially the more profitable a position is, through CFMM price manipulation. Therefore, borrowers should always try to close their positiosn and not rely on liquidators to close their positions for them. However, this does not lead to losses of LP funds. Since liquidation is an undesirable outcome for a loan, the loss to profitable borrowers is not considered an issue.\n\n__Previous Audits__\n\nGammaSwap has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [GammaSwap_Labs_Core_Strategies_and_Periphery_Smart_Contract_Security_Audit_Report_Halborn_Final.pdf](https://drive.google.com/file/d/1ZT1oaNxvXG1NoQWEhJHhq3OkBd16nGth/view?usp=sharing)\n- [GammaSwap Balancer Implementation - Zellic Audit Report March 14, 2023.pdf](https://drive.google.com/file/d/1RSi1IXCQt2FqK8qL6wn1ojDR2uQcJWS0/view?usp=sharing)\n- [GammaSwap Strategies - Zellic Audit Report March 27, 2023.pdf](https://drive.google.com/file/d/1tjRZwX7vApS2SALbnrZYRQ-gASM2YzNs/view?usp=sharing)\n- [GammaSwap - Zellic Audit Report June 5, 2023.pdf](https://drive.google.com/file/d/18pgiYsO3GM2fDAPtgnkQ126LdLuAuNnD/view?usp=sharing)\n- [GammaSwap - Zellic Audit Report August 24, 2023.pdf](https://drive.google.com/file/d/1kBpi-jYXHlSgjM3LlnOKiySrNfKU4euf/view?usp=sharing)\n- [Deltaswap - Zellic Audit Report.pdf](https://drive.google.com/file/d/1QfEbGNTNHkRRjZkeSXuyTJfF9dvMlucF/view)\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Smart Contract, Critical Severity Level\n- Smart Contract, High Severity Level\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Reward Payment Terms__\n\nPayouts are handled by the GammaSwap team directly and are denominated in USD. However, payments are done in USDC.",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts__\n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Best practice recommendations\n- Impact in UniswapV2 code for DeltaSwap fork (Unless such code was materially changed by GammaSwap or used by the GammaSwap contracts)\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty",
      "assetsBodyV2": "All code of GammaSwap can be found at [https://github.com/gammaswap.](https://github.com/gammaswap) Documentation for the assets provided in the table can be found at [https://www.notion.so/5c0eb0f7c92d41009cca81c995b8cb8e.](https://www.notion.so/5c0eb0f7c92d41009cca81c995b8cb8e)  \n\nOther helpful links include:\n- Attack Vectors & Countermeasures - [https://www.notion.so/Attack-Vectors-Countermeasures-6e651c8e15484c539909a56d1ea41dba ](https://www.notion.so/Attack-Vectors-Countermeasures-6e651c8e15484c539909a56d1ea41dba)\n- Flash Loan CFMM Fee Liquidation Attack - [https://www.notion.so/7001d6004f7c452d884d6ae17fd311d7 ](https://www.notion.so/7001d6004f7c452d884d6ae17fd311d7)\n- Rebalance Formulas - [https://www.notion.so/Rebalance-Formulas-20096ccac7684315b8c88a26337c891a ](https://www.notion.so/Rebalance-Formulas-20096ccac7684315b8c88a26337c891a)\n- Interest Rate Formula - [https://sneaky-nigella-b2d.notion.site/Interest-Rate-d2c06c248f454dd4856c43079f257fb7?pvs=4 ](https://sneaky-nigella-b2d.notion.site/Interest-Rate-d2c06c248f454dd4856c43079f257fb7?pvs=4)\n- Loan to Value Ratio (How debt collateralization is calculated) - [https://www.notion.so/2e5f873eb4eb4d8cbf1439c640dd3ffc ](https://www.notion.so/2e5f873eb4eb4d8cbf1439c640dd3ffc)\n- Dynamic Origination Fee Logic - [https://www.notion.so/Dynamic-Origination-Fee-1b0e7c98b5144ac4b9ee76dde18402c7 ](https://www.notion.so/Dynamic-Origination-Fee-1b0e7c98b5144ac4b9ee76dde18402c7)\n- Transfer Fees Attack Discovered on October 2023 - [https://medium.com/gammaswap-labs/immunefi-bug-report-analysis-contract-re-deployment-283cbdfa0beb](https://medium.com/gammaswap-labs/immunefi-bug-report-analysis-contract-re-deployment-283cbdfa0beb)\n- General Protocol Description - [https://medium.com/gammaswap-labs/gammaswap-protocol-6a4430e4b0ad](https://medium.com/gammaswap-labs/gammaswap-protocol-6a4430e4b0ad)",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "AMM",
          "DEX",
          "Derivatives",
          "Lending",
          "Options",
          "Perpetuals"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "Arbitrum"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $15,000 to USD $30,000"
          },
          {
            "level": "High",
            "payout": "USD $5,000 to USD $10,000"
          },
          {
            "level": "Medium",
            "payout": "USD $2,000"
          }
        ],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "GammaSwap Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on GammaSwap and get paid up to $30,000.",
      "url": "https://immunefi.com/bug-bounty/gammaswap",
      "ogImg": "/api/bounty/og-image?project=GammaSwap"
    },
    "flags": [
      "86azqwf42_Whitehat_Impact_Report_Page",
      "CU-865bzy98e-finger-print-migration",
      "Marketing-explore-page-filters",
      "86azvxyyu_BOUNTY_DETAILS_URL_SPLIT",
      "2vm5bem_Flag-Stuck-Reports",
      "32whfpz_PoC_Link",
      "35rnp7f-Unsubscribe-ACK-SLA",
      "37hgea5_MFA-Increase-Request-Time",
      "86ayu3n01_optimize_social_media_with_immunefi_badge",
      "1zx78fn_Whitehat_leaderboard",
      "32maefz_Clickup_Integration",
      "37wmrca_Project-Reopen-Setting",
      "866amja83_Flag_Spam",
      "863fykwdq_Premium_Rollout2",
      "1zx78fn_Whitehat_leaderboard_API_endpoint",
      "866afx5g9_Notifications_V2",
      "CU-86aydajbf_display_primacy_of_impact_instead_of_url",
      "PROTOCOL__VAULTS__MARKETING_LANDING_PAGE",
      "QuickAction_Categories",
      "861mz69gk_notification-settings",
      "CU-861mygt08_hacker_success_role",
      "CU-866a4wkr0_Rename_Andrew_Projects",
      "PROTOCOL__VAULTS__MARKETING_BOUNTY_PAGE",
      "IN-All",
      "21gqt4q_Whitehat_Post_Report_Survey",
      "2vc8qq0-andrew-missing-escalations",
      "37hgea3_Leaderboard_Date_Range",
      "CU-3chbm1h-audit-logs",
      "86ayt718j_Partners-Section",
      "86az14h3m_Boosted_Additional_Statuses",
      "86azgrjc6_Explore_Page_Separation",
      "CU-860qayyfq_Additional-user-roles",
      "1zx78fn_Whitehat_leaderboard_cronjob",
      "2n9ke9q_Username_Enforcement",
      "2r7a3y7_Premium-Services-MVP",
      "30chw3q_WebhookIntegration-Slack",
      "EMAILS_CHECK_CRON",
      "PROTOCOL__VARIABLE_FEE",
      "PriorityInbox--Sort-By-Last_Updated-By--2d4k0tt",
      "866at49h0_Spam_Prevention_Discord",
      "86ayd29f5_managed_triage_landing_page",
      "86ayqunvh_Managed_Triage_Indicator",
      "CU-86az802nu--invite-only-programs--restrict-wh-participation",
      "PROTOCOL__VAULTS__SUBMIT_REPORT_VAULT_INFO",
      "32k7m6c_Whitehat_Score_Internal",
      "37hge9y_AM-Mass-Unsubscribe",
      "3b3p9wf-handle-escalations-with-no-program-admins",
      "861mz69gk_notification-settings-announcement",
      "860qayrcz_Sign-on-with-Google",
      "258u3pc-Improve_request_for_help_feature",
      "PROTOCOL__VAULTS__SELF_SERVE",
      "Project-Admin-Settings-Page",
      "SAFE_HARBOR__MARKETING_PAGE",
      "861n4c612_control-mediations",
      "866an3xx4_Enable-multiple-programs",
      "86ayeaeya_Managed_Triage_Banner",
      "86ayu13a2-async-local-storage",
      "Automatic-SLA-Breakage-Responses-22rah46",
      "NewQuickActions",
      "PREMIUM_TRIAGING_ROTATIONS",
      "PROTOCOL__VAULTS__OPTIMISM",
      "30znjtv_AM_Macros",
      "86ayg4nhx_Remove-Deprecated-Status-In-UI",
      "86az4nt4j_Boosted_Additional_Tabs",
      "86azke674_Boost_Report_Download",
      "TC_acceptance_system",
      "86az8xdaj_Boost_Landing_Page",
      "86azkdwfg_IOP_Landing_Page",
      "PROTOCOL__VAULTS",
      "86b00r0td_Hackoon",
      "2k733d7_Light-Filtering-Setting",
      "37hgea3_Leaderboard_Date_Range_Backfill",
      "3c5v9an_Project_post_report_survey",
      "863g079z3_WH-Onboarding-Email",
      "2jap0ux_project_perf_metrics",
      "86azkdzj6_Boost_SLA_Removal",
      "CU-863gvk6hh_god-mode-replacement",
      "861m7qk8c_WhitehatLevel_v2",
      "CU-861n8bhkh_disable_duplicate_banned_users",
      "86azy161d_Insights-Identification",
      "86az5q48v_Leaderboard-Link",
      "86aza2ab9_boost_in_app_banner",
      "86azqvz8h_God_Mode_Subscribe_Improvement",
      "PROTOCOL__VAULTS__MARKETING_EXPLORE_PAGE",
      "2khgtzy_Account_Management_Launch_Team",
      "866aad5kd_edit-roles",
      "86aymt6ev_Timeboxed-BBP-MVP",
      "86aypqcyh-andrew-predicable-delays"
    ]
  },
  "__N_SSG": true
}
