{
  "pageProps": {
    "type": "bounty",
    "bounty": {
      "id": "gnosischainwebapp",
      "slug": "gnosischainwebapp",
      "project": "Gnosis Chain (Web/App)",
      "maxBounty": 50000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/6MY3RmEOmul9YqRaUGorEm/47e55d70d164c74e7c826a44b670dc7a/Copy_of_Gnosis_chain_logo.jpeg",
      "launchDate": "2023-04-26T12:00-04:00",
      "updatedDate": "2023-10-16T09:54:51.747Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $15,000 to USD $50,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "USD $10,000 to USD $15,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "medium",
          "payout": "USD $5,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "low",
          "payout": "USD $1,500",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "3nh8so3E324n7gtzy5PDuv",
          "type": "websites_and_applications",
          "url": "http://docs.gnosis.io",
          "description": "Doc (Gnosis Chain)",
          "isPrimacyOfImpact": null
        },
        {
          "id": "JFwQlGxMqSUk0hSq7RRuv",
          "type": "websites_and_applications",
          "url": "http://forum.gnosis.io",
          "description": "Forum (Gnosis Chain)",
          "isPrimacyOfImpact": null
        },
        {
          "id": "3kLJcWZrieCbUdsuHHSyyx",
          "type": "websites_and_applications",
          "url": "http://lock.gnosis.io",
          "description": "Lock (Gnosis Chain)",
          "isPrimacyOfImpact": null
        },
        {
          "id": "FHWkcrEaL2y0f5U5DoGRM",
          "type": "websites_and_applications",
          "url": "http://rpc.gnosischain.com",
          "description": "RPC (Gnosis Chain)",
          "isPrimacyOfImpact": null
        },
        {
          "id": "4DkohGsZvTNTW9VG2BTU5T",
          "type": "websites_and_applications",
          "url": "http://rpc-gbc.gnosischain.com",
          "description": "RPC GBC (Gnosis Chain)",
          "isPrimacyOfImpact": null
        },
        {
          "id": "51hqseexTN83c9J4Gf2uHw",
          "type": "websites_and_applications",
          "url": "http://checkpoint.gnosischain.com",
          "description": "Checkpoint (Gnosis Chain)",
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "3qbFkBVphmLymYiNR93CH7",
          "title": "Execute arbitrary system commands",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "32nRwk88wFlUZ04b5momre",
          "title": "Retrieve sensitive data/files from a running server such as /etc/shadow, database passwords, and blockchain keys(this does not include non-sensitive environment variables, open source code, or usernames)",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "1J06Jy4syJHyIC6okq2JJc",
          "title": "Taking down the application/website",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "3LCiKsOjXPrurvOGndGsmL",
          "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as, changing registration information, commenting, voting, making trades, withdrawals, etc.",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "1EW6zyRKhTq47s8Zqm9g2n",
          "title": "Direct theft of user funds",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "4OsxjTh8a7tvIefZzxxgMW",
          "title": "Malicious interactions with an already-connected wallet such as modifying transaction arguments or parameters, substituting contract addresses, submitting malicious transactions",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "2ous6vHAmaFZ3n2KHF1XiY",
          "title": "Injection of malicious HTML or XSS through NFT metadata",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "320Chbo8kDPckfdnGplEDJ",
          "title": "Injecting/modifying the static content on the target application without Javascript (Persistent) such as HTML injection without Javascript, replacing existing text with arbitrary text, arbitrary file uploads, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "3c6RoaXgWjUe5vnRheNsHR",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as email or password of the victim, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "77zU9rtKNhzBn2DFmWwVT8",
          "title": "Subdomain takeover with already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "52kW5HPdsgRQF4BRXTSKhe",
          "title": "Changing non-sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as changing the first/last name of user, or en/disabling notification",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "47JfULlxTtllsVELrVbgAx",
          "title": "Injecting/modifying the static content on the target application without Javascript (Reflected) such as reflected HTML injection or loading external site data",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "2P8XpSnVFOguIThQOSfcwG",
          "title": "Redirecting users to malicious websites (Open Redirect)",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "31BiQLU4BepP6U8QUDjgmA",
          "title": "Changing details of other users (including modifying browser local storage) without already-connected wallet interaction and with significant user interaction such as iframing leading to modifying the backend/browser state (demonstrate impact with PoC)",
          "type": "websites_and_applications",
          "severity": "low"
        },
        {
          "id": "4V3NdRrH76SUSaB5mfd2c1",
          "title": "Any impact involving a publicly released CVE (demonstrate impact with PoC)",
          "type": "websites_and_applications",
          "severity": "low"
        },
        {
          "id": "4xS69HDMW7DodQyReXKeum",
          "title": "Temporarily disabling user to access target site, such as locking up the victim from login, cookie bombing, etc.",
          "type": "websites_and_applications",
          "severity": "low"
        }
      ],
      "programOverview": "Gnosis Chain is an EVM compatible, community owned network that prioritizes credible neutrality and resiliency, open to everyone without privilege or prejudice. Gnosis Chain is secured by over 100k validators around the world.The chain uses a unique dual-token model; xDai is a stable token used for transactions, payments, and fees, and GNO is used to validate the network through the underlying Proof-of-Stake consensus mechanism.\n\nFor more information about Gnosis Chain, please visit [https://docs.gnosischain.com/](https://docs.gnosischain.com/). \n\n__Special IP Consideration:__ By participating in the Gnosis Chain Bug Bounty Program, the Whitehat grants Gnosis an unrestricted, non-exclusive, irrevocable, perpetual, royalty-free, worldwide, sublicensable license to use any bug report (including its content and all intellectual property rights of the Whitehat in or relating to the bug report) submitted by Whitehat for the purpose of reviewing, assessing, testing, and analyzing the report, as well as reproducing, modifying, distributing, displaying, and publicly disclosing and creating derivative works of the report and its contents. \n\n__Disclosure of Information relating to Bug Reports:__ Security researchers may not publish any information about their bug reports (even after any vulnerabilities have been fixed and the security researcher has been paid) unless Gnosis provides written consent in the bug report submission thread.  \n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System v2.2.](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-2/) This is a simplified 5-level scale, with separate scales for websites/apps and smart contracts/blockchains, encompassing everything from consequence of exploitation to privilege required to likelihood of a successful exploit. \n\nAll web/app bug reports must come with a PoC with an end-effect impacting an asset-in-scope in order to be considered for a reward. \n\nAll Critical and High web/app vulnerabilities are scaled based on internally established team criteria, taking into account the exploitability of the bug, the impact it causes, the report quality (at the discretion of the team), and the likelihood of the vulnerability presenting itself, which is especially factored in with bug reports requiring multiple conditions to be met that are currently not in place. However, there is a minimum reward of USD 10 000 for High impact web/app impact vulnerabilities and USD 15 000 for Critical web/app impact vulnerabilities. Rewards will be provided at the determined fair value by the team depending on these conditions, assuming that the bug report is in-scope of the bug bounty program.\n\nOnly Critical severity bug reports may be submitted for the following assets:  \n  - checkpoint.gnosischain.com\n\nOnly High severity bug reports may be submitted for the following assets:\n  - forum.gnosis.io\n\nPayouts are handled by the __Gnosis Chain__ team directly and are denominated in USD. However, payouts are done in __xDAI/USDC__.  ",
      "outOfScopeAndRules": "The following vulnerabilities are excluded from the rewards for this bug bounty program:\n\n- Attacks that the reporter has already exploited themselves, leading to damage\n- Attacks requiring access to leaked keys/credentials\n- Attacks requiring access to privileged addresses (governance, strategist)\n\n__Websites and Apps__\n\n- Theoretical vulnerabilities without any proof or demonstration\n- Attacks requiring physical access to the victim device\n- Attacks requiring access to the local network of the victim\n- Attacks requiring privileged access from within the organization\n- Reflected plain text injection ex: url parameters, path, etc.\n   - This does not exclude reflected HTML injection with or without javascript\n   - This does not exclude persistent plain text injection\n- Self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (ex: logout CSRF)\n- CSRF with no security impact (logout CSRF, change language, etc)\n- Missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Clickjacking / UI redressing with minimal impact\n- Server-side non-confidential information disclosure such as IPs, server names, and most stack traces\n- Vulnerabilities used only to enumerate or confirm the existence of users or tenants\n- Vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Any form of DDoS vulnerabilities / SlowLoris\n- Feature requests\n- Issues related to the frontend without concrete impact and PoC\n- Best practices issues without concrete impact and PoC\n- Vulnerabilities primarily caused by browser/plugin defects\n- Leakage of non sensitive api keys ex: etherscan, Infura, Alchemy, etc.\n- Any vulnerability exploit requiring browser bugs for exploitation. ex: CSP bypass\n- Subdomain takeover without already-connected wallet interaction\n- Improperly disclosing confidential user information such as email address, phone number, physical address, etc.\n- Outdated software CVE reporting (eg JQuery) \n- Taking over broken or expired outgoing links such as social media handles, etc.\n- Captcha bypass using OCR\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing with mainnet or public testnet contracts; all testing should be done on private testnets\n- Any testing with pricing oracles or third party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "Only those in the Assets in Scope table are considered as in-scope of the bug bounty program.\n\nIf an impact can be caused to any other asset managed by Gnosis that isn’t on this table but for which the impact is in the Impacts in Scope section below, you are encouraged to submit it for the consideration by the project. This only applies for Critical impacts.",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "L2"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Websites and Applications"
        ],
        "language": null
      },
      "legacy": {
        "technologies": [
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $15,000 to USD $50,000"
          },
          {
            "level": "High",
            "payout": "USD $10,000 to USD $15,000"
          },
          {
            "level": "Medium",
            "payout": "USD $5,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,500"
          }
        ]
      }
    },
    "project": null
  },
  "__N_SSG": true
}
