{
  "assets": [
    {
      "id": "39a0vXb661TBbwxRdihluK",
      "revision": 1,
      "type": "websites_and_applications",
      "url": "https://api.hibachi.xyz",
      "description": null,
      "isPrimacyOfImpact": null,
      "addedAt": "2025-01-08T14:58:00.000Z"
    },
    {
      "id": "2d2FxRcOqUmo6paQe1T0K",
      "revision": 1,
      "type": "websites_and_applications",
      "url": "https://data-api.hibachi.xyz",
      "description": null,
      "isPrimacyOfImpact": null,
      "addedAt": "2025-01-08T14:58:00.000Z"
    }
  ],
  "assetsBodyV2": null,
  "boostedIntroEvaluating": "",
  "boostedIntroFinished": "",
  "boostedIntroLive": "",
  "boostedIntroStartingIn": "",
  "boostedLeaderboard": [],
  "boostedSummaryReport": null,
  "ecosystem": [
    "Celestia"
  ],
  "endDate": null,
  "evaluationEndDate": null,
  "features": [],
  "hideAssetsInScope": null,
  "immunefiStandard": true,
  "inviteOnly": false,
  "kyc": true,
  "language": null,
  "launchDate": "2025-01-08T14:58:00.000Z",
  "logo": "https://images.ctfassets.net/t3wqy70tc3bv/86uYalXw77xPgt0tHUI79/99bbd4a6580107cb38c51c89c4b0d328/Hibachi.png",
  "maxBounty": 20000,
  "pocPerTypeAndSeverity": [
    "websites_and_applications - critical",
    "websites_and_applications - high",
    "websites_and_applications - medium",
    "websites_and_applications - low"
  ],
  "primaryPaymentWallet": "EVM",
  "prioritizedVulnerabilities": "Vulnerabilities are prioritized according to severity and/or impact.",
  "productType": [
    "DEX"
  ],
  "programOverview": "Hibachi is a DeFi trading platform built for professionals, secured by zk math, and powered by Celestia, Risc Zero and Hashflow. For more information about Hibachi, please visit [https://hibachi.xyz/](https://hibachi.xyz/).\n\nHibachi provides rewards in USDC on Ethereum, denominated in USD. For more details about the payment process, please view the __Rewards by Threat Level__ section.\n\n__KYC Requirement__\n\nHibachi will be requesting KYC information in order to pay for successful bug submissions. The following information will be required:\n\n- Full name \n- Date of birth\n- Proof of address (either a redacted bank statement with address or a recent utility bill)\n- Copy of Passport or other Government issued ID\n- Eligibility Criteria \n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n\n__Responsible Publication__\n\nHibachi adheres to **category 3 - Approval Required**. This Policy determines what information researchers are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nHibachi adheres to the Primacy of Rules, which means that the whole bug bounty program is run strictly under the terms and conditions stated within this page. \n\n__Proof of Concept (PoC) Requirements__\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules).\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\n- Ability to use a single OTP for multiple operations due to race condition\n- Provider Users a Secure Way to Recover their Account After Losing Access to 2FA\n- Implement CSRF for All Requests\n\n__Previous Audits__\n\nHibachi’s completed audit reports can be found at [WebApp & API Pentest - Whitebox Audit.pdf](https://drive.google.com/file/d/1WcpB5CDJw7sjYDbNyw7nDDiZKWdLkRbW/view) Any unfixed vulnerabilities  mentioned in these reports are not eligible for a reward.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Hibachi has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209).",
  "programType": [
    "Websites and Applications"
  ],
  "project": "Hibachi",
  "projectType": [
    "Defi"
  ],
  "rewardsBody": "Rewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/). \n\nFor critical web/apps bug reports will be rewarded with **USD $40,000**, only if the impact leads to:\n\n- A loss of funds involving an attack that does not require any user action\n- Private key or private key generation leakage leading to unauthorized access to user funds \n\nRewards are subject to adjustment based on the nature of the vulnerability, exploitability, and how practical the attack vector is in a real-world scenario.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Hibachi team directly and are denominated in USD. However, payments are done in USDC on Ethereum\n\nThe calculation of the net amount rewarded is based on the average price between CoinMarketCap.com and CoinGecko.com at the time the bug report was submitted. No adjustments are made based on liquidity availability.\n\nThe assessment of the extent of any potential indirect economic damage, defined as damage other than that evidenced by a PoC that showcases the direct exploitation of the vulnerability leading to impact, is at the full discretion of the Project. This decision is final and non-negotiable. Rewards are based on severity, impact, and report quality.",
  "rewardsPool": 0,
  "primaryPool": 0,
  "allStarsPool": 0,
  "podiumPool": 0,
  "rewardsToken": "",
  "slug": "hibachi",
  "tenPercentEconomicRule": false,
  "updatedDate": "2025-04-08T14:37:35.770Z",
  "impactsBody": null,
  "websiteUrl": null,
  "githubUrl": null,
  "eligibilityCriteria": [
    "no_ofac_sdn",
    "no_official_contributor",
    "no_employee",
    "no_auditor"
  ],
  "responsiblePublicationCategory": "category_3",
  "description": "Hibachi is a DeFi trading platform built for professionals, secured by zk math, and powered by Celestia, Risc Zero and Hashflow. For more information about Hibachi, please visit [https://hibachi.xyz/](https://hibachi.xyz/).",
  "knownIssues": [],
  "defaultOutOfScopeBlockchain": null,
  "defaultOutOfScopeSmartContract": null,
  "defaultOutOfScopeWebAndApplications": "- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n- SPF/DMARC misconfigured records)\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering",
  "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
  "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
  "defaultProhibitedActivities": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)",
  "customOutOfScopeInformation": "1. Unauthorized Access & Exploited Attacks\n- Attacks already exploited by the reporter, causing real-world damage.\n- Vulnerabilities requiring access to leaked credentials, API keys, or secrets, unless proven to be actively used in production.\n- Exploits requiring privileged access (e.g., governance, strategist roles), except when the contract is explicitly designed to have no privileged access to affected functions.\n- Attacks requiring access to internal test files, configuration files, or non-production environments, unless explicitly stated as in-scope.\n- Attacks requiring physical access to devices, internal systems, or restricted networks.\n\n2. Third-Party & Environmental Limitations\n- Issues in third-party services, infrastructure, or dependencies not owned or managed by Hibachi.\n- Bugs related to outdated software versions beyond Hibachi's control (e.g., unsupported browsers).\n- Attacks relying on the depegging of external stablecoins unless directly caused by a flaw in Hibachi's code.\n- Reflected plain text injection (e.g., URL parameters, paths) without proof of real-world impact.\n  - Note: This does not exclude reflected HTML injection (with or without JavaScript) or persistent plain text injection.\n- Any vulnerability requiring browser bugs for exploitation (e.g., CSP bypass).\n- Server-side non-confidential information disclosure (e.g., IPs, server names, most stack traces).\n- SPF/DMARC misconfigured records without security impact.\n\n3. Social Engineering & User Manipulation\n- Phishing, social engineering, or coercion of Hibachi employees, partners, or users.\n- CSRF vulnerabilities without state-modifying impact (e.g., logout CSRF).\n- Automated testing of services generating excessive traffic (e.g., brute force, spam).\n\n4. Automated Attacks & Service Disruptions\n- Denial of Service (DoS), brute force, or rate-limiting bypass attacks.\n- Captcha bypass using OCR without impact demonstration.\n- DDoS-only attacks with no security relevance.\n- Enumeration of user existence (e.g., checking if an email is registered).\n\n5. Theoretical & Non-Exploitable Vulnerabilities\n- Theoretical vulnerabilities without a working proof-of-concept (PoC).\n- Issues requiring in-app user actions that are not part of normal workflows.\n- Impacts requiring access to a victim’s local network (e.g., ARP spoofing, MITM).\n- Lack of SSL/TLS best practices without proven exploitation.\n- Leaked non-sensitive API keys (e.g., Etherscan, Infura, Alchemy).\n- Automated scanner reports without impact demonstration.\n- Missing HTTP headers or cookie flags (e.g., httponly, X-FRAME-OPTIONS) unless leading to an exploitable vulnerability.\n- UX/UI-related bugs that do not materially impact security.\n- Non-future-proof NFT rendering vulnerabilities.",
  "customProhibitedActivities": [],
  "impacts": [
    {
      "id": 35,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Execute arbitrary system commands"
    },
    {
      "id": 36,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Retrieve sensitive data/files from a running server, such as:\n- /etc/shadow\n- database passwords\n- blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)"
    },
    {
      "id": 37,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Taking down the application/website"
    },
    {
      "id": 39,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Taking and/modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as:\n- Changing registration information\n- Commenting\n- Voting\n- Making trades\n- Withdrawals, etc."
    },
    {
      "id": 41,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Subdomain takeover with already-connected wallet interaction"
    },
    {
      "id": 42,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Direct theft of user funds"
    },
    {
      "id": 43,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Malicious interactions with an already-connected wallet, such as:\n- Modifying transaction arguments or parameters\n- Substituting contract addresses\n- Submitting malicious transactions"
    },
    {
      "id": 45,
      "type": "websites_and_applications",
      "severity": "critical",
      "title": "Injection of malicious HTML or XSS through metadata"
    },
    {
      "id": 46,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Injecting/modifying the static content on the target application without JavaScript (persistent), such as:\n- HTML injection without JavaScript\n- Replacing existing text with arbitrary text\n- Arbitrary file uploads, etc."
    },
    {
      "id": 47,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as:\n- Email\n- Password of the victim etc."
    },
    {
      "id": 48,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Improperly disclosing confidential user information, such as:\n- Email address\n- Phone number\n- Physical address, etc."
    },
    {
      "id": 49,
      "type": "websites_and_applications",
      "severity": "high",
      "title": "Subdomain takeover without already-connected wallet interaction"
    },
    {
      "id": 50,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Changing non-sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as:\n- Changing the first/last name of user\n- Enabling/disabling notifications"
    },
    {
      "id": 51,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Injecting/modifying the static content on the target application without JavaScript (reflected), such as:\n- Reflected HTML Injection\n- Loading external site data"
    },
    {
      "id": 52,
      "type": "websites_and_applications",
      "severity": "medium",
      "title": "Redirecting users to malicious websites (open redirect)"
    },
    {
      "id": 53,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Changing details of other users (including modifying browser local storage) without already-connected wallet interaction and with significant user interaction, such as:\n- Iframing leading to modifying the backend/browser state (must demonstrate impact with PoC)"
    },
    {
      "id": 54,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Taking over broken or expired outgoing links, such as:\n- Social media handles, etc."
    },
    {
      "id": 55,
      "type": "websites_and_applications",
      "severity": "low",
      "title": "Temporarily disabling user to access target site, such as:\n- Locking up the victim from login\n- Cookie bombing, etc."
    }
  ],
  "rewards": [
    {
      "id": 23055,
      "assetType": "websites_and_applications",
      "severity": "critical",
      "rewardModel": "range",
      "maxReward": 20000,
      "minReward": 5000,
      "otherImpactMaxReward": 0
    },
    {
      "id": 23056,
      "assetType": "websites_and_applications",
      "severity": "high",
      "rewardModel": "range",
      "maxReward": 5000,
      "minReward": 2500
    },
    {
      "id": 23057,
      "assetType": "websites_and_applications",
      "severity": "medium",
      "rewardModel": "up_to",
      "maxReward": 2500
    },
    {
      "id": 23058,
      "assetType": "websites_and_applications",
      "severity": "low",
      "rewardModel": "up_to",
      "maxReward": 1000
    }
  ]
}
