{
  "pageProps": {
    "type": "bounty",
    "bounty": {
      "id": "immunefi",
      "slug": "immunefi",
      "project": "Immunefi",
      "maxBounty": 50000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/1XjTFUMSo1pLNrTF0aIH4U/353cf547e2cd9dcfc4e464ce9c328c07/Logo_square.png",
      "launchDate": "2020-12-02T00:00-05:00",
      "updatedDate": "2023-09-26T15:02:43.726Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $50,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $10,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $5,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "low",
          "payout": "USD $1,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $5,000",
          "pocRequired": false
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "USD $3,000",
          "pocRequired": false
        },
        {
          "assetType": "websites_and_applications",
          "level": "medium",
          "payout": "USD $2,000",
          "pocRequired": false
        },
        {
          "assetType": "websites_and_applications",
          "level": "low",
          "payout": "USD $1,000",
          "pocRequired": false
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "2Ww79tsQT2sDV7vwuDGWNU",
          "type": "websites_and_applications",
          "url": "https://immunefi.com",
          "description": null
        },
        {
          "id": "6ulUHkIZi3O4ORQzLyH260",
          "type": "websites_and_applications",
          "url": "https://bugs.immunefi.com",
          "description": null
        },
        {
          "id": "3uM1WWFJS6LHgOHJVvdzWg",
          "type": "smart_contract",
          "url": "https://etherscan.io/address/0x03fd3d61423e6d46dcc3917862fbc57653dc3eb0",
          "description": null
        }
      ],
      "impacts": [
        {
          "id": "y8XUfjBz9OcFlWxr9NNcL",
          "title": "Execute arbitrary system commands",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "35xWjctGzXbmEFc1J1AlPT",
          "title": "Retrieve sensitive data/files from a running server such as: database passwords,blockchain keys, etc (this does not include non-sensitive environment variables, open source code, or usernames)",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6x3dRgkWLgrX8EgHjRRpji",
          "title": "Taking down the application/website",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "25UBsBCUVqKe2ZIGKOiIuj",
          "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as: changing registration information, commenting, voting, making trades, withdrawals, etc",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6ykiry7ccGPkctnqd4TV7o",
          "title": "Subdomain takeover with already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "5aiCCU3fZ9n46DlitFl3XK",
          "title": "Direct theft of user funds",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "l5tARcKAOaHJVE4ZGg0FI",
          "title": "Malicious interactions with an already-connected wallet such as: modifying transaction arguments or parameters, substituting contract addresses, submitting malicious transactions",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6nMqLxhdECbMsayPmcze3",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "PtHEcouCdx5aGEdNnRR0a",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "54xarubKbcEnRJBSrSe1fo",
          "title": "Injecting/modifying the static content on the target application without Javascript (Persistent) such as: HTML injection without Javascript, replacing existing text with arbitrary text, arbitrary file uploads, etc",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "3TzBr54fKoYnU7QVVn870A",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: email or password of the victim, etc",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "5jh9OIiun1dLGAuR9fVDhZ",
          "title": "Improperly disclosing confidential user information such as: email address, phone number, physical address, etc",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "2xOng4x9DUSwzamAMdriV5",
          "title": "Subdomain takeover without already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "5GBGhr3KiM2WPbNsBuFtre",
          "title": "Temporary freezing of funds",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "Dy6Fb4nCU8D0SiLeV0w1X",
          "title": "Theft of fee or royalties",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "j2JCAG8PGBksH9lco39MP",
          "title": "Changing non-sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: changing the name of user, enabling/disabling notifications",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "4Z5j5uGNO4W4lxBV4pojhk",
          "title": "Injecting/modifying the static content on the target application without Javascript (Reflected) such as: reflected HTML injection, loading external site data",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "6NPamHw41KxS5hYqmIKDLs",
          "title": "Redirecting users to malicious websites (Open Redirect)",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "5YgONANOiCplvkL3zM1n11",
          "title": "Smart contract unable to operate due to lack of token funds",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "4otOUYNUxoHXmGPz1KLCub",
          "title": "Block stuffing for profit",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "7veQsGIOVmmDSl00882kOJ",
          "title": "Theft of gas",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "6u7bqNKWutuUQxcyZL93Ab",
          "title": "Unbounded gas consumption",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "3NQz9VBxbAR3uj8wAzU9Ot",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the smart contracts)",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "4SU6xTsdF9F4LNhjanxtyt",
          "title": "Changing other users details (including modifying browser local storage) without already-connected wallet interaction and with significant user interaction such as: iframing leading to modifying the backend/browser state",
          "type": "websites_and_applications",
          "severity": "low"
        },
        {
          "id": "3XqNAcPwNUQ7d0IoY48nE0",
          "title": "Taking over broken or expired outgoing links such as: social media handles, etc",
          "type": "websites_and_applications",
          "severity": "low"
        },
        {
          "id": "2L9TZomSeFoNiLAWqiRMGr",
          "title": "Temporarily disabling user to access target site, such as: locking up the victim from login, cookie bombing, etc",
          "type": "websites_and_applications",
          "severity": "low"
        },
        {
          "id": "3ZRdbFq9CqA1SJxuJIWwsa",
          "title": "Contract fails to deliver promised returns, but doesn't lose value",
          "type": "smart_contract",
          "severity": "low"
        }
      ],
      "programOverview": "Immunefi is the leading bug bounty platform on web3 with the world’s largest bounties. \n\nImmunefi is interested in securing their beta release Vaults System and website. Primary areas of concern are around the modification of information on the website, leakage and loss of client data, leakage of communicated information from clients to the company, and loss of assets in the vaults.\n\nImmunefi is aiming to decentralize the bug bounty space to provide more trust between whitehats and projects through releasing a smart contract Vaults System.\n\nThe first iteration of this Vaults System contains two features: 1) projects on Immunefi can demonstrate proof-of-assets by depositing assets into vaults that are ready to be used to pay out bounties, and 2) projects can conduct payments to whitehats fully on-chain within the Immunefi dashboard. \n\nFor more information about Immunefi, please visit [www.immunefi.com](https://www.immunefi.com) \n\nImmunefi provides rewards in __USDC__. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__KYC Requirement__\n\nThe provision of KYC is required to receive a reward for this bug bounty program where the following information will be required to be provided:\n\n  - For all submissions, Immunefi may request the researcher's country of residence before releasing payment. Some countries are restricted when it comes to payments. This bug bounty program is only open to individuals who reside outside of the countries that are restricted by OFAC and by UNSC resolutions.\n\nFor critical submissions, Immunefi will request government identification. KYC verification will be completed by an external service before payment can be released.\n\nKYC information is only required on confirmation of the validity of a bug report.  \n\n__Responsible Publication__\n\nImmunefi adheres to __category 1__. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication page](https://immunefi.com/responsible-publication/).\n\n__Primacy of Impact vs Primacy of Rules__\n\nImmunefi adheres to the Primacy of Impact for the following severity levels:\n\n  - Smart Contract Critical \n  - Smart Contract High \n  - Smart Contract Medium\n  - Smart Contract Low\n  - Web/App Critical\n  - Web/App High\n  - Web/App Medium\n  - Web/App Low\n\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact.\n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Known Issue Assurance__\n\nImmunefi commits to providing Known Issue Assurance to bug submissions through their program. This means that Immunefi will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Immunefi Standard Badge__\nImmunefi has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209), which is given to projects that adhere to our best practices. \n\n__Invoicing Information__\nIf needed by the security researcher, Immunefi is able to provide the necessary information for the proper issuance of an invoice. This includes:\n  - Name of company\n  - Address\n  - Comp reg./taxpayer nr\n  - Email to send invoice\n\nTo request this information, please send a query in the bugs.dashboard in the bug report that has been confirmed to be paid. Immunefi will then provide all necessary information for an invoice to be made.\n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\nFor critical Smart Contract bugs, the reward amount is __10%__ of the funds directly affected up to a maximum of __USD 50 000__. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of __USD 10 000__ is to be rewarded in order to incentivize security researchers against withholding a bug report.   \n\nCritical website and application bug reports will be rewarded with __USD 10 000__, only if the impact leads to a direct loss in funds involving an attack that does not require any user action at all. Additionally any impact that leads to “Retrieve sensitive data/files from a running server such as: database passwords,blockchain keys, etc (this does not include non-sensitive environment variables, open source code, or usernames” and to “Execute arbitrary system commands” would be rewarded  USD 10 000 USD, which is 2x the standard amount for Web/App critical impact. All other impacts that would be classified as Critical, or an impact resulting in a theft of funds that does not fall under this definition, would be rewarded __USD 5 000__.\n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack is considered if the smart contracts where the vulnerability exists can be upgraded, paused, or killed. If the attack impacts a smart contract directly holding funds that cannot be upgraded or paused, the amount of funds at risk will be calculated with the first attack being at 100% of the funds that could be stolen and then a reduction of 25% from the amount of the first attack for every 300 blocks the attack needs for subsequent attacks from the first attack, rounded down. For avoidance of doubt, if a second attack would happen at 600 blocks and then a third at 900 blocks, the funds at risk would be counted at 50% and 25% of the reward from the first attack, respectively.\n\n__Reward Calculation for High Level Reports__\nHigh smart contract vulnerabilities will be capped at up to 100% of the funds affected. In the event of temporary freezing, the reward doubles for every additional 5 blocks that the funds could be temporarily frozen, rounded down to the nearest multiple of 5, up to the hard cap of USD 10 000 USD. \n\n__Restrictions on Security Researcher Eligibility__\n\nSecurity researchers who fall under any of the following are ineligible for a reward\n\n  - Countries that are restricted by OFAC and by UNSC resolutions.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n\n  - Any well-known issues related to Gnosis Safe: [https://docs.gnosis-safe.io/learn/security/security-audits ](https://docs.gnosis-safe.io/learn/security/security-audits)\n\n__Previous Audits__\nImmunefi has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n\n  - Here’s the [internal audit](https://github.com/immunefi-team/protocol-vaults/blob/main/audits/2023-02-03%20-%20Immunefi%20-%20Internal%20Audit%20of%20the%20Vaults%20system.pdf) of the Vaults System \n  - Here’s the [Ourovoros audit](https://github.com/immunefi-team/vaults/blob/main/audits/2023-02-13%20-%20Ourovoros%20Audit.md) of the Vaults System \n\n__Feasibility Limitations__\n\nBug reports that require an attack that involve one or more other protocols (e.g. utilizing flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be downgrade by one severity level. However, they will be considered as in-scope and categorized according to the program rules as long as all of the following are true:\n\n  - Losses or other negative effects of the attack are inflicted upon Immunefi ecosystem participants (including Immunefi’s customers) \n\n  - The additional protocols used must have enough liquidity in various assets to allow the attack to succeed at the time of bug report submission. For example: if an attack requires an ETH flash loan, but the amount is larger than all the ETH available for loan across the ecosystem\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n\n  - All Smart Contract bug reports\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules). Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Other Terms and Information__\n\nBug reports covering previously-discovered bugs are not eligible for the program. If a bug report covers a known issue, it may be rejected, and Immunefi will provide proof that the issue is already known.  \n\n__Reward Payment Terms__\n\nPayouts are handled by the Immunefi team directly and are denominated in USD. However, payments are done in USDC\n",
      "outOfScopeAndRules": "These impacts are excluded from the rewards for this bug bounty program. \n\n__All Categories__\n\n  - Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n  - Impacts caused by attacks requiring hypothetical access to leaked keys/credentials\n  - Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n  - Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n  - Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n  - Best practice recommendations\n  - Feature requests\n  - Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts__\n\n  - Incorrect data supplied by third party oracles\n    - Not to exclude oracle manipulation/flash loan attacks\n  - Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n  - Lack of liquidity impacts\n  - Impacts from Sybil attacks\n  - Impacts involving centralization risks\n\n__Web/App__\n\n  - Theoretical impacts without any proof or demonstration\n  - Impacts involving attacks requiring physical access to the victim device\n  - Impacts involving attacks requiring access to the local network of the victim\n  - Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n  - Any impacts involving self-XSS\n  - Captcha bypass using OCR without impact demonstration\n  - CSRF with no state modifying security impact (e.g. logout CSRF)\n  - Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n  - Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n  - Impacts causing only the enumeration or confirmation of the existence of users or tenants\n  - Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n  - Lack of SSL/TLS best practices\n  - Impacts that only require DDoS\n  - UX and UI impacts that do not materially disrupt use of the platform\n  - Impacts primarily caused by browser/plugin defects\n  - Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n  - Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n  - SPF/DMARC misconfigured records)\n  - Missing HTTP Headers without demonstrated impact\n  - Automated scanner reports without demonstrated impact\n  - UI/UX best practice recommendations\n  - Non-future-proof NFT rendering\n\nThe following activities are prohibited by this bug bounty program:\n\n  - Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n  - Any testing with pricing oracles or third-party smart contracts\n  - Attempting phishing or other social engineering attacks against our employees and/or customers\n  - Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n  - Any denial of service attacks that are executed against project assets\n  - Automated testing of services that generates significant amounts of traffic\n  - Public disclosure of an unpatched vulnerability in an embargoed bounty\n  - [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/).\n",
      "assetsBodyV2": "Documentation of the Vaults System can be found [https://github.com/immunefi-team/vaults/blob/main/README.md ](https://github.com/immunefi-team/vaults/blob/main/README.md)\n\nAll smart contracts for the new Vaults System can be found at [https://github.com/immunefi-team/vaults](https://github.com/immunefi-team/vaults) \n\nHowever, only those in the Assets in Scope table are considered as in-scope of the bug bounty program.\n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers).\n",
      "impactsBody": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.\n\nThese accepted impacts are then based on the severity classification system of this bug bounty program. When submitting a bug report, please select the severity level you feel best corresponds to the severity classification system as long as the impact itself is one of the listed items. \n\nIf an impact can be caused to any other asset managed by Immunefi that isn’t on this table but for which the impact is in the Impacts in Scope section below, you are encouraged to submit it for consideration by Immunefi.",
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "Bug bounty"
        ],
        "projectType": [
          "Infrastructure"
        ],
        "ecosystem": [
          "ETH",
          "xDAI"
        ],
        "programType": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000"
          },
          {
            "level": "High",
            "payout": "USD $10,000"
          },
          {
            "level": "Medium",
            "payout": "USD $5,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $5,000"
          },
          {
            "level": "High",
            "payout": "USD $3,000"
          },
          {
            "level": "Medium",
            "payout": "USD $2,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ]
      }
    },
    "mdx": {
      "programOverview": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Immunefi is the leading bug bounty platform on web3 with the world\\u2019s largest bounties. \"), mdx(\"p\", null, \"Immunefi is interested in securing their beta release Vaults System and website. Primary areas of concern are around the modification of information on the website, leakage and loss of client data, leakage of communicated information from clients to the company, and loss of assets in the vaults.\"), mdx(\"p\", null, \"Immunefi is aiming to decentralize the bug bounty space to provide more trust between whitehats and projects through releasing a smart contract Vaults System.\"), mdx(\"p\", null, \"The first iteration of this Vaults System contains two features: 1) projects on Immunefi can demonstrate proof-of-assets by depositing assets into vaults that are ready to be used to pay out bounties, and 2) projects can conduct payments to whitehats fully on-chain within the Immunefi dashboard. \"), mdx(\"p\", null, \"For more information about Immunefi, please visit \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://www.immunefi.com\"\n  }, \"www.immunefi.com\"), \" \"), mdx(\"p\", null, \"Immunefi provides rewards in \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"USDC\"), \". For more details about the payment process, please view the Rewards by Threat Level section further below. \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"KYC Requirement\")), mdx(\"p\", null, \"The provision of KYC is required to receive a reward for this bug bounty program where the following information will be required to be provided:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"For all submissions, Immunefi may request the researcher's country of residence before releasing payment. Some countries are restricted when it comes to payments. This bug bounty program is only open to individuals who reside outside of the countries that are restricted by OFAC and by UNSC resolutions.\")), mdx(\"p\", null, \"For critical submissions, Immunefi will request government identification. KYC verification will be completed by an external service before payment can be released.\"), mdx(\"p\", null, \"KYC information is only required on confirmation of the validity of a bug report.  \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Responsible Publication\")), mdx(\"p\", null, \"Immunefi adheres to \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"category 1\"), \". This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://immunefi.com/responsible-publication/\"\n  }, \"Responsible Publication page\"), \".\"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Primacy of Impact vs Primacy of Rules\")), mdx(\"p\", null, \"Immunefi adheres to the Primacy of Impact for the following severity levels:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Smart Contract Critical \"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Smart Contract High \"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Smart Contract Medium\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Smart Contract Low\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Web/App Critical\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Web/App High\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Web/App Medium\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Web/App Low\")), mdx(\"p\", null, \"If a category\\u2019s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\"), mdx(\"p\", null, \"Testnet and mock files are not covered under the Primacy of Impact.\"), mdx(\"p\", null, \"All other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Known Issue Assurance\")), mdx(\"p\", null, \"Immunefi commits to providing Known Issue Assurance to bug submissions through their program. This means that Immunefi will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Immunefi Standard Badge\"), \"\\nImmunefi has satisfied the requirements for the \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209\"\n  }, \"Immunefi Standard Badge\"), \", which is given to projects that adhere to our best practices. \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Invoicing Information\"), \"\\nIf needed by the security researcher, Immunefi is able to provide the necessary information for the proper issuance of an invoice. This includes:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Name of company\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Address\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Comp reg./taxpayer nr\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Email to send invoice\")), mdx(\"p\", null, \"To request this information, please send a query in the bugs.dashboard in the bug report that has been confirmed to be paid. Immunefi will then provide all necessary information for an invoice to be made.\"));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>Immunefi is the leading bug bounty platform on web3 with the world’s largest bounties. </p><p>Immunefi is interested in securing their beta release Vaults System and website. Primary areas of concern are around the modification of information on the website, leakage and loss of client data, leakage of communicated information from clients to the company, and loss of assets in the vaults.</p><p>Immunefi is aiming to decentralize the bug bounty space to provide more trust between whitehats and projects through releasing a smart contract Vaults System.</p><p>The first iteration of this Vaults System contains two features: 1) projects on Immunefi can demonstrate proof-of-assets by depositing assets into vaults that are ready to be used to pay out bounties, and 2) projects can conduct payments to whitehats fully on-chain within the Immunefi dashboard. </p><p>For more information about Immunefi, please visit <a href=\"https://www.immunefi.com\">www.immunefi.com</a> </p><p>Immunefi provides rewards in <strong>USDC</strong>. For more details about the payment process, please view the Rewards by Threat Level section further below. </p><p><strong>KYC Requirement</strong></p><p>The provision of KYC is required to receive a reward for this bug bounty program where the following information will be required to be provided:</p><ul><li>For all submissions, Immunefi may request the researcher&#x27;s country of residence before releasing payment. Some countries are restricted when it comes to payments. This bug bounty program is only open to individuals who reside outside of the countries that are restricted by OFAC and by UNSC resolutions.</li></ul><p>For critical submissions, Immunefi will request government identification. KYC verification will be completed by an external service before payment can be released.</p><p>KYC information is only required on confirmation of the validity of a bug report.  </p><p><strong>Responsible Publication</strong></p><p>Immunefi adheres to <strong>category 1</strong>. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our <a href=\"https://immunefi.com/responsible-publication/\">Responsible Publication page</a>.</p><p><strong>Primacy of Impact vs Primacy of Rules</strong></p><p>Immunefi adheres to the Primacy of Impact for the following severity levels:</p><ul><li>Smart Contract Critical </li><li>Smart Contract High </li><li>Smart Contract Medium</li><li>Smart Contract Low</li><li>Web/App Critical</li><li>Web/App High</li><li>Web/App Medium</li><li>Web/App Low</li></ul><p>If a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.</p><p>Testnet and mock files are not covered under the Primacy of Impact.</p><p>All other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.</p><p><strong>Known Issue Assurance</strong></p><p>Immunefi commits to providing Known Issue Assurance to bug submissions through their program. This means that Immunefi will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. </p><p><strong>Immunefi Standard Badge</strong>\nImmunefi has satisfied the requirements for the <a href=\"https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209\">Immunefi Standard Badge</a>, which is given to projects that adhere to our best practices. </p><p><strong>Invoicing Information</strong>\nIf needed by the security researcher, Immunefi is able to provide the necessary information for the proper issuance of an invoice. This includes:</p><ul><li>Name of company</li><li>Address</li><li>Comp reg./taxpayer nr</li><li>Email to send invoice</li></ul><p>To request this information, please send a query in the bugs.dashboard in the bug report that has been confirmed to be paid. Immunefi will then provide all necessary information for an invoice to be made.</p>",
        "scope": {}
      },
      "prioritizedVulnerabilities": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.\"));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.</p>",
        "scope": {}
      },
      "rewardsBody": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \"), mdx(\"p\", null, \"For critical Smart Contract bugs, the reward amount is \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"10%\"), \" of the funds directly affected up to a maximum of \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"USD 50 000\"), \". The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"USD 10 000\"), \" is to be rewarded in order to incentivize security researchers against withholding a bug report.   \"), mdx(\"p\", null, \"Critical website and application bug reports will be rewarded with \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"USD 10 000\"), \", only if the impact leads to a direct loss in funds involving an attack that does not require any user action at all. Additionally any impact that leads to \\u201CRetrieve sensitive data/files from a running server such as: database passwords,blockchain keys, etc (this does not include non-sensitive environment variables, open source code, or usernames\\u201D and to \\u201CExecute arbitrary system commands\\u201D would be rewarded  USD 10 000 USD, which is 2x the standard amount for Web/App critical impact. All other impacts that would be classified as Critical, or an impact resulting in a theft of funds that does not fall under this definition, would be rewarded \", mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"USD 5 000\"), \".\"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Repeatable Attack Limitations\")), mdx(\"p\", null, \"In cases of repeatable attacks for smart contract bugs, only the first attack is considered if the smart contracts where the vulnerability exists can be upgraded, paused, or killed. If the attack impacts a smart contract directly holding funds that cannot be upgraded or paused, the amount of funds at risk will be calculated with the first attack being at 100% of the funds that could be stolen and then a reduction of 25% from the amount of the first attack for every 300 blocks the attack needs for subsequent attacks from the first attack, rounded down. For avoidance of doubt, if a second attack would happen at 600 blocks and then a third at 900 blocks, the funds at risk would be counted at 50% and 25% of the reward from the first attack, respectively.\"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Reward Calculation for High Level Reports\"), \"\\nHigh smart contract vulnerabilities will be capped at up to 100% of the funds affected. In the event of temporary freezing, the reward doubles for every additional 5 blocks that the funds could be temporarily frozen, rounded down to the nearest multiple of 5, up to the hard cap of USD 10 000 USD. \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Restrictions on Security Researcher Eligibility\")), mdx(\"p\", null, \"Security researchers who fall under any of the following are ineligible for a reward\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Countries that are restricted by OFAC and by UNSC resolutions.\")), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Public Disclosure of Known Issues\")), mdx(\"p\", null, \"Bug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any well-known issues related to Gnosis Safe: \", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://docs.gnosis-safe.io/learn/security/security-audits\"\n  }, \"https://docs.gnosis-safe.io/learn/security/security-audits \"))), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Previous Audits\"), \"\\nImmunefi has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Here\\u2019s the \", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://github.com/immunefi-team/protocol-vaults/blob/main/audits/2023-02-03%20-%20Immunefi%20-%20Internal%20Audit%20of%20the%20Vaults%20system.pdf\"\n  }, \"internal audit\"), \" of the Vaults System \"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Here\\u2019s the \", mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://github.com/immunefi-team/vaults/blob/main/audits/2023-02-13%20-%20Ourovoros%20Audit.md\"\n  }, \"Ourovoros audit\"), \" of the Vaults System \")), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Feasibility Limitations\")), mdx(\"p\", null, \"Bug reports that require an attack that involve one or more other protocols (e.g. utilizing flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be downgrade by one severity level. However, they will be considered as in-scope and categorized according to the program rules as long as all of the following are true:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"p\", {\n    parentName: \"li\"\n  }, \"Losses or other negative effects of the attack are inflicted upon Immunefi ecosystem participants (including Immunefi\\u2019s customers) \")), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"p\", {\n    parentName: \"li\"\n  }, \"The additional protocols used must have enough liquidity in various assets to allow the attack to succeed at the time of bug report submission. For example: if an attack requires an ETH flash loan, but the amount is larger than all the ETH available for loan across the ecosystem\"))), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Proof of Concept (PoC) Requirements\")), mdx(\"p\", null, \"A PoC is required for the following severity levels:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"All Smart Contract bug reports\")), mdx(\"p\", null, \"All PoCs submitted must comply with the Immunefi-wide \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules\"\n  }, \"PoC Guidelines and Rules\"), \". Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Other Terms and Information\")), mdx(\"p\", null, \"Bug reports covering previously-discovered bugs are not eligible for the program. If a bug report covers a known issue, it may be rejected, and Immunefi will provide proof that the issue is already known.  \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Reward Payment Terms\")), mdx(\"p\", null, \"Payouts are handled by the Immunefi team directly and are denominated in USD. However, payments are done in USDC\"));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. </p><p>For critical Smart Contract bugs, the reward amount is <strong>10%</strong> of the funds directly affected up to a maximum of <strong>USD 50 000</strong>. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of <strong>USD 10 000</strong> is to be rewarded in order to incentivize security researchers against withholding a bug report.   </p><p>Critical website and application bug reports will be rewarded with <strong>USD 10 000</strong>, only if the impact leads to a direct loss in funds involving an attack that does not require any user action at all. Additionally any impact that leads to “Retrieve sensitive data/files from a running server such as: database passwords,blockchain keys, etc (this does not include non-sensitive environment variables, open source code, or usernames” and to “Execute arbitrary system commands” would be rewarded  USD 10 000 USD, which is 2x the standard amount for Web/App critical impact. All other impacts that would be classified as Critical, or an impact resulting in a theft of funds that does not fall under this definition, would be rewarded <strong>USD 5 000</strong>.</p><p><strong>Repeatable Attack Limitations</strong></p><p>In cases of repeatable attacks for smart contract bugs, only the first attack is considered if the smart contracts where the vulnerability exists can be upgraded, paused, or killed. If the attack impacts a smart contract directly holding funds that cannot be upgraded or paused, the amount of funds at risk will be calculated with the first attack being at 100% of the funds that could be stolen and then a reduction of 25% from the amount of the first attack for every 300 blocks the attack needs for subsequent attacks from the first attack, rounded down. For avoidance of doubt, if a second attack would happen at 600 blocks and then a third at 900 blocks, the funds at risk would be counted at 50% and 25% of the reward from the first attack, respectively.</p><p><strong>Reward Calculation for High Level Reports</strong>\nHigh smart contract vulnerabilities will be capped at up to 100% of the funds affected. In the event of temporary freezing, the reward doubles for every additional 5 blocks that the funds could be temporarily frozen, rounded down to the nearest multiple of 5, up to the hard cap of USD 10 000 USD. </p><p><strong>Restrictions on Security Researcher Eligibility</strong></p><p>Security researchers who fall under any of the following are ineligible for a reward</p><ul><li>Countries that are restricted by OFAC and by UNSC resolutions.</li></ul><p><strong>Public Disclosure of Known Issues</strong></p><p>Bug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. </p><ul><li>Any well-known issues related to Gnosis Safe: <a href=\"https://docs.gnosis-safe.io/learn/security/security-audits\">https://docs.gnosis-safe.io/learn/security/security-audits </a></li></ul><p><strong>Previous Audits</strong>\nImmunefi has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.</p><ul><li>Here’s the <a href=\"https://github.com/immunefi-team/protocol-vaults/blob/main/audits/2023-02-03%20-%20Immunefi%20-%20Internal%20Audit%20of%20the%20Vaults%20system.pdf\">internal audit</a> of the Vaults System </li><li>Here’s the <a href=\"https://github.com/immunefi-team/vaults/blob/main/audits/2023-02-13%20-%20Ourovoros%20Audit.md\">Ourovoros audit</a> of the Vaults System </li></ul><p><strong>Feasibility Limitations</strong></p><p>Bug reports that require an attack that involve one or more other protocols (e.g. utilizing flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be downgrade by one severity level. However, they will be considered as in-scope and categorized according to the program rules as long as all of the following are true:</p><ul><li><p>Losses or other negative effects of the attack are inflicted upon Immunefi ecosystem participants (including Immunefi’s customers) </p></li><li><p>The additional protocols used must have enough liquidity in various assets to allow the attack to succeed at the time of bug report submission. For example: if an attack requires an ETH flash loan, but the amount is larger than all the ETH available for loan across the ecosystem</p></li></ul><p><strong>Proof of Concept (PoC) Requirements</strong></p><p>A PoC is required for the following severity levels:</p><ul><li>All Smart Contract bug reports</li></ul><p>All PoCs submitted must comply with the Immunefi-wide <a href=\"https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules\">PoC Guidelines and Rules</a>. Bug report submissions without a PoC when a PoC is required will not be provided with a reward.</p><p><strong>Other Terms and Information</strong></p><p>Bug reports covering previously-discovered bugs are not eligible for the program. If a bug report covers a known issue, it may be rejected, and Immunefi will provide proof that the issue is already known.  </p><p><strong>Reward Payment Terms</strong></p><p>Payouts are handled by the Immunefi team directly and are denominated in USD. However, payments are done in USDC</p>",
        "scope": {}
      },
      "outOfScopeAndRules": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"These impacts are excluded from the rewards for this bug bounty program. \"), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"All Categories\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts caused by attacks requiring hypothetical access to leaked keys/credentials\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Best practice recommendations\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Feature requests\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts on test files and configuration files unless stated otherwise in the bug bounty program\")), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Smart Contracts\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Incorrect data supplied by third party oracles\", mdx(\"ul\", {\n    parentName: \"li\"\n  }, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Not to exclude oracle manipulation/flash loan attacks\"))), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts requiring basic economic and governance attacks (e.g. 51% attack)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Lack of liquidity impacts\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts from Sybil attacks\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts involving centralization risks\")), mdx(\"p\", null, mdx(\"strong\", {\n    parentName: \"p\"\n  }, \"Web/App\")), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Theoretical impacts without any proof or demonstration\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts involving attacks requiring physical access to the victim device\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts involving attacks requiring access to the local network of the victim\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Reflected plain text injection (e.g. url parameters, path, etc.)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"This does not exclude reflected HTML injection with or without JavaScript\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"This does not exclude persistent plain text injection\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any impacts involving self-XSS\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Captcha bypass using OCR without impact demonstration\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"CSRF with no state modifying security impact (e.g. logout CSRF)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as \\u201Chttponly\\u201D) without demonstration of impact\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts causing only the enumeration or confirmation of the existence of users or tenants\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Lack of SSL/TLS best practices\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts that only require DDoS\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"UX and UI impacts that do not materially disrupt use of the platform\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Impacts primarily caused by browser/plugin defects\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"SPF/DMARC misconfigured records)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Missing HTTP Headers without demonstrated impact\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Automated scanner reports without demonstrated impact\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"UI/UX best practice recommendations\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Non-future-proof NFT rendering\")), mdx(\"p\", null, \"The following activities are prohibited by this bug bounty program:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any testing with pricing oracles or third-party smart contracts\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Attempting phishing or other social engineering attacks against our employees and/or customers\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Any denial of service attacks that are executed against project assets\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Automated testing of services that generates significant amounts of traffic\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Public disclosure of an unpatched vulnerability in an embargoed bounty\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, mdx(\"a\", {\n    parentName: \"li\",\n    \"href\": \"https://immunefi.com/rules/\"\n  }, \"Any other actions prohibited by the Immunefi Rules\"), \".\")));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>These impacts are excluded from the rewards for this bug bounty program. </p><p><strong>All Categories</strong></p><ul><li>Impacts requiring attacks that the reporter has already exploited themselves, leading to damage</li><li>Impacts caused by attacks requiring hypothetical access to leaked keys/credentials</li><li>Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible</li><li>Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code</li><li>Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production</li><li>Best practice recommendations</li><li>Feature requests</li><li>Impacts on test files and configuration files unless stated otherwise in the bug bounty program</li></ul><p><strong>Smart Contracts</strong></p><ul><li>Incorrect data supplied by third party oracles<ul><li>Not to exclude oracle manipulation/flash loan attacks</li></ul></li><li>Impacts requiring basic economic and governance attacks (e.g. 51% attack)</li><li>Lack of liquidity impacts</li><li>Impacts from Sybil attacks</li><li>Impacts involving centralization risks</li></ul><p><strong>Web/App</strong></p><ul><li>Theoretical impacts without any proof or demonstration</li><li>Impacts involving attacks requiring physical access to the victim device</li><li>Impacts involving attacks requiring access to the local network of the victim</li><li>Reflected plain text injection (e.g. url parameters, path, etc.)</li><li>This does not exclude reflected HTML injection with or without JavaScript</li><li>This does not exclude persistent plain text injection</li><li>Any impacts involving self-XSS</li><li>Captcha bypass using OCR without impact demonstration</li><li>CSRF with no state modifying security impact (e.g. logout CSRF)</li><li>Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact</li><li>Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces</li><li>Impacts causing only the enumeration or confirmation of the existence of users or tenants</li><li>Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows</li><li>Lack of SSL/TLS best practices</li><li>Impacts that only require DDoS</li><li>UX and UI impacts that do not materially disrupt use of the platform</li><li>Impacts primarily caused by browser/plugin defects</li><li>Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)</li><li>Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)</li><li>SPF/DMARC misconfigured records)</li><li>Missing HTTP Headers without demonstrated impact</li><li>Automated scanner reports without demonstrated impact</li><li>UI/UX best practice recommendations</li><li>Non-future-proof NFT rendering</li></ul><p>The following activities are prohibited by this bug bounty program:</p><ul><li>Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet</li><li>Any testing with pricing oracles or third-party smart contracts</li><li>Attempting phishing or other social engineering attacks against our employees and/or customers</li><li>Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)</li><li>Any denial of service attacks that are executed against project assets</li><li>Automated testing of services that generates significant amounts of traffic</li><li>Public disclosure of an unpatched vulnerability in an embargoed bounty</li><li><a href=\"https://immunefi.com/rules/\">Any other actions prohibited by the Immunefi Rules</a>.</li></ul>",
        "scope": {}
      },
      "assetsBodyV2": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Documentation of the Vaults System can be found \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://github.com/immunefi-team/vaults/blob/main/README.md\"\n  }, \"https://github.com/immunefi-team/vaults/blob/main/README.md \")), mdx(\"p\", null, \"All smart contracts for the new Vaults System can be found at \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://github.com/immunefi-team/vaults\"\n  }, \"https://github.com/immunefi-team/vaults\"), \" \"), mdx(\"p\", null, \"However, only those in the Assets in Scope table are considered as in-scope of the bug bounty program.\"), mdx(\"p\", null, \"Unless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers\"\n  }, \"Reported Subdomain Takeovers\"), \".\"));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>Documentation of the Vaults System can be found <a href=\"https://github.com/immunefi-team/vaults/blob/main/README.md\">https://github.com/immunefi-team/vaults/blob/main/README.md </a></p><p>All smart contracts for the new Vaults System can be found at <a href=\"https://github.com/immunefi-team/vaults\">https://github.com/immunefi-team/vaults</a> </p><p>However, only those in the Assets in Scope table are considered as in-scope of the bug bounty program.</p><p>Unless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about <a href=\"https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers\">Reported Subdomain Takeovers</a>.</p>",
        "scope": {}
      },
      "impactsBody": {
        "compiledSource": "\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.\"), mdx(\"p\", null, \"These accepted impacts are then based on the severity classification system of this bug bounty program. When submitting a bug report, please select the severity level you feel best corresponds to the severity classification system as long as the impact itself is one of the listed items. \"), mdx(\"p\", null, \"If an impact can be caused to any other asset managed by Immunefi that isn\\u2019t on this table but for which the impact is in the Impacts in Scope section below, you are encouraged to submit it for consideration by Immunefi.\"));\n}\n;\nMDXContent.isMDXComponent = true;",
        "renderedOutput": "<p>Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.</p><p>These accepted impacts are then based on the severity classification system of this bug bounty program. When submitting a bug report, please select the severity level you feel best corresponds to the severity classification system as long as the impact itself is one of the listed items. </p><p>If an impact can be caused to any other asset managed by Immunefi that isn’t on this table but for which the impact is in the Impacts in Scope section below, you are encouraged to submit it for consideration by Immunefi.</p>",
        "scope": {}
      }
    },
    "project": {
      "vault": {
        "address": "0xf4a8714f6ca5Bf232F10b308C693448738be0661",
        "chainId": 1,
        "vaultBalance": 9182.31270138321,
        "averageBalance": 9181.442333333332,
        "assets": [
          {
            "balance": "0.0136",
            "symbol": "ETH"
          },
          {
            "balance": "13.5938",
            "symbol": "DAI"
          },
          {
            "balance": "9146.5222",
            "symbol": "USDC"
          }
        ]
      }
    }
  },
  "__N_SSG": true
}
