{
  "pageProps": {
    "bounty": {
      "contentfulId": "2n37W9oO1QpI6LSKaXKDOy",
      "id": "mountainprotocol",
      "slug": "mountainprotocol",
      "project": "Mountain Protocol",
      "maxBounty": 100000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/3GYtNnEVxtN0vEVd3Zf1yH/badeb983eff7a2b09e6f9dbdafed3bba/2p5yqaoJ_400x400.png",
      "launchDate": "2023-08-30T12:00+02:00",
      "endDate": null,
      "updatedDate": "2024-01-03T18:34:45.246Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $50,000 - $100,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $25,000 - $50,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $10,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $50,000 - $100,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "USD $25,000 - $50,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "medium",
          "payout": "USD $10,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "4C3QzIhYlnKU66A06S2PR7",
          "type": "smart_contract",
          "url": "https://etherscan.io/token/0x59D9356E565Ab3A36dD77763Fc0d87fEaf85508C",
          "description": "USDM Smart Contract",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-08-30T12:00+02:00"
        },
        {
          "id": "4OhAg7a2rMRLQA4gTyiYkS",
          "type": "websites_and_applications",
          "url": "https://app.mountainprotocol.com/",
          "description": "Mountain Protocol Platform",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-08-30T12:00+02:00"
        },
        {
          "id": "4n3VI6CprEkOykfCSEkt9I",
          "type": "smart_contract",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2023-10-05T15:28:31.624Z"
        },
        {
          "id": "7JWGRN545opXiSdNPC9epl",
          "type": "websites_and_applications",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2023-10-05T15:28:33.254Z"
        },
        {
          "id": "602QhKz1EVRonKVO1rhcRd",
          "type": "smart_contract",
          "url": "https://etherscan.io/token/0x57f5e098cad7a3d1eed53991d4d66c45c9af7812",
          "description": "wUSDM Smart Contract",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-10-23T09:11:22.006Z"
        }
      ],
      "impacts": [
        {
          "id": "7utBBj0t2HDXpLEoElb6ZG",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "6pTalnHCVQEPhdS1T92p6U",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "76Lp2i0l5y3v0kWhWqlPIz",
          "title": "Protocol insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "kKvfTbEm0nli8XxoLIOQD",
          "title": "Unauthorized interactions with the smart contract that could benefit an attacker or damage Mountain Protocol or its users, including any action behind the access control mechanism such as minting, burning, etc.",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "7nGLYPjLGJ2Ma7yIuYy7ec",
          "title": "Execute arbitrary system commands",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6PeP3oWhESJKizJt8wQ4vC",
          "title": "Retrieve sensitive data/files from a running server such as: /etc/shadow, database passwords, blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "Li21X1jjyI30UIjTSKdRg",
          "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as: Changing registration information, Commenting, Voting, Making trades, Withdrawals, etc.",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "3djMsRQ45jG5OpMSwrPXwQ",
          "title": "Direct theft of user funds",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "52jDmGwgMAKI4OafcMi9Vx",
          "title": "Unauthorized transfer of funds from custody setup to outside EOAs. Demonstration required.",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "44RHjZvaDnI4YvbRZCgVnG",
          "title": "Theft of unclaimed yield (does not include cases where USDM is used in other protocols)",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "4qVSFZV2jHugF95aqeuW8X",
          "title": "Permanent freezing of unclaimed yield",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "6N11Es8GDcDUwfl7MBKBSl",
          "title": "Temporary freezing of funds (more than 24hs)",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "7DzBXcRXjYOvXGGuRCPfBO",
          "title": "Injecting/modifying the static content on the target application without Javascript (Persistent) such as: HTML injection without Javascript, Replacing existing text with arbitrary text, Arbitrary file uploads, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "hLuyx29FjiGHmmVgkCREC",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: Email or password of the victim, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "2bGdkQxSUyon2PZQfZ3krv",
          "title": "Improperly disclosing confidential user information such as: Email address, Phone number, Physical address, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "6vgYohgyBeqch2rMijbCoh",
          "title": "Taking down the application/website",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "3c9m2XOfKFm5VhQsE3q6wr",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "2s7K7mTpcr64di8TuAUqYI",
          "title": "Injecting/modifying the static content on the target application without Javascript (Reflected) such as: Reflected HTML injection, Loading external site data",
          "type": "websites_and_applications",
          "severity": "medium"
        },
        {
          "id": "4s9XumHautPB5AHYhv2SBs",
          "title": "Redirecting users to malicious websites (Open Redirect)",
          "type": "websites_and_applications",
          "severity": "medium"
        }
      ],
      "programOverview": "Mountain Protocol is the issuer of the first regulated and permissionless yield-bearing stablecoin: USDM. \n\nFully backed by US Treasuries, USDM allows stablecoin holders to continue the experience they know with stablecoins like USDT/USDC while earning rewards at or about the  “risk-free” yield that the collateral is generating.\n\nFor more information about Mountain Protocol, please visit [https://www.mountainprotocol.com/ ](https://www.mountainprotocol.com/)\n\nMountain Protocol provides rewards in USDC. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__KYC Requirement__\n\nThe provision of KYC is required to receive a reward for this bug bounty program where the following information will be required to be provided:\n- Government issued ID/passport\n- Proof of residency\n\nKYC information is only required on confirmation of the validity of a bug report.   \n\n__Responsible Publication__\n\nMountain Protocol adheres to category 3: Approval Required. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication ](https://immunefi.com/responsible-publication/)page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nMountain Protocol adheres to the Primacy of Impact for the following severity levels:\n- Smart Contract - Critical\n- Smart Contract - High\n- Smart Contract - Medium\n- Web/App - Critical\n- Web/App - High\n- Web/App - Medium\n\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact. \n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Known Issue Assurance__\n\nMountain Protocol commits to providing Known Issue Assurance to bug submissions through their program. This means that Mountain Protocol will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Immunefi Standard Badge__\n\nMountain Protocol has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-), which is given to projects that adhere to our best practices. \n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\nVulnerabilities are limited to __10%__ of economic damage, taking into account funds at risk and reputation at the team's discretion. However, each severity has a defined maximum and minimum (eg, 50k and 100k for critical).\n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Restrictions on Security Researcher Eligibility__\n\nSecurity researchers who fall under any of the following are ineligible for a reward\n- OFAC sanctioned\n- Sanctioned Persons\n- Politically Exposed Persons\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- Centralization risks (upgrade, blocklisting, reward multiplier, access control, pausing, mint, burn and other functions expected to be done centrally). Access to these functions by other than Mountain Protocol is part of the bounty program.\n- Tokenomics design risks\n\n__Previous Audits__\n\nMountain Protocol has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [https://github.com/mountainprotocol/audits](https://github.com/mountainprotocol/audits)\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Smart Contract - Critical\n- Smart Contract - High\n- Smart Contract - Medium\n- Web/App - Critical\n- Web/App - High\n- Web/App - Medium\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Other Terms and Information__\n\n- This bug bounty program will have a hard cap of USDC 100 000. In the event that multiple bug reports are submitted that exceed this amount, the rewards will be provided on a first come first served basis.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Mountain Protocol team directly and are denominated in USD. However, payments are done in USDC.  \n",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts and Blockchain/DLT__ \n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Best practice recommendations\n\n__Web/App__ \n\n- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n   - This does not exclude reflected HTML injection with or without JavaScript\n   - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass) \n- SPF/DMARC misconfigured records\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "All code of Mountain Protocol can be found at [https://github.com/orgs/mountainprotocol/repositories.](https://github.com/orgs/mountainprotocol/repositories) Documentation for the assets provided in the table can be found at [https://docs.mountainprotocol.com/. ](https://docs.mountainprotocol.com/)\n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers).\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [
          "Stablecoin"
        ],
        "projectType": [
          "Infrastructure"
        ],
        "ecosystem": [
          "ETH"
        ],
        "programType": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "language": [
          "Solidity",
          "JavaScript"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000 - $100,000"
          },
          {
            "level": "High",
            "payout": "USD $25,000 - $50,000"
          },
          {
            "level": "Medium",
            "payout": "USD $10,000"
          }
        ],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000 - $100,000"
          },
          {
            "level": "High",
            "payout": "USD $25,000 - $50,000"
          },
          {
            "level": "Medium",
            "payout": "USD $10,000"
          }
        ]
      },
      "websiteUrl": null,
      "description": "Mountain Protocol is the issuer of the first regulated and permissionless yield-bearing stablecoin: USDM. Fully backed by US Treasuries, USDM allows stablecoin holders to continue the experience they know with stablecoins like USDT/USDC while earning rewards at or about the “risk-free” yield that the collateral is generating.",
      "githubUrl": null,
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "defaultProhibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": null,
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "metaData": {
      "title": "Mountain Protocol Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Mountain Protocol and get paid up to $100,000.",
      "url": "https://immunefi.com/bug-bounty/mountainprotocol",
      "ogImg": "/api/bounty/og-image?project=Mountain+Protocol"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
