{
  "pageProps": {
    "bounty": {
      "contentfulId": "4RCjqBa9IUk5bl9w4QValX",
      "id": "neo",
      "slug": "neo",
      "project": "Neo",
      "maxBounty": 10000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/58geaDlgfAExuX3WhGHYI/3d1a9283f18f6a95528789acd9cfd89c/OCDuOiZ__400x400.png",
      "launchDate": "2022-01-07T04:00:00.000Z",
      "endDate": null,
      "updatedDate": "2024-03-07T11:40:11.154Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "Up to $10,000",
          "pocRequired": false
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "Up to $5,000",
          "pocRequired": false
        },
        {
          "assetType": "blockchain_dlt",
          "level": "medium",
          "payout": "Up to $2,000",
          "pocRequired": false
        },
        {
          "assetType": "blockchain_dlt",
          "level": "low",
          "payout": "Up to $500",
          "pocRequired": false
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "21btOo3h0jPg5kq4VGDc02",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "7CuK6JOuVnXeUdgTgAzsxz",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-vm",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "22r6KHyTHaoZ2pMRPMmQFh",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-compiler",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "1F3780h6koRE9LZX4qzq6e",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-gui",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "6MfLlE77vG7XVUGPFaKbq6",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-devpack-dotnet",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "6HSDPDtK0QDGahIUT6VEWL",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-node",
          "description": null,
          "isPrimacyOfImpact": null
        },
        {
          "id": "2pQdrZVMJdIq7OgnUPMaPG",
          "type": "blockchain_dlt",
          "url": "https://github.com/neo-project/neo-modules",
          "description": null,
          "isPrimacyOfImpact": null
        }
      ],
      "impacts": [
        {
          "id": "5cIyRSXZYk5xBZbmoHuGkT",
          "title": "Issues leading to severe asset loss",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "jzSDVaN4q7uWlZvuLddO9",
          "title": "Issues leading to total network failure",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "7tRVvoiahlSMlGm695KGur",
          "title": "Single node failure",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "y3GacDLll4Xu7OrS34ubR",
          "title": "Any other low (OWASP) issue",
          "type": "blockchain_dlt",
          "severity": "low"
        }
      ],
      "programOverview": "Neo is a distributed network which utilizes blockchain technology and digital identity to digitize assets and automate the management of digital assets using smart contracts. Neo network has two tokens, NEO representing the right to manage Neo blockchain and GAS representing the right to use the Neo Blockchain.\n\nThe purpose of the Neo vulnerability bounty program is to be proactive about blockchain security by providing a channel for security researchers to report potential security vulnerabilities identified related to our underlying infrastructure. Everyone who finds the vulnerabilities can submit a bug report through Immunefi. Neo will try their best to investigate those eligible vulnerabilities and fix the valid issues. All rewards will be paid in the equivalent amount of NEO.\n\nNote: Higher rewards will be paid out in case of vulnerabilities of certain interest and criticality. Before reporting any issues, please check the following disclosures on responsibilities, program rules, and reporting manner notice.\n\nFor more information about Neo, please visit [https://neo.org/](https://neo.org/).  \n\nThis bug bounty program has a different reward timeline than other bug bounty programs on Immunefi, though the 48 hours for acknowledgement is observed. Please check the “Program Rules and Response Terms” section for more information.",
      "prioritizedVulnerabilities": "Vulnerabilities fitting in any of the following descriptions will not be eligible for the rewards:\n  - Those published or known ones are not eligible for rewards.\n  - If you unveil such vulnerabilities before Neo fixes or publish them, the reward becomes null and void.\n  - Participants who use submitted vulnerabilities to damage the Neo ecosystem, infringe on users' interests and perform pilferage on users' assets will be disqualified for rewards; meanwhile, Neo is rightful to resort to justice.",
      "rewardsBody": "Bounties are paid out after a risk assessment ([OWASP risk rating methodology](https://www.owasp.org/index.php/OWASP_Risk_Rating_Methodology)) has been made by the Neo DAU team. There are four rates of severity, Critical, High, Medium, Low. All rewards will be paid in the equivalent amount of NEO. Roughly speaking, we calculate the severity of an issue with the following formula:\n\nSeverity = Impact * Likelihood\nBase bounty amounts related to severity are as follows:\n\n| Vulnerability Severity | Bounty | Example |\n| :-- | :-: | --: |\n| **Critical** | Up to $10,000 | Issues leading to severe asset loss | \n| **High** | Up to $5,000 | Issues leading to total networks failure |\n| **Medium** | Up to $2,000 | Single node failure |\n| **Low** | Up to $500 | Other valid issues |\n\nTo be eligible for a reward, bug bounty hunters must never attempt to access anyone else's data and do not engage in any activity that would be disruptive or damaging to the Neo production network and testing network, you can investigate with your own built private chain on a private network. The full rules of the bug bounty program can be found further below, which need to be followed. \n\nAll bug reports must include the following in the report:\n  - Asset - What software asset the vulnerability is related to (e.g. Neo core software/products)\n  - Severity - Your opinion on the severity of the issue (e.g. high, moderate, low)\n  - Summary - Add a summary of the vulnerability\n  - Description - Any additional details about this vulnerability\n  - Steps - Steps to reproduce, getting Neo staff or technical team clearly informed of every detailed step.\n  - Supporting Material/References - Source code to replicate, list any additional material (e.g. screenshots, logs, etc.)\n  - Impact - What security impact could an attacker achieve?\n  - Your name and country.\n\nNeo may require more KYC information to be submitted over the Immunefi bug reporting dashboard at its discretion.\n\nPayouts are handled by the __Neo__ team directly and are denominated in USD. However, payouts are done in __NEO__.",
      "outOfScopeAndRules": "The level of feedback on its website and social media channels. Rewards will be distributed within three (3) days following the official announcement. Neo reserves the right to the final interpretation of the event.\n\nTo finally achieve the self-worthy reward the submitters should abide by the following event rules:\n  - Only issues related to stability and security with design and implementation are within the scope, vulnerabilities with the Neo website and related infrastructure on the Neo blockchain are out of the scope. Find more details at the Scope of Vulnerability Bounty Program.\n  - Submitted reports should contain detailed reproduction procedures, in the absence of which, the reports will be excluded from the rewarding list. The more detailed the proof of vulnerabilities and the descriptions are, the higher your reward will be.\n  - For those who report the same vulnerability, the reward goes to whoever comes first.\n  - Serial vulnerabilities caused by one vulnerability will be considered as one vulnerability, e.g., a series of computing errors caused by data overflow.",
      "assetsBodyV2": null,
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "L1"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": null,
        "programType": [
          "Blockchain/DLT"
        ],
        "language": [
          "C#"
        ]
      },
      "legacy": {
        "technologies": [
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "Up to $10,000"
          },
          {
            "level": "High",
            "payout": "Up to $5,000"
          },
          {
            "level": "Medium",
            "payout": "Up to $2,000"
          },
          {
            "level": "Low",
            "payout": "Up to $500"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    },
    "metaData": {
      "title": "Neo Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on Neo and get paid up to $10,000.",
      "url": "https://immunefi.com/bug-bounty/neo",
      "ogImg": "/api/bounty/og-image?project=Neo"
    }
  },
  "__N_SSP": true
}
