{
  "pageProps": {
    "bounty": {
      "contentfulId": "lG3Ktd1Sf41pcFoD5VgL1",
      "id": "nodle",
      "slug": "nodle",
      "project": "Nodle",
      "maxBounty": 20000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/2dHrbtjbk5C7vckYIqbQRX/532cce71afec74a039ae37f436709500/FdJ1p02z_400x400.png",
      "launchDate": "2023-05-10T13:00-04:00",
      "endDate": null,
      "updatedDate": "2024-04-08T18:57:31.323Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "USD $10,000 to USD $20,000",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "USD $2,000 to USD $10,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $4,000 to USD $10,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "USD $1,000 to USD $4,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "1Qu5TBkQqwsmW5qVJZub97",
          "type": "blockchain_dlt",
          "url": "https://github.com/nodlecode/chain",
          "description": "Nodle Chain Node",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-05-10T13:00-04:00"
        },
        {
          "id": "7oZbcxLsIA8JegCehgzNVS",
          "type": "websites_and_applications",
          "url": "http://nodle-parachain.api.onfinality.io/public",
          "description": "Eden Parachain Network RPC Endpoint",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-05-10T13:00-04:00"
        },
        {
          "id": "2SLEre5SPRyqRazK4d7Zmx",
          "type": "websites_and_applications",
          "url": "http://nodle-paradis.api.onfinality.io/public",
          "description": "Paradis Parachain Test Network RPC Endpoint",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-05-10T13:00-04:00"
        },
        {
          "id": "54UDdIYfB7DmSUc763hyup",
          "type": "websites_and_applications",
          "url": "http://client.nodle.com",
          "description": "Nodle Web Client",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-05-10T13:00-04:00"
        },
        {
          "id": "4igzYkoVsDxrlJQlHU8eet",
          "type": "blockchain_dlt",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2023-10-05T15:29:18.330Z"
        },
        {
          "id": "3ZJ9vYflSiFOfVvZMznmXU",
          "type": "websites_and_applications",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2023-10-05T15:29:19.968Z"
        }
      ],
      "impacts": [
        {
          "id": "BzuF8JM7Kp7FktHLqqMdA",
          "title": "Network not being able to confirm new transactions (Total network shutdown)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "4yYfZTqs2EeBa2b51KfHWB",
          "title": "Unintended permanent chain split requiring hard fork (Network partition requiring hard fork)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "6U1RHVYdouEHTMKcU63WD7",
          "title": "Direct loss of funds",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "31EYfJVlXrn5dgNQ0VqbYM",
          "title": "Permanent freezing of funds (fix requires hardfork)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "6W7JQs5cr8rS5OjsFM4bPQ",
          "title": "RPC API crash due to a malformatted packet that should return an error to the client. Exceptions include if the attack was triggered due to DNS tampering, denial of service, or exceeding rate limits set by the gateway",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "6TkcpEMzZyk6houz84qPYv",
          "title": "Execute arbitrary system commands",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "2MG03YdG8f8odgkL1IoFbK",
          "title": "Retrieve sensitive data/files from a running server such as: database passwords, blockchain keys, etc (this does not include non-sensitive environment variables, open source code, or usernames)",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "3Ih7LqpawnXiEpRB5KIqy8",
          "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as: Changing registration information, Commenting, Voting, Making trades, Withdrawals, etc.",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "16iS8HDucJifgNBZcPCeHW",
          "title": "Changing the NFT metadata",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "3rp1Gzf0kP2b58qQ1GQb82",
          "title": "Subdomain takeover with already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "6RW6TWLhHJprPnNwURNUAx",
          "title": "Direct theft of user funds",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "24cmxh07QenIkFLAr3v1If",
          "title": "Malicious interactions with an already-connected wallet such as: Modifying transaction arguments or parameters, Substituting contract addresses, Submitting malicious transactions",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "IxSGk81WRXszQygT3w8IO",
          "title": "Direct theft of user NFTs",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "0P7fVR4qnFfwTkfiGJWtf",
          "title": "Injection of malicious HTML or XSS through NFT metadata",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "2KW8IfsqihOQ7EAf95R2dY",
          "title": "Unintended chain split (Network partition)",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "4m6YGwUa6yTZ1Yw7H5MfSp",
          "title": "Injecting/modifying the static content on the target application without Javascript (Persistent) such as: HTML injection without Javascript, Replacing existing text with arbitrary text, Arbitrary file uploads, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "1gUrqcycObXagr7EYKkYvC",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: Email or password of the victim, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "4frbQ1oEsSZeJkatp7ahGR",
          "title": "Improperly disclosing confidential user information such as: Email address, Phone number, Physical address, etc.",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "7rnOpawLBqju5gYGF2mzrb",
          "title": "Subdomain takeover without already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "high"
        }
      ],
      "programOverview": "The Nodle Network is a decentralized wireless network, composed of Nodle Edge Nodes, powered by the Nodle Chain, and the NODL token.\n\nNodle connects the physical world to Web3 by using smartphones as edge nodes. The edge nodes read devices and sensors in the physical world using Bluetooth Low Energy (BLE) and connect that information to the blockchain. Creating a geolocation-based layer one that can be used by many unique applications built for the hyper-connected, mobile-oriented world we live in. Nodle creates an economic model that is secure, private, and scalable.\n\nFor more information about Nodle, please visit [https://www.nodle.com/ ](https://www.nodle.com/) \n\n__For Whitehats:__ It is highly recommended that you review the details of this program in full. Although many Bug Bounty programs have standard terms and conditions, each also has their own unique details that are critical to your success.  \n\nPrior to submitting a report please review the [Immunefi Bug Report Template and Best Practices. ](https://immunefisupport.zendesk.com/hc/en-us/articles/12435277406481-Bug-Report-Template)\n\n__Responsible Publication__\n\nNodle adheres to category Publication Category 3: Approval Required. This Policy determines what information whitehats are allowed to make public from their submitted vulnerabilities. For more information about the category selected, please refer to our Responsible Publication page.\n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bounty program. All other impacts are considered out-of-scope and ineligible for payout.",
      "rewardsBody": "Please review how rewards are distributed based on the [Immunefi Vulnerability Severity Classification System V2.2](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-2). This is a simplified 5-level scale system with separate scales for Smart Contracts and Websites/Apps.\n\nRewards for critical Blockchain/DLT vulnerabilities are further capped at 10% of the funds at risk. In cases of repeatable attacks, only the first attack is considered unless the smart contract cannot be upgraded or paused.  However, there is a minimum reward of USD 10 000 for Critical Blockchain/DLT bug reports.\n\nRewards for high Blockchain/DLT vulnerabilities are further capped at 100% of the funds at risk. In cases of repeatable attacks, only the first attack is considered unless the smart contract cannot be upgraded or paused.  However, there is a minimum reward of USD 2 000 for High Blockchain/DLT bug reports.\n\nRewards for critical web/app vulnerabilities will be further capped at 10% of direct funds at risk if the bug discovered is exploited. However, there is a minimum reward of USD 4 000.\n\nHigh web/app vulnerabilities will be further capped at up to 100% of the funds affected. However, there is a minimum reward of USD 1 000.\n\n__Payouts and Payout Requirements__\n\nPayouts are handled by the Nodle team directly and are denominated in USD. However, payouts are done in NODL, and will be converted to a USD value at the time of bounty acceptance. Nodle commits to honoring payouts according to the terms set out in this program at the time of report submission, and to treat this program as the agreement and source of truth concerning bug reports and responsible disclosures. \n\nFor the purposes of determining report validity, this is a Primacy of Impact program. \n\nLearn more about report validity best practices here: [Best Practice - Primacy of Impact vs Primacy of Rules. ](https://immunefisupport.zendesk.com/hc/en-us/articles/12340245635089-Best-Practices-Primacy-of-Impact)\n\n__KYC Requirements__\n\nNodle __does__ have a Know Your Customer (KYC) requirement for bounty payouts. \n\nKYC Info Required:\n- ID Scan\n- Self Portrait\n\nKYC information is only required on confirmation of the validity of a vulnerability report.   \n\n__Audit Discoveries and Known Issues__\n\nVulnerability reports covering previously-discovered are not eligible for any reward through this bounty program. If a report covers a known issue, it may be rejected together with proof of the issue being known before escalation of the vulnerability report via Immunefi. \n\nPrevious audits and known issues can be found at:\n\n- Upstream reports to[ Parity Technologies](https://github.com/paritytech/polkadot/issues?q=label%3AI2-security), for Polkadot or related projects\n(Blockchain/DLT/Web/API)\n- Upstream reports made to [OnFinality](https://documentation.onfinality.io/support/onfinality-vulnerability-and-bug-reporting), concerning improper operation of the Nodle hosted Mainnet RPC endpoint (Blockchain/DLT/Web/API)\n- [Substrate Pallet Audit, Halborn, Feb. 2022](https://drive.google.com/file/d/1p9MEqpqxUPNflOUSI0qw-c7wZ4CbWiBp/view) (Blockchain/DLT)\n- [Secfault Security, Substrate Chain Audit, July 2020 ](https://drive.google.com/file/d/1POiYpYuh0iQ669K-3y4jn_LoTJ4Ge52N/view)(Blockchain/DLT)\n- [Quantstamp Security Assessment Certificate, Sept. 2020](https://drive.google.com/file/d/1niLWDIE26ZLNdjHLiLgOxvw5HV0CQwpv/view) (Blockchain/DLT)\n",
      "outOfScopeAndRules": "The following impacts and attack vectors are excluded from rewards by default for all Immunefi bounty programs: \n\n- Attacks that the reporter has already exploited themselves, leading to damage\n- Attacks requiring access to leaked keys/credentials\n- Attacks requiring access to privileged addresses (governance, strategist), except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Broken link hijacking is out of scope\n\n__Smart Contracts and Blockchain/DLT__\n\n- Basic economic governance attacks (e.g. 51% attack)\n- Lack of liquidity\n- Best practice critiques\n- Sybil attacks\n- Centralization risks\n\n__Websites and Apps__\n\n- Theoretical impacts without any proof or demonstration\n- Content spoofing / Text injection issues\n- Self-XSS\n- Captcha bypass using OCR\n- CSRF with no security impact (logout CSRF, change language, etc.)\n- Missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”)\n- Server-side information disclosure such as IPs, server names, and most stack traces\n- Vulnerabilities used to enumerate or confirm the existence of users or tenants\n- Vulnerabilities requiring unlikely user actions\n- URL Redirects (unless combined with another vulnerability to produce a more severe vulnerability)\n- Lack of SSL/TLS best practices\n- Attacks involving DDoS\n- Attacks requiring privileged access from within the organization\n- SPF records for email domains\n- Feature requests\n- Best practices\n\n| Category     | Additional specific vulnerabilities and/or attacks to exclude     |\n| ---------- | ---------- |\n| Website & Application       | Attacks with the potential to disrupt other customers of a shared web hosting environment, such as Vercel.       |\n| Website & Application       | Attacks that purposefully access account-related data that belongs to another user, and was not created for explicit purposes of security investigation.       |\n| Blockchain/DLT       | Attacks with the potential to disrupt other customers of a shared  hosting environment OnFinality.       |\n| Blockchain/DLT       | Attacks that purposefully access account-related data that belongs to another user, and was not created for explicit purposes of security investigation.       |\n| Blockchain/DLT       | Vulnerabilities affecting third-party services used by Nodle such as OnFinality       |\n\n__Prohibited Activities:__\n\nThe following activities are prohibited by this bounty program. Violation of these rules can result in a temporary suspension or permanent ban from the Immunefi platform at the sole discretion of the Immunefi team, which may also result in: 1) the forfeiture and loss of access to all submissions, and 2) zero payout. \n\nPlease note that Immunefi has no tolerance for spam/low-quality/incomplete reports, “beg bounty” behavior, and misrepresentation of assets and severity. Immunefi exists to protect the global crypto community, not facilitate grift.\n\nProhibited: \n\n- Any testing with mainnet or public testnet deployed code; all testing should be done on private testnets\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules.](https://immunefi.com/rules/) These rules are subject to change at any time.  ",
      "assetsBodyV2": "Impacts only apply to assets in active use by the project like contracts on mainnet or web/app assets used in production. Any impact that applies to assets not in active use, like test or mock files, are out-of-scope of the bounty program unless explicitly mentioned as in-scope. \n\n__Blockchain/DLT__ \n\n- __Blockchain/DLT - PoC__, Blockchain/DLT vulnerability reports are to include a runnable Proof of Concept (PoC) in order to prove impact.  \n- For more information on PoCs please visit: Proof of Concept (PoC) Guidelines and Rules\n- The list of all deployed code can be found at: [https://github.com/nodlecode/chain](https://github.com/nodlecode/chain)\n\n__Web/App__ \n\n- __Web/App__ - Vulnerability reports are to include a runnable Proof of Concept (PoC) in order to prove impact. \n\nAll web/app vulnerability reports must come with a PoC with an end-effect impacting an asset-in-scope in order to be considered for a reward. All PoC content must adhere to the [PoC guidelines and rules of Immunefi.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) In the event that a PoC requires an attack on a web/app asset provided, they must still adhere to the rules provided, otherwise eligibility for a reward may be revoked. \n\n- For more information on PoCs please visit: [Proof of Concept (PoC) Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules)\n\nWhitehats are highly encouraged to review any potential subdomains and what specific port(s) are in scope. Even though the domain may be the same, different ports may point to different assets.  \n\n__Dev Environment and Documentation:__\n\nNodle has included dev documentation and/or instructions to help in reviewing code and exploring for vulnerabilities:\n\n__Dev or Staging Environment Links:__\n- [https://docs.nodle.com/docs/nodle-chain/introduction](https://docs.nodle.com/docs/nodle-chain/introduction)\n\n__Impacts to other assets:__\n\nHackers are encouraged to submit issues outside of the outlined Impacts and Assets in Scope. \n\nIf whitehats can demonstrate a critical impact on code in production for an asset not in scope, Noodle encourages you to submit your report using the “primacy of impact exception” asset. \n\n__Impacts in Scope__\n\n(For Blockchain/DLTR and Smart Contracts Only) This program is considered to be governed by Primacy of Impact. For more information on what this means visit: [Best Practice - Primacy of Impact vs Primacy of Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/12340245635089-Best-Practices-Primacy-of-Impact) \n\nImpacts are based on the [Immunefi Vulnerability Severity Classification System V2.2.](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-2/)\n\nAt Immunefi, we classify vulnerabilities on a simplified 5-level scale:\n- Critical\n- High\n- Medium\n- Low\n- None\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [
          "L1"
        ],
        "projectType": [
          "Infrastructure"
        ],
        "ecosystem": [
          "Polkadot"
        ],
        "programType": [
          "Blockchain/DLT",
          "Websites and Applications"
        ],
        "language": [
          "Rust"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Websites and Applications",
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "USD $10,000 to USD $20,000"
          },
          {
            "level": "High",
            "payout": "USD $2,000 to USD $10,000"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $4,000 to USD $10,000"
          },
          {
            "level": "High",
            "payout": "USD $1,000 to USD $4,000"
          }
        ]
      },
      "websiteUrl": null,
      "description": "The Nodle Network is a decentralized wireless network, composed of Nodle Edge Nodes, powered by the Nodle Chain, and the NODL token.",
      "githubUrl": null,
      "feasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "prohibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": "category_3",
      "knownIssues": [],
      "knownIssueAssurance": false,
      "outOfScopeBlockchain": null,
      "outOfScopeGeneral": null,
      "outOfScopeSmartContract": null,
      "outOfScopeWebAndApplications": null,
      "defaultOutOfScopeBlockchain": null,
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": null,
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": null,
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Polkadot",
      "rewardsToken": "NODL",
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {
        "medianResponseTimeInMinutes": 1006,
        "totalPaidAmount": 2000
      }
    },
    "metaData": {
      "title": "Nodle Bug Bounties",
      "description": "Find bugs and vulnerabilities on Nodle and get paid up to $20,000.",
      "url": "https://immunefi.com/bug-bounty/nodle",
      "ogImg": "/api/bounty/og-image?project=Nodle"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
