{
  "pageProps": {
    "bounty": {
      "contentfulId": "57JufLmAOWJ1B4bKjX5ZWa",
      "id": "sei",
      "slug": "sei",
      "project": "Sei",
      "maxBounty": 500000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/1lOFdVmQG8KNmJhGtr8lhs/40400407c90b0736a8e506b081b70887/Sei_Labs_Logo.png",
      "launchDate": "2023-11-30T09:00:00.000Z",
      "endDate": null,
      "updatedDate": "2024-11-29T12:32:32.233Z",
      "kyc": true,
      "rewards": [
        {
          "id": 8607,
          "assetType": "blockchain_dlt",
          "severity": "critical",
          "rewardModel": "range",
          "maxReward": 500000,
          "minReward": 50000,
          "rewardCalculationPercentage": 0
        },
        {
          "id": 8608,
          "assetType": "blockchain_dlt",
          "severity": "high",
          "rewardModel": "fixed",
          "fixedReward": 25000
        },
        {
          "id": 8609,
          "assetType": "blockchain_dlt",
          "severity": "medium",
          "rewardModel": "fixed",
          "fixedReward": 5000
        },
        {
          "id": 8610,
          "assetType": "blockchain_dlt",
          "severity": "low",
          "rewardModel": "fixed",
          "fixedReward": 1000
        },
        {
          "id": 8611,
          "assetType": "websites_and_applications",
          "severity": "critical",
          "rewardModel": "range",
          "maxReward": 100000,
          "minReward": 25000,
          "otherImpactMaxReward": 0
        },
        {
          "id": 8612,
          "assetType": "websites_and_applications",
          "severity": "high",
          "rewardModel": "fixed",
          "fixedReward": 25000
        },
        {
          "id": 8613,
          "assetType": "websites_and_applications",
          "severity": "medium",
          "rewardModel": "fixed",
          "fixedReward": 5000
        },
        {
          "id": 8614,
          "assetType": "websites_and_applications",
          "severity": "low",
          "rewardModel": "fixed",
          "fixedReward": 1000
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "YnqcLKug1avYOe95M4ZhL",
          "type": "blockchain_dlt",
          "url": "https://github.com/sei-protocol/sei-chain",
          "description": "Sei Chain",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "3ZS1AMENbQIEM7eXCxDu5A",
          "type": "blockchain_dlt",
          "url": "https://github.com/sei-protocol/sei-cosmos",
          "description": "Sei Cosmos",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "4wbWULGL7UIC7N5x9kSxK1",
          "type": "blockchain_dlt",
          "url": "https://github.com/sei-protocol/sei-tendermint",
          "description": "Sei Tendermind",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "2wrRhb8dSNSLq0rinZUazP",
          "type": "websites_and_applications",
          "url": "https://github.com/sei-protocol/sei-js",
          "description": "Sei js",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "6bSbYvVwCostRtSI7JMAUK",
          "type": "websites_and_applications",
          "url": "https://app.sei.io/bridge",
          "description": "Bridge",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "4rkXEZVfilz4g1lhMFOLSn",
          "type": "websites_and_applications",
          "url": "https://app.sei.io/",
          "description": "Sei App",
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "5lom3YOjSOpAtEDa2PSFbe",
          "type": "blockchain_dlt",
          "url": "https://immunefi.com/",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "BoOLecE2IEydcPdM7zjHN",
          "type": "websites_and_applications",
          "url": "https://immunefi.com/",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "isSafeHarbor": null,
          "addedAt": "2023-11-30T09:00:00.000Z"
        },
        {
          "id": "1uIkdc4TQaQ0dOsfsGPAYp",
          "type": "blockchain_dlt",
          "url": "https://github.com/sei-protocol/go-ethereum",
          "description": null,
          "isPrimacyOfImpact": null,
          "isSafeHarbor": null,
          "addedAt": "2024-05-31T13:43:02.396Z"
        }
      ],
      "impacts": [
        {
          "id": 12,
          "type": "blockchain_dlt",
          "severity": "low",
          "title": "Shutdown of greater than 10% or equal to but less than 30% of network processing nodes without brute force actions, but does not shut down the network"
        },
        {
          "id": 13,
          "type": "blockchain_dlt",
          "severity": "low",
          "title": "Modification of transaction fees outside of design parameters"
        },
        {
          "id": 4556,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Changing details of other users (including modifying browser local storage) without already-connected wallet interaction and with significant user interaction such as: Iframing leading to modifying the backend/browser state (demonstrate impact with PoC)"
        },
        {
          "id": 4557,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Taking over broken or expired outgoing links such as: Social media handles, etc."
        },
        {
          "id": 4558,
          "type": "websites_and_applications",
          "severity": "low",
          "title": "Temporarily disabling user to access target site, such as: Locking up the victim from login, Cookie bombing, etc."
        },
        {
          "id": 5,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "Unintended chain split (network partition)"
        },
        {
          "id": 6,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "Temporary freezing of network transactions by delaying one block by 500% or more of the average block time of the preceding 24 hours beyond standard difficulty adjustments"
        },
        {
          "id": 7,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "Causing network processing nodes to process transactions from the mempool beyond set parameters"
        },
        {
          "id": 4559,
          "type": "blockchain_dlt",
          "severity": "high",
          "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer"
        },
        {
          "id": 4560,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Injecting/modifying the static content on the target application without Javascript (Persistent) such as: HTML injection without Javascript, Replacing existing text with arbitrary text, Arbitrary file uploads, etc."
        },
        {
          "id": 4561,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: Email or password of the victim, etc."
        },
        {
          "id": 4562,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Improperly disclosing confidential user information such as: Email address, Phone number, Physical address, etc."
        },
        {
          "id": 49,
          "type": "websites_and_applications",
          "severity": "high",
          "title": "Subdomain takeover without already-connected wallet interaction"
        },
        {
          "id": 9,
          "type": "blockchain_dlt",
          "severity": "medium",
          "title": "Increasing network processing node resource consumption by at least 30% without brute force actions, compared to the preceding 24 hours"
        },
        {
          "id": 10,
          "type": "blockchain_dlt",
          "severity": "medium",
          "title": "Shutdown of greater than or equal to 30% of network processing nodes without brute force actions, but does not shut down the network"
        },
        {
          "id": 11,
          "type": "blockchain_dlt",
          "severity": "medium",
          "title": "A bug in the respective layer 0/1/2 network code that results in unintended smart contract behavior with no concrete funds at direct risk"
        },
        {
          "id": 4563,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Changing non-sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: Changing the name of user, Enabling/disabling notifications"
        },
        {
          "id": 4564,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Injecting/modifying the static content on the target application without Javascript (Reflected) such as: Reflected HTML injection, Loading external site data"
        },
        {
          "id": 52,
          "type": "websites_and_applications",
          "severity": "medium",
          "title": "Redirecting users to malicious websites (open redirect)"
        },
        {
          "id": 1,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Network not being able to confirm new transactions (total network shutdown)"
        },
        {
          "id": 2,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Unintended permanent chain split requiring hard fork (network partition requiring hard fork)"
        },
        {
          "id": 3,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Direct loss of funds"
        },
        {
          "id": 4565,
          "type": "blockchain_dlt",
          "severity": "critical",
          "title": "Permanent freezing of funds (fix requires hard fork)"
        },
        {
          "id": 35,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Execute arbitrary system commands"
        },
        {
          "id": 4566,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Retrieve sensitive data/files from a running server such as: /etc/shadow, database passwords, blockchain keys (this does not include non-sensitive environment variables, open source code, or usernames)"
        },
        {
          "id": 37,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Taking down the application/website"
        },
        {
          "id": 4567,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as: Changing registration information, Commenting, Voting, Making trades, Withdrawals, etc."
        },
        {
          "id": 41,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Subdomain takeover with already-connected wallet interaction"
        },
        {
          "id": 42,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Direct theft of user funds"
        },
        {
          "id": 4568,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Malicious interactions with an already-connected wallet such as: Modifying transaction arguments or parameters, Substituting contract addresses, Submitting malicious transactions"
        },
        {
          "id": 44,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Direct theft of user NFTs"
        },
        {
          "id": 4569,
          "type": "websites_and_applications",
          "severity": "critical",
          "title": "Injection of malicious HTML or XSS through NFT metadata"
        }
      ],
      "programOverview": "Sei is the fastest Layer 1 blockchain, designed to scale with the industry.\n\nFor more information about Sei Foundation, please visit [https://www.sei.io/.](https://www.sei.io/)\n\nSei Foundation provides rewards in SEI, or USDT/C at the foundation's discretion. This is denominated in USD. For more details about the payment process, please view the Rewards by Threat Level section further below.  \n\nSei Foundation has a Know Your Customer (KYC) requirement for bug bounty payouts. \n\nPlease refer to the following for KYC requirements:\n- Full Name\n- Date of birth\n- Proof of address (either a redacted bank statement with address or a recent utility bill)\n- Copy of passport or other government issued ID\n\n\n__Primacy of Impact vs Primacy of Rules__\n\nSei Foundation adheres to the Primacy of Impact for the following impacts:\n- Web/App: Critical: Execute arbitrary system commands\n- Web/App: Critical: Retrieve sensitive data/files from a running server such as:\n   - /etc/shadow\n   - database passwords\n   - blockchain keys\n- Web/App: Critical: Taking down the application/website\n- Web/App: Critical: Taking state-modifying authenticated actions (with or without blockchain state interaction) on behalf of other users without any interaction by that user, such as:\n   - Changing registration information\n   - Commenting\n   - Voting\n   - Making trades\n   - Withdrawals, etc.\n- Web/App: Critical: Subdomain takeover with already-connected wallet interaction\n- Web/App: Critical: Direct theft of user funds\n- Web/App: Critical: Malicious interactions with an already-connected wallet such as:\n   - Modifying transaction arguments or parameters\n   - Substituting contract addresses\n   - Submitting malicious transactions\n\nIf an impact is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact.\n\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\nSei Foundation adheres to the Primacy of Impact for the following severity levels:\n- Blockchain/DLT: Critical\n\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact. \n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Known Issue Assurance__\n\nSei Foundation commits to providing Known Issue Assurance to bug submissions through their program. This means that Sei Foundation will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms. \n\n__Immunefi Standard Badge__\n\nSei Foundation has satisfied the requirements for the [Immunefi Standard Badge,](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-) which is given to projects that adhere to our best practices.",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Blockchain/DLT bugs, the reward is dependent on the ratio between the funds at risk,  which includes all affected projects on top of the respective blockchain/DLT, and the market cap according to the average between CoinMarketCap.com and CoinGecko.com calculated at the time the bug report is submitted. However, a minimum reward of USD $50,000 is to be rewarded in order to incentivize security researchers against withholding on a bug report.\n\nThis ratio is known as the “risk ratio”, i.e.: Risk Ratio = Funds at Risk / Sei Foundation Market Cap\n\nThe reward is then calculated linearly from 0:1 to 1:1, where 1:1 results in a reward of USD $500,000. In the event of where the funds at risk are greater than the market cap, the maximum reward remains as the hard cap.\n\nFor critical Blockchain/DLT bugs w/ no funds affected, Sei Foundation will pay a flat rate of $50,000 USD per bug report. This flat rate will be applied to the following impacts:\n- Network not being able to confirm new transactions (Total network shutdown)\n- Unintended permanent chain split requiring hard fork (Network partition requiring hard fork)\n\nFor critical web/apps vulnerabilities, bug reports will be rewarded with USD $100,000, only if the impact leads to:\n- A loss of funds involving an attack that does not require any user action at all\n- Unauthorized minting of tokens on-chain\n- Private key or private key generation leakage leading to unauthorized access to user funds \n\nAll other impacts that would be classified as Critical would be rewarded a flat amount of USD $25,000. The rest of the severity levels are paid out according to the Impact in Scope table.  \n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack is considered if the smart contracts where the vulnerability exists can be upgraded, paused, or killed. If the attack impacts a smart contract directly holding funds that cannot be upgraded or paused, the amount of funds at risk will be calculated with the first attack being at 100% of the funds that could be stolen and then a reduction of 25% from the amount of the first attack for every 300 blocks the attack needs for subsequent attacks from the first attack, rounded down. For avoidance of doubt, if a second attack would happen at 600 blocks and then a third at 900 blocks, the funds at risk would be counted at 50% and 75% of the reward from the first attack, respectively.\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n- User Would Lose Control Of The Deposit Funds In Limit Order When Unsuccessful Orders Is Returned From The WASM Contract\n- Project operation risk in tokenfactory and dex module\n\n__Previous Audits__\n\nSei Foundation has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n- [https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-15%20Audit%20Report%20-%20Sei%20Cosmos%20v1.0.pdf](https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-15%20Audit%20Report%20-%20Sei%20Cosmos%20v1.0.pdf)\n- [https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-15%20Audit%20Report%20-%20Sei%20Tendermint%20v1.0.pdf](https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-15%20Audit%20Report%20-%20Sei%20Tendermint%20v1.0.pdf)\n- [https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-19%20Audit%20Report%20-%20Sei%20Chain%20and%20CosmWasm%20v1.0.pdf](https://github.com/oak-security/audit-reports/blob/master/Sei/2023-05-19%20Audit%20Report%20-%20Sei%20Chain%20and%20CosmWasm%20v1.0.pdf)\n- [https://drive.google.com/file/d/15yofPol25c05HrhR_MWGuIw01kJPvz1a/view](https://drive.google.com/file/d/15yofPol25c05HrhR_MWGuIw01kJPvz1a/view)\n\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Blockchain/DLT: Critical\n- Blockchain/DLT: High\n- Blockchain/DLT: Medium\n- Blockchain/DLT: Low\n- Web/App: Critical\n- Web/App: High\n- Web/App: Medium\n- Web/App: Low\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\nFor critical reports, we ask that whitehats support a PoC on a local 4-node cluster. You can follow these steps to provide this PoC:\n\n- Spin up the local testnet with `make docker-cluster-start`\n- Connect to node0 with `docker exec -it sei-node-0 /bin/bash`\n- Carry out attack\n\n__Reward Payment Terms__\n\nPayouts are handled by the Sei Foundation team directly and are denominated in USD. However, payments are done in SEI.\n\nSEI is used, it will be the average of closing price from coingecko over 5 days to determine the quantity of SEI to be given.",
      "outOfScopeAndRules": ".",
      "assetsBodyV2": "All code of Sei Foundation can be found at https://github.com/sei-protocol. Documentation for the assets provided in the table can be found at [https://github.com/sei-protocol/sei-chain/blob/main/whitepaper/Sei_Whitepaper.pdf](https://github.com/sei-protocol/sei-chain/blob/main/whitepaper/Sei_Whitepaper.pdf)\n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers.](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers)",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [
          "Bridge",
          "L1",
          "Staking"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": [
          "Sei"
        ],
        "programType": [
          "Blockchain/DLT",
          "Websites and Applications"
        ],
        "language": [
          "Go",
          "Rust"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Websites and Applications",
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "USD $50,000 to USD $500,000"
          },
          {
            "level": "High",
            "payout": "USD $25,000"
          },
          {
            "level": "Medium",
            "payout": "USD $5,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $25,000 to USD $100,000"
          },
          {
            "level": "High",
            "payout": "USD $25,000"
          },
          {
            "level": "Medium",
            "payout": "USD $5,000"
          },
          {
            "level": "Low",
            "payout": "USD $1,000"
          }
        ]
      },
      "websiteUrl": null,
      "description": "Sei is the fastest Layer 1 blockchain, designed to scale with the industry. Pushing the boundaries of blockchain technology through open source development, Sei stands to unlock a brand new design space for consumer facing applications.",
      "githubUrl": null,
      "feasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "prohibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": "category_3",
      "knownIssues": [],
      "knownIssueAssurance": false,
      "defaultOutOfScopeBlockchain": "- Incorrect data supplied by third party oracles\n  - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks",
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": "- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (including, but not limited to: governance and strategist contracts) without additional modifications to the privileges attributed\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n- Impacts requiring phishing or other social engineering attacks against project's employees and/or customers",
      "defaultOutOfScopeWebAndApplications": "- Theoretical impacts without any proof or demonstration\n- Impacts involving attacks requiring physical access to the victim device\n- Impacts involving attacks requiring access to the local network of the victim\n- Reflected plain text injection (e.g. url parameters, path, etc.)\n  - This does not exclude reflected HTML injection with or without JavaScript\n  - This does not exclude persistent plain text injection\n- Any impacts involving self-XSS\n- Captcha bypass using OCR without impact demonstration\n- CSRF with no state modifying security impact (e.g. logout CSRF)\n- Impacts related to missing HTTP Security Headers (such as X-FRAME-OPTIONS) or cookie security flags (such as “httponly”) without demonstration of impact\n- Server-side non-confidential information disclosure, such as IPs, server names, and most stack traces\n- Impacts causing only the enumeration or confirmation of the existence of users or tenants\n- Impacts caused by vulnerabilities requiring un-prompted, in-app user actions that are not part of the normal app workflows\n- Lack of SSL/TLS best practices\n- Impacts that only require DDoS\n- UX and UI impacts that do not materially disrupt use of the platform\n- Impacts primarily caused by browser/plugin defects\n- Leakage of non sensitive API keys (e.g. Etherscan, Infura, Alchemy, etc.)\n- Any vulnerability exploit requiring browser bugs for exploitation (e.g. CSP bypass)\n- SPF/DMARC misconfigured records)\n- Missing HTTP Headers without demonstrated impact\n- Automated scanner reports without demonstrated impact\n- UI/UX best practice recommendations\n- Non-future-proof NFT rendering",
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)",
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Sei",
      "rewardsToken": "SEI",
      "eligibilityCriteria": [
        "no_ofac_sdn",
        "no_official_contributor",
        "no_employee",
        "no_auditor"
      ],
      "eligibilityCriteriaAdditionalInformation": null,
      "programCodebases": [
        {
          "id": 21,
          "title": "Sei Codebase",
          "description": "Github Codebase",
          "url": "https://github.com/sei-protocol"
        }
      ],
      "programDocumentations": [
        {
          "id": 16,
          "title": "Sei Documentation",
          "description": "Github Documentation",
          "url": "https://github.com/sei-protocol/sei-chain/blob/main/whitepaper/Sei_Whitepaper.pdf"
        }
      ],
      "primacy": "primacy_of_impact",
      "newProgramRewardsEnabled": true,
      "premiumTriaging": true
    },
    "project": {
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "metaData": {
      "title": "Sei Bug Bounties",
      "description": "Find bugs and vulnerabilities on Sei and get paid up to $500,000.",
      "url": "https://immunefi.com/bug-bounty/sei",
      "ogImg": "/api/bounty/og-image?project=Sei"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
