{
  "pageProps": {
    "isAttackathon": false,
    "academyContent": null,
    "ethereumAttackathonSponsors": null,
    "project": {
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "bounty": {
      "contentfulId": "2F2vr66ddqM5W8gNaOVw1H",
      "id": "shardeum-core-boost",
      "slug": "shardeum-core-boost",
      "project": "Boost | Shardeum: Core",
      "maxBounty": 500000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/3xrzvSX4v3cZXmp4CuDjMq/4e8e46638a00d31de927c277638a1c4b/Shardeum_Logo_Icon_Light_-_Square__1_.png",
      "launchDate": "2024-07-08T06:00:00.000Z",
      "endDate": "2024-08-14T06:00:00.000Z",
      "updatedDate": "2024-09-25T13:59:31.689Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "blockchain_dlt",
          "level": "critical",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "high",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "medium",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "blockchain_dlt",
          "level": "low",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "5rraVks6nBywfe9KZoGCXO",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/shardus-core/tree/dev",
          "description": "Core [47057]",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-07-08T06:00:00.000Z"
        },
        {
          "id": "1mnBqVGgu6GM3AxojyvK7v",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/shardeum/tree/dev",
          "description": "Validator [22461]",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-07-08T06:00:00.000Z"
        },
        {
          "id": "3Jbo64Pq2Fj9oQQUEJ9mcb",
          "type": "blockchain_dlt",
          "url": "https://github.com/shardeum/lib-crypto-utils/tree/dev",
          "description": "Crypto Utils [863]",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-07-08T06:00:00.000Z"
        },
        {
          "id": "4tWsvn43udFa1Msgr1wEsf",
          "type": "blockchain_dlt",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2024-07-08T06:00:00.000Z"
        }
      ],
      "impacts": [
        {
          "id": "4rp8A9NhGNrU3EDCiLY9AG",
          "title": "Network not being able to confirm new transactions (total network shutdown)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "5NqhzLB74Wt7KvctGJeJVW",
          "title": "Direct loss of funds",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "1G8CwVi93iZL8lfYKh1zJz",
          "title": "Permanent freezing of funds (fix requires hardfork)",
          "type": "blockchain_dlt",
          "severity": "critical"
        },
        {
          "id": "ioLde6bXXZ38teGx2GDzy",
          "title": "Unintended chain split (network partition)",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "3OVul7uuZevL3J189j1sBx",
          "title": "RPC API crash affecting projects with greater than or equal to 25% of the market capitalization on top of the respective layer",
          "type": "blockchain_dlt",
          "severity": "high"
        },
        {
          "id": "22yax2f8gTBGe5XnZxn0wd",
          "title": "Causing network processing nodes to process transactions from the transaction queue beyond set parameters",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "6BQA1Y9rapjZl3MwCGR0Ow",
          "title": "Increasing network processing node resource consumption by at least 30% without brute force actions, compared to the preceding 24 hours",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "7A7twTfdSLpyqmQRvW7WoN",
          "title": "Shutdown of greater than or equal to 30% of network processing nodes without brute force actions, but does not shut down the network",
          "type": "blockchain_dlt",
          "severity": "medium"
        },
        {
          "id": "1hpAwFYObeVr4HaW0ufpSE",
          "title": "Shutdown of greater than 10% or equal to but less than 30% of network processing nodes without brute force actions, but does not shut down the network",
          "type": "blockchain_dlt",
          "severity": "low"
        },
        {
          "id": "22tFsQX4QzxitROBLiQCNq",
          "title": "Modification of transaction fees outside of design parameters",
          "type": "blockchain_dlt",
          "severity": "low"
        }
      ],
      "programOverview": "Shardeum is an EVM-based, linearly scalable network offering low gas fees forever while maintaining true decentralization and (hopefully) solid security. Shardeum is a large project and as such, will be split over two concurrent boosts. This boost, called Core, will cover the Web3 aspects of the project, as well as some internal libs. This will cover three components: Shardus Core, Shardeum Validator, and Crypto Utils library. \n\n[Shardus Core](https://github.com/shardeum/shardus-core/) covers the Layer 1, p2p and consensus protocol. [Shardeum Validator](https://github.com/shardeum/shardeum) is the L2 EVM-compatible distributed application (DApp). Everything here except smart contracts is in scope. Finally, the [crypto utils](https://github.com/shardeum/lib-crypto-utils) library holds wrappers for cryptographic functions used throughout the Shardeum Foundation codebase.\n\nFor more information about Shardeum, please visit [https://shardeum.org/](https://shardeum.org/). \n\nShardeum provides rewards in USDC, denominated in USD.",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "The following reward terms are a summary, for the full details read our [Shardeum | Core Reward Distribution Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/26482360597009-Shardeum-Core-Boost-Reward-Terms). \n\nThe reward pool will be distributed among participants. The size depends on the bugs found:\n- If no High or Critical severity bugs are found the reward pool will be **$250,000 USD**\n- If one or more High severity bugs are found the reward pool will be **$300,000 USD**\n- If 1 Critical severity bug is found the reward pool will be **$400,000 USD**\n- If 2 Critical severity bugs are found the reward pool will be **$450,000 USD**\n- If 4 or more Critical severity bugs are found the reward pool will be **$500,000 USD**\n\nFor this Boost, duplicates and private known issues are valid for a reward. \n\nPrivate known issues will unlock higher reward pools according to their severity level without any downgrade. For example, a Critical severity bug which was a private known issue would unlock the reward pool conditional on a Critical severity bug being found.\n\nRewards are distributed according to the impact of the vulnerability based on the Immunefi [Vulnerability Severity Classification System V2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/). \n\n__Reward Payment Terms__\n\nPayouts are handled by the Shardeum team directly and are denominated in USD. However, payments are done in USDC.\n\nRewards will be distributed all at once based on Immunefi’s distribution formula after the event has concluded and the final bug reports have been resolved.\n\n__Insight Rewards Payment Terms__\n\nInsight Rewards: Portion of the Rewards Pool\n\nThe \"Insight\" severity was introduced on Boost & Attackathon programs to recognize contributions that extend beyond identifying immediate vulnerabilities. Currently, it's not an option to select the Insight severity when submitting a report. However, our team or program will designate it accordingly if applicable. \"Insights\" underscores our commitment to valuing all types of contributions that contribute to a more secure environment and will always be rewarded. [View more information about Insights](https://immunefisupport.zendesk.com/hc/en-us/articles/13333032674961-Severity-Classification-System?utm_source=immunefi).",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories:__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Blockchain/DLT & Smart Contract Specific:__\n\n- Incorrect data supplied by third party oracles\n    - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n\n__Prohibited Activities:__\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty",
      "assetsBodyV2": "Shardeum’s up to date codebase can be found at [https://github.com/shardeum/](https://github.com/shardeum/). \n\nA note on Shardeum and Shardus Core scope: the default config in the dev branch is in scope. Whitehats are free to configure, patch, and modify their own malicious nodes however they want. However, target nodes must be running the default config in dev. This is to prevent the whitehats from wasting time reporting things we specifically allow in debug mode. The only exception is minNodes and maxNodes settings, which allow different size networks to be created. Certain vulnerabilities may only exist in certain network sizes, and we do not wish to limit Whitehat activity and participation for lack of computing power attempting to run a large local network. However, network-wide attacks that only work under 128 nodes may be rejected or reduced in severity at our discretion. If the researchers can enable debug mode options remotely then that is valid and can be paid out.\n\nFinally, the more nodes that are required to launch an attack, the more at risk the vuln is of being downgraded. If it takes 33% (for example) of the nodes in the network being malicious to cause damage, then it becomes difficult to distinguish the impact from a Sybil attack, which is completely out of scope.\n\n__Mid-Contest Code Updates__\n\nIn this contest bug fixes may be applied mid-contest. This is required for Shardeum to test changes on their beta networks in preparation for an imminent mainnet launch.\n\nThe project is to keep changes private as far as possible. When changes need to be made public, then the changelog will be updated here & in the [Shardeum Boost Discord channel](https://discord.com/invite/immunefi?utm_source=immunefi). Publicly fixed bugs are invalid and the scope is updated to the new code.\n\nAll bug reports before the fix was public will earn a reward. All bug reports after are invalid. If a new bug is introduced by their fix then it is valid for a reward.\n\n__Mid-Contest Changelog__\n\n- Error handling for all external endpoints https://github.com/shardeum/shardus-core/commit/82100da75728ea4ef3983fd6439e175201cafc9b \n\n1.12.1 Changelog\n- Updated to use latest shardus/core v2.12.30-68 and archiver v3.4.23\n- Update README.md [#88](https://github.com/shardeum/shardeum/pull/88)\n- Add debug tip to readme [#63](https://github.com/shardeum/shardeum/pull/63)\n- Add note to the readme [#68](https://github.com/shardeum/shardeum/pull/68)\n- BLUE-54 + BLUE-84: Penalty history added, refactoring and recordPenaltyTx fix [#49](https://github.com/shardeum/shardeum/pull/49)\n- GOLD-100: Replace stringify with unified version of fastStableStringify [#37](https://github.com/shardeum/shardeum/pull/37)\n- GREEN-44 add validate NaN points in debug-points endpoint [#27](https://github.com/shardeum/shardeum/pull/27)\n- Improved instructions for using prettier-ignore ([#32](https://github.com/shardeum/shardeum/pull/33)) [#33](https://github.com/shardeum/shardeum/pull/33)\n- add new configuration for formingNodesPerCycle [#39](https://github.com/shardeum/shardeum/pull/39)\n- Gold 93: Fix timestamp bigint floating point error [#36](https://github.com/shardeum/shardeum/pull/36)\n- SYS-172 fix patch files [#31](https://github.com/shardeum/shardeum/pull/31)\n- SEC-364: Put Extra Validation for ClaimReward transaction [#22](https://github.com/shardeum/shardeum/pull/22)\n- Add instructions on how to halt shardeum network and obtain SHM [#18](https://github.com/shardeum/shardeum/pull/18)\n- Link dockerfile to image in GHCR [#20](https://github.com/shardeum/shardeum/pull/20)\n- SEC-119: Adding Extra Validation for contract call [#13](https://github.com/shardeum/shardeum/pull/13)\n- Update links from Gitlab to GitHub [#14](https://github.com/shardeum/shardeum/pull/14)\n- added check for EVM payload [#7](https://github.com/shardeum/shardeum/pull/7)\n\nPOCs should be tested against the most recent changes on the /tree/dev github repo.\n\n__Out of Scope Clauses__\n\n- For [https://github.com/shardeum/shardus-core/](https://github.com/shardeum/shardus-core/), Deprecated.ts, TransactionConsensus.ts, Functionality related to PreCrack, src/snapshot/* are considered to be out of scope.\n- For [https://github.com/shardeum/shardeum](https://github.com/shardeum/shardeum), Automated Access List Generation (AALG) or AALG Warm Up code, Eth-call code, Codebytes, contract storage are considered to be out of scope\n\n__Asset Accuracy Assurance__\n\nBugs found on assets incorrectly listed in-scope will be considered valid and be rewarded.\n\n__Private Known Issues Reward Policy__\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward equal to that of a bug one severity lower.\n\n__Known Issue Assurance__\n\nShardeum commits to providing Known Issue Assurance to bug submissions through their program. This means that Shardeum will either disclose known issues publicly, or at the very least, privately via a self-reported bug submission. \n\nIn a potential scenario of a mediation, this allows for a more objective and streamlined process, in order to prove that an issue is known. Otherwise, assuming the bug report is valid, it would result in the report being considered as in-scope, and due a reward.\n\n__Primacy of Impact vs Primacy of Rules__\n\nShardeum adheres to the Primacy of Impact for all impacts.\n\nPrimacy of Impact means that the impact is prioritized rather than a specific asset. This encourages security researchers to report on all bugs with an in-scope impact, even if the affected assets are not in scope. For more information, please see [Best Practices: Primacy of Impact](https://immunefisupport.zendesk.com/hc/en-us/articles/12340245635089-Best-Practices-Primacy-of-Impact). \n\nWhen submitting a report on Immunefi’s dashboard, the security researcher should select the Primacy of Impact asset placeholder. If the team behind this project has multiple programs, those other programs are not covered under Primacy of Impact for this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nIf the project has any testnet and/or mock files, those will not be covered under Primacy of Impact.\n\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms and conditions set within this program.\n\n__Eligibility Criteria__\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n__Responsible Publication__\n\nWhitehats may publish their bug reports after they have been fixed & paid, or closed as invalid, with the following exceptions:\n- Bug reports in mediation may not be published until mediation has concluded and the bug report is resolved.\n\nImmunefi may publish bug reports submitted to this boosted bug bounty and a leaderboard of the participants and their earnings.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Shardeum has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209-The-Immunefi-Standard-Badge).",
      "impactsBody": "__Proof of Concept (PoC) Requirements__\n\nPOCs should be tested against the most recent changes on the /tree/dev github repo.\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules).\n\n__Whitehat Educational Resources & Technical Info__\n\nArchitecture documents: [https://docs.shardeum.org/docs/architecture/high-level-architecture](https://docs.shardeum.org/docs/architecture/high-level-architecture)\n\n__Is this an upgrade of an existing system? If so, which? And what are the main differences?__\n\nNo, this is fully unique code.\n\n__Where do you suspect there may be bugs?__\n\nOur random functions are uniformly distributed. We would like to know if the random numbers can be manipulated to give attackers a way to influence when their node is moved from standby to active, their node’s ID, and where in the network their node is placed.\n\n__What emergency actions may you want to use as a reason to invalidate or downgrade an otherwise valid bug report?__\n\nThe Validor GUI, the old version. We want to make sure that the bugs are coming into a new version, and not to the old one.\n\n__What external dependencies are there?__\n\nNone other than the libs listed in package.json\n\n__Where might whitehats confuse out-of-scope code to be in-scope?__\n\nOur code relating to precrack may cause confusion. These chunks of code are out of scope for the current bounty. PreCrack functionality is spread around the repository but is clearly labeled with variable and function names.\n\nSince we are doing two concurrent boosts with repositories that interact with each other, the specific boundaries of which vulnerability belongs to which boost may become confusing. A vulnerability may exist in the communication between an archive server and a validator for example. We would like to assure researchers that regardless of the final decision of which boost a particular vulnerability belongs to, the researcher will get paid. We may have final say over where a vuln belongs but the researcher will get their bounty pending the other eligibility factors.\n\n__Are there any unusual points about your protocol that may confuse whitehats?__\n\nThe role of archivers in the Shardeum network is a little different from similar components in other networks. Archivers have no role in a node joining or leaving the network. Archivers have no role in consensus or syncing. They are merely an archive of the history of the network.\n\nWeak subjectivity solutions do not apply to the Shardeum network because long range attacks are not relevant. Shardeum does not have probabilistic finality so there is no risk of a competing chain becoming valid.\n\n__What is the test suite setup information?__\n\nThe simple network test suite: [https://github.com/shardeum/simple-network-test](https://github.com/shardeum/simple-network-test)\nLarger test suite setup: [https://github.com/shardeum/json-rpc-server/tree/localtest/src/__tests__/integration](https://github.com/shardeum/json-rpc-server/tree/localtest/src/__tests__/integration)\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously-discovered bugs are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n\nList of [Shardeum’s Known Issues](https://immunefisupport.zendesk.com/hc/en-us/articles/26510185034641-List-of-Known-Issues-for-Shardeum-Core-and-Shardeum-Ancillaries-Boosts).\n\n__Previous Audits__\n\nShardeum’s completed audit reports can be found here: [Arcadia (draft)](https://docs.google.com/document/d/1OlmijVY2ga_7QEe8DYU-NTEXfAqMRpuwlduIofjmEwA/edit#heading=h.5uoc4mfz7mn4), [HashCloack](https://docs.google.com/document/d/1n11d40JZYgL33-F-Lw6FMuBP9AJSXvyg-xBpJhwOkUE/edit). Any unfixed vulnerabilities  mentioned in these reports are not eligible for a reward.",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [
          "L1"
        ],
        "projectType": [
          "Blockchain"
        ],
        "ecosystem": [
          "Shardeum"
        ],
        "programType": [
          "Blockchain/DLT"
        ],
        "language": [
          "Typescript"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Blockchain/DLT"
        ],
        "blockchain_rewards": [
          {
            "level": "Critical",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "High",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Medium",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Low",
            "payout": "Portion of the Reward Pool"
          }
        ],
        "smartcontract_rewards": [],
        "web_rewards": []
      },
      "evaluationEndDate": "2024-09-25T06:00:00.000Z",
      "boostedIntroStartingIn": "$500,000 USD in rewards is available for finding bugs on Shardeum Core which covers the Layer1, p2p and consensus protocol. All code, except for Shardeum's smart contracts, is in scope\n\nNo KYC is required.\n\nShardeum will respond within 24 hours on weekdays to all bug reports. Any technical questions can be asked directly to the Shardeum technical team on [Immunefi’s Discord](https://discord.com/invite/immunefi) in the \"shardeum-core-boost\" channel.\n\nWhen the Boost has ended, Immunefi will publish an event-specific leaderboard and bug reports from the event.\n\nIn a few days after the launch, Shardeum will give a live technical walkthrough, hosted in the Immunefi Discord. \n\nJoin our Discord for more updates.",
      "boostedIntroLive": "$500,000 USD is available in rewards for finding bugs in Shardeum's codebase of about 70000 nSLOC. There is no KYC required.\n\nShardeum team will respond within 24 hours on weekdays to all bug reports. Any technical questions and support requests can be asked directly to Shardeum or Immunefi in the [Shardeum Boost Discord channel](https://discord.com/invite/immunefi).\n\nIn this contest bug fixes may be applied mid-contest. Further details are in the 'Assets In Scope' section.\n\nWhen the Boost has ended Immunefi will publish an event-specific leaderboard and bug reports from the event.",
      "boostedIntroEvaluating": "",
      "boostedIntroFinished": "Boost cards for security researchers with paid reports are available [here](https://drive.google.com/drive/folders/1ZCyeZlpBzYz-ZgbBQ-IUU_YVVEd_0YUn).\n\nAll paid bug reports are available in original format [here](https://github.com/immunefi-team/Bounty_Boosts/tree/main/Shardeum%20Core).",
      "rewardsToken": "USDC",
      "rewardsPool": 500000,
      "sourceLinesOfCode": 70381,
      "boostedSummaryReport": "https://drive.google.com/file/d/1xv3ZrqHNXi94-39xehlhQt2DFbZdDNmY/view?usp=sharing",
      "inviteOnly": false,
      "hideAssetsInScope": null,
      "boostedLeaderboard": [
        {
          "high": 2,
          "name": "infosec_us_team",
          "critical": 9,
          "earnings": 108385,
          "insights": 0,
          "mediumLow": 3,
          "totalValidBugs": 14
        },
        {
          "high": 0,
          "name": "neplox",
          "critical": 8,
          "earnings": 95054,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 8
        },
        {
          "high": 0,
          "name": "doxtopzhivago",
          "critical": 4,
          "earnings": 82998,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 4
        },
        {
          "high": 0,
          "name": "ZhouWu",
          "critical": 7,
          "earnings": 82501,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 7
        },
        {
          "high": 0,
          "name": "Blockian",
          "critical": 2,
          "earnings": 29153,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "rootrescue",
          "critical": 1,
          "earnings": 20749,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "usmannk",
          "critical": 2,
          "earnings": 18882,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 1,
          "name": "GuplerSaxanoid",
          "critical": 1,
          "earnings": 15987,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "riproprip",
          "critical": 2,
          "earnings": 11807,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "periniondon630",
          "critical": 2,
          "earnings": 8446,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 2
        },
        {
          "high": 0,
          "name": "ret2happy",
          "critical": 0,
          "earnings": 7500,
          "insights": 2,
          "mediumLow": 0,
          "totalValidBugs": 0
        },
        {
          "high": 1,
          "name": "Lastc0de",
          "critical": 0,
          "earnings": 5851,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 1
        },
        {
          "high": 1,
          "name": "anton_quantish",
          "critical": 0,
          "earnings": 5187,
          "insights": 0,
          "mediumLow": 0,
          "totalValidBugs": 1
        },
        {
          "high": 0,
          "name": "gln",
          "critical": 0,
          "earnings": 3750,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 0
        },
        {
          "high": 0,
          "name": "gladiator111",
          "critical": 0,
          "earnings": 3750,
          "insights": 1,
          "mediumLow": 0,
          "totalValidBugs": 0
        }
      ],
      "features": [
        "Boost",
        "Managed Triage: Time Saver"
      ],
      "academyStartDate": null,
      "websiteUrl": null,
      "description": "Shardeum is an EVM-based, linearly scalable network offering low gas fees forever while maintaining true decentralization and (hopefully) solid security. Shardeum is a large project and as such, will be split over two concurrent boosts. This boost, called Core, will cover the Web3 aspects of the project, as well as some internal libs. This will cover three components: Shardus Core, Shardeum Validator, and Crypto Utils library.",
      "githubUrl": null,
      "feasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "prohibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": null,
      "knownIssues": [],
      "knownIssueAssurance": false,
      "outOfScopeBlockchain": null,
      "outOfScopeGeneral": null,
      "outOfScopeSmartContract": null,
      "outOfScopeWebAndApplications": null,
      "defaultOutOfScopeBlockchain": null,
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": null,
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": null,
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "rewardsTokenNetwork": "Ethereum",
      "eligibilityCriteria": [],
      "eligibilityCriteriaAdditionalInformation": null,
      "premiumTriaging": true
    },
    "layoutProps": {
      "headerMarginBottom": "mb-12 lg:mb-16"
    },
    "metaData": {
      "title": "Boost | Shardeum: Core Bug Bounties",
      "description": "Find bugs and vulnerabilities on Boost | Shardeum: Core and get paid up to $500,000.",
      "url": "https://immunefi.com/boost/shardeum-core-boost",
      "ogImg": "/api/bounty/og-image?project=Boost+%7C+Shardeum%3A+Core"
    }
  },
  "__N_SSG": true
}
