{
  "pageProps": {
    "bounty": {
      "contentfulId": "74dp0HUuezNRm2X3rU56ZT",
      "id": "synthetix",
      "slug": "synthetix",
      "project": "Synthetix",
      "maxBounty": 100000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/3GJoatBuqt8RlBr5f1yRa1/6f37cd51feefc6382e47d61e93a612e3/Synthetix-logo.png",
      "launchDate": "2021-03-05T00:00-07:00",
      "endDate": null,
      "updatedDate": "2024-04-08T18:55:28.238Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $10,000 - $100,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $50,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $10,000",
          "pocRequired": false
        },
        {
          "assetType": "websites_and_applications",
          "level": "critical",
          "payout": "USD $3,000 - $30,000",
          "pocRequired": true
        },
        {
          "assetType": "websites_and_applications",
          "level": "high",
          "payout": "USD $10,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "7kD4zenE5mQjRXsv3poQ9u",
          "type": "smart_contract",
          "url": "https://github.com/Synthetixio/synthetix-docs/blob/master/content/addresses.md",
          "description": "V2x",
          "isPrimacyOfImpact": null,
          "addedAt": "2022-05-04T04:37:06.501Z"
        },
        {
          "id": "2DPlTvydIyd0iRonNzsRM5",
          "type": "smart_contract",
          "url": "https://docs.synthetix.io/v/v3/for-developers/addresses-+-abis",
          "description": "V3",
          "isPrimacyOfImpact": null,
          "addedAt": "2022-05-04T04:37:21.862Z"
        },
        {
          "id": "3bFz3DZzP5LrVfFeRGV0UR",
          "type": "smart_contract",
          "url": "https://github.com/Synthetixio/synthetix-v3/tree/v1.0.0-governance",
          "description": "Governance Module",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-07-25T17:14:35.861Z"
        },
        {
          "id": "42BfGBXKmjWtpSOcSizXp0",
          "type": "websites_and_applications",
          "url": "https://github.com/Synthetixio/js-monorepo/tree/master",
          "description": "https://staking.synthetix.io/ and https://github.com/Synthetixio/js-monorepo/tree/master",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-07-25T17:14:33.260Z"
        },
        {
          "id": "5giuxWEZdt1j2r5tF5kaVn",
          "type": "websites_and_applications",
          "url": "https://github.com/Synthetixio/gmv3-interface",
          "description": "https://governance.synthetix.io/",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-07-25T17:14:30.571Z"
        },
        {
          "id": "3jw0wehaZJ3GTsL0r85Hle",
          "type": "websites_and_applications",
          "url": "https://github.com/Synthetixio/synthetix-website",
          "description": "https://synthetix.io/",
          "isPrimacyOfImpact": null,
          "addedAt": "2023-07-25T17:14:27.565Z"
        }
      ],
      "impacts": [
        {
          "id": "6t8Dq1146AnDZDzoAPrh9O",
          "title": "Direct theft of collateral from liquidity providers and borrowers (i.e. staked assets)",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "1y0wxWvLDBlX4MA8vI517B",
          "title": "Direct theft of tokens and NFTs from token and NFT holders (i.e. v3 staking position / sUSD / snxUSD /…)",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "5quICoWhIv0jR3FDmMOL4G",
          "title": "Permanent bricking of staking or trading contracts resulting in losses to owners, where the assets can’t be recovered by any means",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "61ixkYjmUkYGjfc48D7biO",
          "title": "Governance voting result manipulation that could result a critical severity classification",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "7AH42wPHXiUBHYVlYuyQpf",
          "title": "Immediate manipulation of the debt of the protocol,  not related to oracle price changes, nor related to debt fluctuations from interactions that are within the intended design",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "2uVzbgYpw0TS6ixxN75x4u",
          "title": "Immediate protocol Insolvency of liquidity providers",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "WrumhRkJZz8nh1IQ8ZM7n",
          "title": "Theft of unclaimed yield that can be become claimable by the attacker immediately (i.e. swapped to external assets), or claimable after a period of time where the protocol is unable to safeguard the funds at risk via code updates",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "19YqfxWSG9pZNbF1U6J7cW",
          "title": "Execute arbitrary system commands",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "39bicKx5qLo8jSEcCbLHIU",
          "title": "Subdomain takeover with already-connected wallet interaction",
          "type": "websites_and_applications",
          "severity": "critical"
        },
        {
          "id": "4KGeMwenovTLi239bFWqVF",
          "title": "Theft of unclaimed yield that can be become claimable by the attacker within 24 hours of the attack",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "3wJDV49TWFaKQMduVYdpRv",
          "title": "Temporary freezing of funds",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "6sF78AlLfWJKC4THw9U8xP",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "1BM68gw6WFV3ms6bCuVKHo",
          "title": "Insolvency of liquidity providers and generation of bad debt, where the attack spans multiple transactions over an extended period of time",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "47WsL5VyWglTmBqydAGm0n",
          "title": "Governance voting result manipulation that could result a high severity classification",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "N0calyzZPTZGSEf9K58XN",
          "title": "Changing sensitive details of other users (including modifying browser local storage) without already-connected wallet interaction and with up to one click of user interaction, such as: email or password of the victim, etc",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "5NvXYmwATxuxNkARgysR2i",
          "title": "Injecting/modifying the static content on the target application without Javascript (Reflected) such as: reflected HTML injection, loading external site data",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "3Q8R07fnHZiA78rtFj5uyR",
          "title": "Redirecting users to malicious websites (Open Redirect)",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "7GNeyIHvfwq05rZKNH6UC3",
          "title": "Manipulation of the governance voting UI with the intent of luring votes into voting for the wrong candidate",
          "type": "websites_and_applications",
          "severity": "high"
        },
        {
          "id": "46MYSpnthCJ2piBKUzAoTp",
          "title": "Other governance voting result manipulation",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "1kuxSEyCAi7V8DbVPXTa8h",
          "title": "Theft of unclaimed yield that can be become claimable by the attacker",
          "type": "smart_contract",
          "severity": "medium"
        }
      ],
      "programOverview": "Synthetix provides a building layer that allows other protocols to tap into its universal liquidity pool, offering derivative exposure on an EVM compatible chain.\n\nTo be able to offer Synths & Perps trading, Synthetix needs accurate and up-to-date price data for the underlying assets. Synthetix utilizes both Chainlink and the Pyth oracle networks, which provide price information into smart contracts.\n\nResources regarding Synthetix contracts can be found on the [documentation](https://docs.synthetix.io/synthetix-protocol/welcome-to-synthetix) site, where v2x and v3 can be toggled. Both versions are included in the scope of this bug bounty program.\n\nFor more information about Synthetix, please visit [https://synthetix.io/](https://synthetix.io/).\n\nThe Optimism Foundation is excited to announce its latest bug bounty matching program, specifically designed for Synthetix. In collaboration with Immunefi, the Optimism Foundation aims to encourage and incentivize security researchers to find and responsibly disclose vulnerabilities. This will contribute to a safer ecosystem for all Optimism participants involved and showcase the foundation's commitment to security. \n\nTo participate, security researchers should focus on identifying critical and high Synthetix-specific vulnerabilities that could potentially impact the wider Optimism ecosystem. Optimism will match any rewards offered by Synthetix, contributing a total of __52,500 OP tokens__. Please note that OP matching payouts are subject to the total amount of OP tokens left and the price of the OP token on the day of report submission.\n\nSynthetix provides rewards in __USDC__. For more details about the payment process, please view the Rewards by Threat Level section further below.\n\n__Responsible Publication__\n\nSynthetix adheres to __category 3__. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nSynthetix adheres to the Primacy of Rules\n\n__Known Issue Assurance__\n\nSynthetix commits to providing Known Issue Assurance to bug submissions through their program. This means that Synthetix will either disclose known issues publicly or at the very least privately via a self-reported bug submission in order to allow for a more objective and streamlined mediation process to prove that an issue is known. Otherwise, assuming the bug report itself is valid, it would result in the bug report being considered in-scope and due 100% of the reward with respect to the bug bounty program terms.  \n\n__Immunefi Standard Badge__\n\nSynthetix has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-), which is given to projects that adhere to our best practices. ",
      "prioritizedVulnerabilities": "We are especially interested in receiving and rewarding vulnerabilities of the\nfollowing types:\n\n**Smart Contracts/Blockchain:**\n\n- Re-entrancy\n- Logic errors\n  - including user authentication errors\n- Solidity/EVM details not considered\n  - including integer over-/under-flow\n  - including unhandled exceptions\n- Trusting trust/dependency vulnerabilities\n  - including composability vulnerabilities\n- Oracle failure/manipulation\n- Novel governance attacks\n- Economic/financial attacks\n  - including flash loan attacks\n- Congestion and scalability\n  - including running out of gas\n  - including block stuffing\n  - including susceptibility to frontrunning\n- Consensus failures\n- Cryptography problems\n  - Signature malleability\n  - Susceptibility to replay attacks\n  - Weak randomness\n  - Weak encryption\n- Susceptibility to block timestamp manipulation\n- Missing access controls / unprotected internal or debugging interfaces",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Reward Calculation for Critical Level Reports__\n\nFor critical Smart Contract bugs, the reward amount is __10%__ of the funds directly affected up to a maximum of __USD $100,000__. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of __USD $10,000__ is to be rewarded in order to incentivize security researchers against withholding a bug report.   \nFor critical web/app bugs, the reward amount is __10%__ of the funds directly affected up to a maximum of __USD $30,000__. The calculation of the amount of funds at risk is based on the time and date the bug report is submitted. However, a minimum reward of __USD $1,000__ is to be rewarded in order to incentivize security researchers against withholding a bug report.   \n\n__Repeatable Attack Limitations__\n\nIn cases of smart contract vulnerabilities whereby the attacks can be repeated at certain time intervals, if the attack can be stopped by a configuration change, the total value-at-risk from the consecutive attacks is computed by adding up the losses incurred and applying the below discount factors:\n\n| Time Since Attack 1     | Discount Factor     |\n| ---------- | ---------- |\n| 0 to 15 minutes       | 0%       |\n| 15 to 30 minutes       | 25%       |\n| 30 to 60 minutes       | 50%       |\n| 60 to 120 minutes       | 75%       |\n| > 120 minutes       | 100%       |\n\nIf the attack cannot be stopped by configuration changes, the discount factors are adjusted by 50% (i.e. 0% / 12.5% / 25% … ), with the terminal discount factor being 100% at 4 hours (from the initial attack).\n\n__Previous Audits__\n\nSynthetix has provided these completed audit review reports for reference. Any unfixed vulnerability mentioned in these reports are not eligible for a reward.\n  - [https://github.com/Synthetixio/synthetix-docs/blob/master/content/releases.md](https://github.com/Synthetixio/synthetix-docs/blob/master/content/releases.md)\n  -[ https://docs.synthetix.io/v/v3/for-developers/smart-contract-audits](https://docs.synthetix.io/v/v3/for-developers/smart-contract-audits)\n\n__Feasibility Limitations__\n\nBug reports that involve one or more other protocols (e.g. utilising flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be out-of-scope. However, they will be considered within scope and categorised according to the program rules as long as all of the following are true:\n\n  - Losses or other negative effects of the attack are inflicted on users who provide liquidity (whether for staking or trading) directly on contracts managed by Synthetix (i.e. vulnerabilities on the greater Synthetix Ecosystem partners and integrators are out of scope).\n  - The losses or other negative effects could be prevented via changes to contracts that can be updated or modified.\n\nIn case an attack requires use of attackers’ own funds (in order to perform/execute a trade), and requires the attacker taking on economic or financial risk, then a discount is applied on the value-at risk based on the likelihood of an attack succeeding. The likelihood should be estimated by reference to reasonable assessment of the environment at the time of the bug bounty submission or by reference to the PoC. Synthetix has ultimate discretion in providing their opinion on the discount used and the eligibility of such disclosures to be considered within scope of the bounty program.\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n  - Critical\n  - High\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules). Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Reward Payment Terms__\n\nAs part of the bug bounty matching program, Optimism will contribute __52,500 OP__ tokens to match the rewards offered by Synthetix. This means that for every reward paid out by Synthetix to a security researcher, Optimism will provide an additional, matching reward, in OP tokens. The total reward pool for this program is __52,500 OP tokens__. The other 50% of the reward (if applicable for matching) will be paid by __Synthetix__ in __USDC__. \n\nRewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System v. 2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/). This is a simplified 4-level scale. The development of this scale took into consideration multiple factors that may affect a vulnerability and its likelihood of exploitation, but finalizes them largely by the impact that they cause.\n\nThe table below is mostly concerned with the consequence of a successful exploit. Keep in mind that if the exploit requires elevated privileges or uncommon user interaction, the level of the bug may be downgraded to reflect that or rejected. \n\n__Goodwill Payments__ \n\nThis applies to the following severity and asset levels: \n  - Smart Contract - Low\n  - Web/App - Medium\n  - Web/App - Low\n\nSynthetix is willing to offer discretionary “Goodwill Payments” for any bugs that fall under these categories and affect __TVL <$1,000__, \n\nFurthermore, if the value of the assets at risk cannot be estimated, then the bounty payment would be discretionary based on goodwill terms.\n",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program.\n\nThe following vulnerabilities are excluded from the rewards for this bug bounty program:\n\n  - Attacks that the reporter has already exploited themselves, leading to damage\n  - Attacks requiring access to leaked keys/credentials\n  - Attacks requiring access to privileged addresses (governance, strategist)\n\n__Smart Contracts and Web/App__\n\n  - Vulnerabilities that have been already been exploited are considered to be out of scope\n  - Attacks requiring access to leaked keys/credentials\n  - Attacks requiring access to privileged addresses (governance, strategist)\n  - Best practice critiques\n  - Sybil attacks\n  - Any DDOS attack\n  - Attacks that require altering the configurations of the protocol from the time the vulnerability disclosure is submitted (i.e. listing new assets / changing parameters). However, changes in configuration that are staged to be implemented and have been voted on by [governance](https://sips.synthetix.io/) are considered to be in scope.\n  - Security researchers from restricted countries, reference to the [terms](https://staking.synthetix.io/terms/), are not eligible for bounties regardless of the scope of the vulnerability disclosure\n  - Activities that violate the whitehat [rules of engagement](https://immunefi.com/rules/) would result in revocation of the bounty regardless of the disclosure merit.\n\nThe following activities are prohibited by this bug bounty program:\n\n  - Any testing with mainnet or public testnet contracts; all testing should be done on private testnets\n  - Any testing with pricing oracles or third party smart contracts\n  - Attempting phishing or other social engineering attacks against our employees and/or customers\n  - Any testing with third party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n  - Any denial of service attacks\n  - Automated testing of services that generates significant amounts of traffic\n  - Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "Documentation for the assets provided in the table can be found at [https://docs.synthetix.io/synthetix-protocol/readme](https://docs.synthetix.io/synthetix-protocol/readme). \n\nUnless explicitly listed, only pages of the web/app assets in addition to the direct link are considered in-scope of the bug bounty program. Other subdomains are not considered as in-scope. However, for subdomain takeovers that lead to an impact on the in-scope asset, please refer to our page about [Reported Subdomain Takeovers](https://immunefisupport.zendesk.com/hc/en-us/articles/14352199704593-Reported-Subdomain-Takeovers).",
      "impactsBody": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Required"
        ],
        "productType": [
          "DAO",
          "DEX",
          "Perpetuals",
          "Staking",
          "Synthetic Assets"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "Base",
          "ETH",
          "Optimism"
        ],
        "programType": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "language": [
          "Solidity"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $10,000 - $100,000"
          },
          {
            "level": "High",
            "payout": "USD $50,000"
          },
          {
            "level": "Medium",
            "payout": "USD $10,000"
          }
        ],
        "web_rewards": [
          {
            "level": "Critical",
            "payout": "USD $3,000 - $30,000"
          },
          {
            "level": "High",
            "payout": "USD $10,000"
          }
        ]
      },
      "websiteUrl": null,
      "description": "Synthetix provides a building layer that allows other protocols to tap into its universal liquidity pool, offering derivative exposure on an EVM compatible chain.",
      "githubUrl": null,
      "feasibilityLimitations": "The project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\nTherefore, Immunefi has developed a set of feasibility limitation standards which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n- [Chain Rollbacks](https://immunefisupport.zendesk.com/hc/en-us/articles/16913153448721-Chain-Rollbacks)\n- [Pre-Impact Bug Monitoring](https://immunefisupport.zendesk.com/hc/en-us/articles/19430444320401-Pre-Impact-Bug-Monitoring)\n- [Attack Investment Amount](https://immunefisupport.zendesk.com/hc/en-us/articles/17243068885265-Attack-Investment-Amount)\n- [Attacks With A Financial Risk To The Attacker](https://immunefisupport.zendesk.com/hc/en-us/articles/17454897136401-Attacks-With-A-Financial-Risk-To-The-Attacker)\n- [When Is An Impactful Attack Downgraded To Griefing?](https://immunefisupport.zendesk.com/hc/en-us/articles/17455102268305-When-Is-An-Impactful-Attack-Downgraded-To-Griefing)\n",
      "prohibitedActivites": "- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n- [Any other actions prohibited by the Immunefi Rules](https://immunefi.com/rules/)\n",
      "responsiblePublicationCategory": "category_3",
      "knownIssues": [],
      "knownIssueAssurance": false,
      "outOfScopeBlockchain": null,
      "outOfScopeGeneral": null,
      "outOfScopeSmartContract": null,
      "outOfScopeWebAndApplications": null,
      "defaultOutOfScopeBlockchain": null,
      "defaultOutOfScopeSmartContract": null,
      "defaultOutOfScopeGeneral": null,
      "defaultOutOfScopeWebAndApplications": null,
      "defaultProhibitedActivities": null,
      "defaultFeasibilityLimitations": null,
      "customOutOfScopeInformation": null,
      "customProhibitedActivities": [],
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "metaData": {
      "title": "Synthetix Bug Bounties",
      "description": "Find bugs and vulnerabilities on Synthetix and get paid up to $100,000.",
      "url": "https://immunefi.com/bug-bounty/synthetix",
      "ogImg": "/api/bounty/og-image?project=Synthetix"
    },
    "layoutProps": {
      "headerMarginBottom": "mb-3 lg:mb-15",
      "footerMarginTop": "mt-0"
    }
  },
  "__N_SSG": true
}
