{
  "pageProps": {
    "isAttackathon": false,
    "academyContent": null,
    "project": {
      "premiumTriaging": true,
      "isSafeHarborActive": false,
      "performanceMetrics": {}
    },
    "bounty": {
      "contentfulId": "sNhPrMQC7LoDKiXA6kyH3",
      "id": "thundernft-iop",
      "slug": "thundernft-iop",
      "project": "IOP | ThunderNFT",
      "maxBounty": 65000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/4c3zRck4MBUVAaxTaPkUHt/9b1dee6e49c7d39f3b8af56a8b387816/file.png",
      "launchDate": "2024-08-12T11:00:00.000Z",
      "endDate": "2024-09-02T08:00:28.000Z",
      "updatedDate": "2024-08-14T14:39:25.768Z",
      "kyc": false,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "low",
          "payout": "Portion of the Reward Pool",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "1KZMsVuytnQ2BQhMzauQI9",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/asset_manager",
          "description": "Asset Manager - 117",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "3lwL3uhaq9TiTzbRbQ5XnW",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/execution_manager",
          "description": "Execution Manager - 119",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "2rq29mtA3K829SEKTAwvnK",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/execution_strategies/strategy_fixed_price_sale",
          "description": "Strategy - 402",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "5XsBdxtiSH4q6Xr3nEP5lX",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/libraries",
          "description": "Libraries - 324",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "4l1CE2Gh3AwcbRw9dWxZdc",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/pool",
          "description": "Pool - 231",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "3zEIEm0HtGyM4DNKtprsbI",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/royalty_manager",
          "description": "Royalty Manager - 133",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "4F563C2otyz3TMPahbBbZW",
          "type": "smart_contract",
          "url": "https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1/thunder_exchange",
          "description": "Thunder Exchange - 480",
          "isPrimacyOfImpact": null,
          "addedAt": "2024-08-12T11:00:00.000Z"
        },
        {
          "id": "2WeqI22hzhWgBvC9sQ9IXk",
          "type": "smart_contract",
          "url": "https://immunefi.com",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true,
          "addedAt": "2024-08-12T11:00:00.000Z"
        }
      ],
      "impacts": [
        {
          "id": "2vLm8LHvIGmMfGSQV7B0PK",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "1obysHR8Rdw691R7yzEBIH",
          "title": "Direct theft of any user NFTs, whether at-rest or in-motion, other than unclaimed royalties",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "1rgJLlUPjrQr8QiHZ2BMFW",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "74ZU1YBrruY9DHdNJGDbQW",
          "title": "Permanent freezing of NFTs",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3aRYSPVWBsgGz1yeDji37U",
          "title": "Unauthorized minting of NFTs",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "65e6685WiaO0HWKEKeqKve",
          "title": "Predictable or manipulable RNG that results in abuse of the principal or NFT",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "6xEJjoJ1Up5yed33nct5co",
          "title": "Unintended alteration of what the NFT represents (e.g. token URI, payload, artistic content)",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "5zHqmFv7eOBRWqZt9tW9EU",
          "title": "Protocol insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "2SHRGOfkFxBhY9os0VkOBK",
          "title": "Theft of unclaimed royalties",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "1O2j0rk4WkhEDOHoUgd9Ik",
          "title": "Permanent freezing of unclaimed royalties",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "ELDAo1uFxO8GLia9yrlGr",
          "title": "Temporary freezing of funds for at least 1 hour",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "5zaI7fPPujkapUphckgnpP",
          "title": "Temporary freezing of NFTs for at least 1 hour",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "78tlSEqXhIJaZqsxEdg3t2",
          "title": "Smart contract unable to operate due to lack of token funds",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "2Qh94GU1xyBkdUF3dzGca4",
          "title": "Block stuffing",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "KkgOXRYTYvfGIs0YbkGFe",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "7jWbQFNRAvPiPAKlq4PQNj",
          "title": "Theft of gas",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "3CgBoYLTt4z1J2HVWhYS5",
          "title": "Unbounded gas consumption",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "4DJCJZuOyjpHtyuyPNycyN",
          "title": "Contract fails to deliver promised returns, but doesn't lose value",
          "type": "smart_contract",
          "severity": "low"
        }
      ],
      "programOverview": "Thunder is an NFT marketplace on Fuel, L2 on Ethereum that utilizes Fuel VM. Fuel is currently on testnet. For more information, check out [https://fuel.network/](https://fuel.network/)\n\nFor more information about ThunderNFT, please visit [https://thundernft.market/](https://thundernft.market/). \n\nThunderNFT provides rewards in USDC, denominated in USD.",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "The following reward terms are a summary, for the full details read our [ThunderNFT Boost Reward Distribution Terms](https://immunefisupport.zendesk.com/hc/en-us/articles/27472225154577-ThunderNFT-IOP-Boost-Reward-Terms). \n\nA reward pool of $65,000 USD will be distributed among participants, even if no valid bugs are found. \n\nDuplicates and private known issues are valid for a reward.\n\nRewards are distributed according to the impact of the vulnerability based on the [Immunefi Vulnerability Severity Classification System V2.3](https://immunefi.com/immunefi-vulnerability-severity-classification-system-v2-3/).\n\nRewards will be distributed all at once based on Immunefi’s distribution formula after the event has concluded and the final bug reports have been resolved.\n\n__Insight Rewards Payment Terms__\n\nInsight Rewards: Portion of the Rewards Pool\n\n* The \"Insight\" severity was introduced on Boost & Attackathon programs to recognize contributions that extend beyond identifying immediate vulnerabilities. Currently, it's not an option to select the Insight severity when submitting a report. However, our team or program will designate it accordingly if applicable. \"Insights\" underscores our commitment to valuing all types of contributions that contribute to a more secure environment and will always be rewarded. [View more information about Insights](https://immunefisupport.zendesk.com/hc/en-us/articles/13333032674961-Severity-Classification-System?utm_source=immunefi)",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories:__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Impacts relying on attacks involving the depegging of an external stablecoin where the attacker does not directly cause the depegging due to a bug in code\n- Mentions of secrets, access tokens, API keys, private keys, etc. in Github will be considered out of scope without proof that they are in-use in production\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Blockchain/DLT & Smart Contract Specific:__\n\n- Incorrect data supplied by third party oracles\n    - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n\n__Prohibited Activities:__\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty",
      "assetsBodyV2": "ThunderNFT’s up to date codebase can be found at [https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1](https://github.com/ThunderFuel/smart-contracts/tree/main/contracts-v1).\n\n__Whitehat Educational Resources & Technical Info__\n\n**Is this an upgrade of an existing system? If so, which? And what are the main differences?**\n\nThe system takes reference from LooksRare v.1. Kinda an upgrade. Not an exact fork, the architecture logic is a fork. ~50% of it is a fork. Only borrows from LooksRare.\n\nThe big differences are the onchain part, listing/bidding/making offers/etc are all onchain, for LooksRare this is offchain. There is no wETH. Instead it implements a pool similar to Blur.\n\nNFTs on Fuel are native assets on Fuel. Unlike on other marketplaces, NFTs need to be deposited into smart contracts.\n\n**Where do you suspect there may be bugs? Useful aspects of this question are:**\n\n- **Which parts of the code are you most concerned about?**\n- **What attack vectors are you most concerned about?**\n- **Which part(s) of the system do you want whitehats to attempt to break the most?**\n- **Are there any assumed invariants that you want whitehats to attempt to break?**\n\nBugs related to when users need to deposit NFTs into the smart contracts. This is new and could have bugs because of its newness.\n\nThere could be a bug related to the distribution of royalties in the Royalty Manager contract.\n\nMostly concerned about an attack vector in Pool contract where users deposit ETH for bidding. And also, most concerned about Thunder Exchange contract where users deposit their NFTs into this contract for listing.\n\n**What monitoring systems may you want to use as a reason to invalidate or downgrade an otherwise valid bug report?**\n\nNo, ThunderNFT doesn’t rely solely on monitoring, they want to reward bugs for being solved.\n\n**What external dependencies are there?**\n\nSway libraries & standards\n\n**Are there any unusual points about your protocol that may confuse whitehats?**\n\nSway language.\nNFTs as a native assets like ETH. More information on this: https://docs.fuel.network/docs/sway/blockchain-development/native_assets/ \nEvery action on the marketplace is onchain such as listing, offer, cancel listing/offer, etc. which is different from other marketplaces like OpenSea or LooksRare\nFuel Scripts that execute order-book listings & transactions, which bundle many txs into one. Resource on Fuel Scripts: https://docs.fuel.network/docs/sway/sway-program-types/scripts/ \n\n**What is the test suite setup information?**\n\n[https://docs.fuel.network/docs/sway/testing/](https://docs.fuel.network/docs/sway/testing/)\n\n**Public Disclosure of Known Issues**\n\nBug reports covering previously-discovered bugs (listed below) are not eligible for a reward within this program. This includes known issues that the project is aware of but has consciously decided not to “fix”, necessary code changes, or any implemented operational mitigating procedures that can lessen potential risk. \n- In the Thunder Exchange contract, cancel_order function does not revert if the order already cancelled.\n- MakerOrder (an order used for listing/offer) has an expiration range. It may lead to stuck of deposited NFTs. Anything related to expiration of a MakerOrder (e.g. start_time, end_time, setter functions) will be removed later on. All associated reports will be considered as out-of-scope.\n- Contracts outside of the Thunder Exchange cannot interact with the platform’s contract for listing, purchaing, etc. Only Addresses can.\n- `withdraw_all` function  in the pool contract may revert/break. Will be removed. All associated reports will be considered as out-of-scope.\n\n\n**Previous Audits**\n\nThunderNFT did not have any audits to this date. \n\n**Asset Accuracy Assurance**\n\nBugs found on assets incorrectly listed in-scope will be considered valid and be rewarded.\n\n**Private Known Issues Reward Policy**\n\nPrivate known issues, meaning known issues that were not publicly disclosed, are valid for a reward.\n\n**Known Issue Assurance**\n\nThunderNFT commits to providing Known Issue Assurance to bug submissions through their program. This means that ThunderNFT will either disclose known issues publicly, or at the very least, privately via a self-reported bug submission. \n\nIn a potential scenario of a mediation, this allows for a more objective and streamlined process, in order to prove that an issue is known. Otherwise, assuming the bug report is valid, it would result in the report being considered as in-scope, and due a reward.\n\n**Primacy of Impact vs Primacy of Rules**\n\nThunderNFT adheres to the Primacy of Impact for all impacts.\n\nPrimacy of Impact means that the impact is prioritized rather than a specific asset. This encourages security researchers to report on all bugs with an in-scope impact, even if the affected assets are not in scope. For more information, please see [Best Practices: Primacy of Impact](https://immunefisupport.zendesk.com/hc/en-us/articles/12340245635089-Best-Practices-Primacy-of-Impact).\n\nWhen submitting a report on Immunefi’s dashboard, the security researcher should select the Primacy of Impact asset placeholder. If the team behind this project has multiple programs, those other programs are not covered under Primacy of Impact for this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nIf the project has any testnet and/or mock files, those will not be covered under Primacy of Impact.\n\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms and conditions set within this program",
      "impactsBody": "**Proof of Concept (PoC) Requirements**\n\nA PoC, demonstrating the bug's impact, is required for this program and has to comply with the [Immunefi PoC Guidelines and Rules](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules).\n\n**Eligibility Criteria**\n\nSecurity researchers who wish to participate must adhere to the rules of engagement set forth in this program and cannot be:\n- On OFACs SDN list \n- Official contributor, both past or present\n- Employees and/or individuals closely associated with the project \n- Security auditors that directly or indirectly participated in the audit review\n\n__Responsible Publication__\n\nWhitehats may publish their bug reports after they have been fixed & paid, or closed as invalid, with the following exceptions:\n- Bug reports in mediation may not be published until mediation has concluded and the bug report is resolved.\n\nImmunefi may publish bug reports submitted to this boosted bug bounty and a leaderboard of the participants and their earnings.\n\n__Feasibility Limitations__\n\nThe project may be receiving reports that are valid (the bug and attack vector are real) and cite assets and impacts that are in scope, but there may be obstacles or barriers to executing the attack in the real world. In other words, there is a question about how feasible the attack really is. Conversely, there may also be mitigation measures that projects can take to prevent the impact of the bug, which are not feasible or would require unconventional action and hence, should not be used as reasons for downgrading a bug's severity.\n\nTherefore, Immunefi has developed a set of [feasibility limitation standards](https://immunefisupport.zendesk.com/hc/en-us/articles/16913132495377-Feasibility-Limitation-Standards) which by default states what security researchers, as well as projects, can or cannot cite when reviewing a bug report.\n\n__Immunefi Standard Badge__\n\nBy adhering to Immunefi’s best practice recommendations, Ionic has satisfied the requirements for the [Immunefi Standard Badge](https://immunefisupport.zendesk.com/hc/en-us/articles/15006865432209-The-Immunefi-Standard-Badge).",
      "immunefiStandard": true,
      "tags": {
        "general": [
          "Immunefi Standard",
          "KYC Not Required",
          "PoC Required",
          "Primacy of Impact"
        ],
        "productType": [],
        "projectType": [],
        "ecosystem": [
          "Fuel Network"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Sway"
        ],
        "featured": [
          "Launched Recently"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "High",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Medium",
            "payout": "Portion of the Reward Pool"
          },
          {
            "level": "Low",
            "payout": "Portion of the Reward Pool"
          }
        ],
        "web_rewards": []
      },
      "evaluationEndDate": "2024-09-16T08:00:44.000Z",
      "boostedIntroStartingIn": "$65,000 USD in rewards is available for finding bugs on ThundeNFT which is an NFT marketplace built on Fuel. **For this Invite-Only Program, only whitehats who found at least 1 valid report in Fuel's Attackathon can submit reports.**\n\nNo KYC is required.\n\nAny technical questions can be asked directly to the ThunderNFT technical team on [Immunefi’s Discord](https://discord.com/invite/immunefi) in the \"thundernft-iop\" channel.\n\nWhen the Boost has ended, Immunefi will publish an event-specific leaderboard and bug reports from the event.\n\nIn a few days after the launch, ThunderNFT will give a live technical walkthrough.\n\nJoin our Discord for more updates.",
      "boostedIntroLive": "$65,000 USD is available in rewards for finding bugs in ThundeNFT's codebase of 1806 nSLOC. There is no KYC required.\n\nAny technical questions and support requests can be asked directly to ThunderNFT or Immunefi in the [ThunderNFT Boost Discord channel](https://discord.com/invite/immunefi?utm_source=immunefi).\n\nWhen the Boost has ended Immunefi will publish an event-specific leaderboard and bug reports from the event.",
      "boostedIntroEvaluating": "",
      "boostedIntroFinished": "",
      "rewardsToken": "USDC",
      "rewardsPool": 65000,
      "sourceLinesOfCode": 1806,
      "boostedSummaryReport": null,
      "inviteOnly": true,
      "hideAssetsInScope": false,
      "boostedLeaderboard": [],
      "features": [
        "IOP (Invite Only Program)",
        "Managed Triage: Time Saver"
      ],
      "websiteUrl": "https://thundernft.market/",
      "description": "**ThunderNFT's Invite-Only Program is a form of Boost which is exclusively accessible to a select group of security researchers who have submitted at least 1 valid report during Fuel Attackathon event. These researchers will share a flat reward pool for every valid bug found.**",
      "githubUrl": null,
      "defaultFeasibilityLimitations": null,
      "defaultProhibitedActivites": null,
      "responsiblePublicationCategory": null,
      "premiumTriaging": true
    },
    "isBoostedBountiesV3Enabled": true,
    "layoutProps": {
      "headerMarginBottom": "mb-12 lg:mb-16"
    },
    "metaData": {
      "title": "IOP | ThunderNFT Bug Bounties | Immunefi",
      "description": "Find bugs and vulnerabilities on IOP | ThunderNFT and get paid up to $65,000.",
      "url": "https://immunefi.com/boost/thundernft-iop",
      "ogImg": "/api/bounty/og-image?project=IOP+%7C+ThunderNFT"
    }
  },
  "__N_SSG": true
}
