{
  "pageProps": {
    "bounty": {
      "contentfulId": "6KUVG64Ii4XqGFH9l1wN2g",
      "id": "trufin",
      "slug": "trufin",
      "project": "TruFin",
      "maxBounty": 35000,
      "logo": "https://images.ctfassets.net/t3wqy70tc3bv/hETgt4civGLJXlNvVYZma/7403cb0cfe8a42eab0839ff294076017/wDBjgx_c_400x400.jpg",
      "launchDate": "2023-09-27T16:00+02:00",
      "endDate": null,
      "updatedDate": "2024-04-08T18:54:27.496Z",
      "kyc": true,
      "rewards": [
        {
          "assetType": "smart_contract",
          "level": "critical",
          "payout": "USD $35,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "high",
          "payout": "USD $20,000",
          "pocRequired": true
        },
        {
          "assetType": "smart_contract",
          "level": "medium",
          "payout": "USD $4,000",
          "pocRequired": true
        }
      ],
      "audits": null,
      "assets": [
        {
          "id": "6HNEgpSPXBhadzW30CnEuz",
          "type": "smart_contract",
          "url": "https://goerli.etherscan.io/address/0x0ce41d234f5E3000a38c5EEF115bB4D14C9E1c89",
          "description": "The TruStakeMATICv2 contract on Goerli",
          "isPrimacyOfImpact": null
        },
        {
          "id": "4q2o9CMIBMMVgKOrl73j1K",
          "type": "smart_contract",
          "url": "https://github.com/TruFin-io/staking-contracts/blob/main/contracts/matic-staker/contracts/main/TruStakeMATICv2.sol",
          "description": "The TruStakeMATICv2 contract on GitHub",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1Y4gy1UnJxloidE0qV7GXR",
          "type": "smart_contract",
          "url": "https://goerli.etherscan.io/address/0xee05f2455CfE8d5d9090206a84bc69763F0CC1C1",
          "description": "The Whitelist contract on Goerli ",
          "isPrimacyOfImpact": null
        },
        {
          "id": "12xYeQqoeHh25U57ewiSci",
          "type": "smart_contract",
          "url": "https://github.com/TruFin-io/staking-contracts/blob/main/contracts/whitelist/contracts/main/MasterWhitelist.sol",
          "description": "The Whitelist contract on GitHub",
          "isPrimacyOfImpact": null
        },
        {
          "id": "1SWj6WcLd9unsrlHpsNRvk",
          "type": "websites_and_applications",
          "url": "https://immunefi.com/",
          "description": "Primacy of Impact",
          "isPrimacyOfImpact": true
        }
      ],
      "impacts": [
        {
          "id": "2S1n1Q6tHAouPV5oTyP6Gu",
          "title": "Manipulation of governance voting result deviating from voted outcome and resulting in a direct change from intended effect of original results",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "1g2V6Hoojry7mUkflL9aac",
          "title": "Direct theft of any user funds, whether at-rest or in-motion, other than unclaimed yield",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "7aw9IQnp2TuHM0HLODsbeE",
          "title": "Permanent freezing of funds",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "3b0MLzGYU4GV0c6XT8sPRY",
          "title": "Protocol insolvency",
          "type": "smart_contract",
          "severity": "critical"
        },
        {
          "id": "1ToDEElk9WTmfVj62OTQT4",
          "title": "Theft of unclaimed yield",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "1nOqzs18E4qagcl7oFGE69",
          "title": "Theft of unclaimed royalties",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "4QI2VIKqoqbqfbKlGvTZ2b",
          "title": "Permanent freezing of unclaimed yield",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "2LZq14Cife15KviJBVVNSO",
          "title": "Permanent freezing of unclaimed royalties",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "9TDLFcJrZR2Q8wvvpDpJq",
          "title": "Temporary freezing of funds",
          "type": "smart_contract",
          "severity": "high"
        },
        {
          "id": "4XBe8dE9tsW3MIwbgSXopp",
          "title": "Smart contract unable to operate due to lack of token funds",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "2h4oivvr1xxBhoJAkhL7ax",
          "title": "Block stuffing",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "5fE3RpKz965QbNbP6DblL4",
          "title": "Griefing (e.g. no profit motive for an attacker, but damage to the users or the protocol)",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "7JRDwC3SDPTnZhbQOdpp1s",
          "title": "Theft of gas",
          "type": "smart_contract",
          "severity": "medium"
        },
        {
          "id": "2bumgOSuvdlnHy9HiSmOwB",
          "title": "Unbounded gas consumption",
          "type": "smart_contract",
          "severity": "medium"
        }
      ],
      "programOverview": "The TruFin Protocol builds institutional-grade DeFi primitives that can be used as the foundational building blocks for complex digital asset strategies to reduce risk while generating rewards, securely on-chain.\nTruFin’s first product, TruStake, is a MATIC staking vault which provides access to MATIC staking on the Ethereum network.\n\nThe TruStake vault has custom functionality that enables the allocation of rewards to designated wallet addresses, as well as auto-restaking that compounds rewards for higher APY.\n\nTruMATIC is the liquid staking token users receive when they deposit MATIC into the TruStake vault. \n\nThis bug bounty program is focused around the TruStake smart contract and whitelist and is primarily concerned with the loss of user funds.\n\nRewards are allocated based on the severity of the bug disclosed. The scope, terms and rewards are at the sole discretion of the TruFin Protocol.\n\nFor more information about TruFin, please visit [https://trufin.io.](https://trufin.io) \n\nTruFin provides rewards in USDC. For more details about the payment process, please view the Rewards by Threat Level section further below. \n\n__Responsible Publication__\n\nTruFin adheres to category 3. This Policy determines what information whitehats are allowed to make public from their submitted bug reports. For more information about the category selected, please refer to our [Responsible Publication](https://immunefi.com/responsible-publication/) page.\n\n__Primacy of Impact vs Primacy of Rules__\n\nTruFin adheres to the Primacy of Impact for the following impacts:\n- Smart Contract - Critical\n- Smart Contract - High\n- Smart Contract - Medium\n\nIf an impact is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact. \n\nAll other impacts are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\nIf a category’s severity level is covered within the Primacy of Impact, it means that even if the impacted asset is not in-scope but is owned by the project, then it would be considered as in-scope of the bug bounty program as long as it involves an impact under that respective severity level. When submitting a report, just select the Primacy of Impact asset placeholder. If the team behind this project has multiple projects, those other projects are not covered under the Primacy of Impact of this program. Instead, check if those other projects have a bug bounty program on Immunefi.\n\nTestnet and mock files are not covered under the Primacy of Impact.\n\nAll other severity levels not listed here are considered under the Primacy of Rules, which means that they are bound by the terms of the bug bounty program.\n\n__Immunefi Standard Badge__\n\nTruFin has satisfied the requirements for the [Immunefi Standard Badge,](https://immunefisupport.zendesk.com/hc/en-us/articles/6427157117713-The-Immunefi-Standard-Badge-) which is given to projects that adhere to our best practices. \t\n",
      "prioritizedVulnerabilities": "Only the following impacts are accepted within this bug bounty program. All other impacts are not considered as in-scope, even if they affect something in the assets in scope table.",
      "rewardsBody": "Rewards are distributed according to the impact the vulnerability could otherwise cause based on the Impacts in Scope table further below. \n\n__Repeatable Attack Limitations__\n\nIn cases of repeatable attacks for smart contract bugs, only the first attack will be counted, regardless of whether the smart contract is upgradable, pausable, or killable.\n\n__Public Disclosure of Known Issues__\n\nBug reports covering previously discovered bugs acknowledged below are not eligible for any reward through the bug bounty program. \n\n- The contract assumes that there is no slashing for Polygon validators (as it is currently the case). Any issue related to slashing will not be considered.\n- The TruFin vault offers an allocation feature that enables a user to allocate rewards from the staked MATIC. The amount allocated may exceed the total value currently staked by the user, which is fine. The user will still be required to have enough MATIC or TruMATIC in their wallet at the point at which distributions are made, hence no issue related to users not having enough to cover allocation’s distributions will be considered a bug.\n- Issues related to changing the privacy status of validators will not be considered as these are managed by the contract’s owners and only subject to be used in rare conditions.\n\n__Feasibility Limitations__\n\nBug reports that require an attack that involve one or more other protocols (e.g. utilizing flash loans from a margin protocol or manipulating the spot prices on a DEX), either to make an attack more severe than it would be in isolation, or to achieve an attack that would otherwise be impossible or infeasible, would be both a reduction in the severity level and a corresponding decrease in the payout. However, they will be considered as in-scope and categorized according to the program rules as long as all of the following are true:\n- Losses or other negative effects of the attack are inflicted upon TruFin ecosystem participants. \n- The additional protocols used must have enough liquidity in various assets to allow the attack to succeed at the time of bug report submission. For example: if an attack requires an ETH flash loan, but the amount is larger than all the ETH available for loan across the ecosystem\n\n__Proof of Concept (PoC) Requirements__\n\nA PoC is required for the following severity levels:\n- Smart Contract - Critical\n- Smart Contract - High\n- Smart Contract - Medium\n\nAll PoCs submitted must comply with the Immunefi-wide [PoC Guidelines and Rules.](https://immunefisupport.zendesk.com/hc/en-us/articles/9946217628561-Proof-of-Concept-PoC-Guidelines-and-Rules) Bug report submissions without a PoC when a PoC is required will not be provided with a reward.\n\n__Reward Payment Terms__\n\nPayouts are handled by the Trufin team directly and are denominated in USD. However, payments are done in USDC. \n",
      "outOfScopeAndRules": "These impacts are out of scope for this bug bounty program. \n\n__All Categories__\n\n- Impacts requiring attacks that the reporter has already exploited themselves, leading to damage\n- Impacts caused by attacks requiring access to leaked keys/credentials\n- Impacts caused by attacks requiring access to privileged addresses (governance, strategist) except in such cases where the contracts are intended to have no privileged access to functions that make the attack possible\n- Best practice recommendations\n- Feature requests\n- Impacts on test files and configuration files unless stated otherwise in the bug bounty program\n\n__Smart Contracts__\n\n- Incorrect data supplied by third party oracles\n   - Not to exclude oracle manipulation/flash loan attacks\n- Impacts requiring basic economic and governance attacks (e.g. 51% attack)\n- Lack of liquidity impacts\n- Impacts from Sybil attacks\n- Impacts involving centralization risks\n- Impacts caused by bugs found in external libraries used by the contract\n- Best practice recommendations\n\nThe following activities are prohibited by this bug bounty program:\n\n- Any testing on mainnet or public testnet deployed code; all testing should be done on local-forks of either public testnet or mainnet\n- Any testing with pricing oracles or third-party smart contracts\n- Attempting phishing or other social engineering attacks against our employees and/or customers\n- Any testing with third-party systems and applications (e.g. browser extensions) as well as websites (e.g. SSO providers, advertising networks)\n- Any denial of service attacks that are executed against project assets\n- Automated testing of services that generates significant amounts of traffic\n- Public disclosure of an unpatched vulnerability in an embargoed bounty\n",
      "assetsBodyV2": "Documentation for the assets provided in the table can be found at [https://trufin.gitbook.io/docs/. ](https://trufin.gitbook.io/docs/)\n",
      "impactsBody": null,
      "immunefiStandard": true,
      "tags": {
        "productType": [
          "Staking"
        ],
        "projectType": [
          "Defi"
        ],
        "ecosystem": [
          "ETH",
          "Polygon"
        ],
        "programType": [
          "Smart Contract"
        ],
        "language": [
          "Solidity"
        ]
      },
      "legacy": {
        "technologies": [
          "Smart Contract",
          "Websites and Applications"
        ],
        "blockchain_rewards": [],
        "smartcontract_rewards": [
          {
            "level": "Critical",
            "payout": "USD $35,000"
          },
          {
            "level": "High",
            "payout": "USD $20,000"
          },
          {
            "level": "Medium",
            "payout": "USD $4,000"
          }
        ],
        "web_rewards": []
      },
      "premiumTriaging": false
    },
    "project": {
      "premiumTriaging": false
    }
  },
  "__N_SSG": true
}
